{"symbol": "F", "text": "SECTION F — MECHANICAL ENGINEERING; LIGHTING; HEATING; WEAPONS; BLASTING", "children": [{"symbol": "F01", "text": "MACHINES OR ENGINES IN GENERAL", "children": [{"symbol": "F01B", "text": "MACHINES OR ENGINES, IN GENERAL OR OF POSITIVE-DISPLACEMENT TYPE, e.g. STEAM ENGINES", "children": [{"symbol": "F01B 1/00", "text": "Reciprocating-piston machines or engines characterised by number or relative disposition of cylinders or by being built-up from separate cylinder-crankcase elements"}, {"symbol": "F01B 3/00", "text": "Reciprocating-piston machines or engines with cylinder axes coaxial with, or parallel or inclined to, main shaft axis"}, {"symbol": "F01B 5/00", "text": "Reciprocating-piston machines or engines with cylinder axes arranged substantially tangentially to a circle centred on main shaft axis"}, {"symbol": "F01B 7/00", "text": "Machines or engines with two or more pistons reciprocating within same cylinder or within essentially coaxial cylinders"}, {"symbol": "F01B 9/00", "text": "Reciprocating-piston machines or engines characterised by connections between pistons and main shafts and not specific to groups F01B 1/00 to F01B 7/00"}, {"symbol": "F01B 11/00", "text": "Reciprocating-piston machines or engines without rotary main shaft, e.g. of free-piston type"}, {"symbol": "F01B 13/00", "text": "Reciprocating-piston machines or engines with rotating cylinders in order to obtain the reciprocating-piston motion"}, {"symbol": "F01B 15/00", "text": "Reciprocating-piston machines or engines with movable cylinders other than provided for in group F01B 13/00"}, {"symbol": "F01B 17/00", "text": "Reciprocating-piston machines or engines characterised by use of uniflow principle"}, {"symbol": "F01B 19/00", "text": "Positive-displacement machines or engines of flexible-wall type"}, {"symbol": "F01B 21/00", "text": "Combinations of two or more machines or engines"}, {"symbol": "F01B 23/00", "text": "Adaptations of machines or engines for special use; Combinations of engines with devices driven thereby"}, {"symbol": "F01B 25/00", "text": "Regulating, controlling, or safety means"}, {"symbol": "F01B 27/00", "text": "Starting of machines or engines"}, {"symbol": "F01B 29/00", "text": "Machines or engines with pertinent characteristics other than those provided for in main groups F01B 1/00 to F01B 27/00"}, {"symbol": "F01B 31/00", "text": "Component parts, details, or accessories not provided for in, or of interest apart from, other groups"}]}, {"symbol": "F01C", "text": "ROTARY-PISTON OR OSCILLATING-PISTON MACHINES OR ENGINES", "children": [{"symbol": "F01C 1/00", "text": "Rotary-piston machines or engines"}, {"symbol": "F01C 3/00", "text": "Rotary-piston machines or engines with non-parallel axes of movement of co-operating members"}, {"symbol": "F01C 5/00", "text": "Rotary-piston machines or engines with the working-chamber walls at least partly resiliently deformable"}, {"symbol": "F01C 7/00", "text": "Rotary-piston machines or engines with fluid ring or the like"}, {"symbol": "F01C 9/00", "text": "Oscillating-piston machines or engines"}, {"symbol": "F01C 11/00", "text": "Combinations of two or more machines or engines, each being of rotary-piston or oscillating-piston type"}, {"symbol": "F01C 13/00", "text": "Adaptations of machines or engines for special use; Combinations of engines with devices driven thereby"}, {"symbol": "F01C 17/00", "text": "Arrangements for drive of co-operating members, e.g. for rotary piston and casing"}, {"symbol": "F01C 19/00", "text": "Sealing arrangements in rotary-piston machines or engines"}, {"symbol": "F01C 20/00", "text": "Control of, monitoring of, or safety arrangements for, machines or engines"}, {"symbol": "F01C 21/00", "text": "Component parts, details, or accessories, not provided for in groups F01C 1/00 to F01C 20/00"}]}, {"symbol": "F01D", "text": "NON-POSITIVE-DISPLACEMENT MACHINES OR ENGINES, e.g. STEAM TURBINES", "children": [{"symbol": "F01D 1/00", "text": "Non-positive-displacement machines or engines, e.g. steam turbines"}, {"symbol": "F01D 3/00", "text": "Machines or engines with axial-thrust balancing effected by working fluid"}, {"symbol": "F01D 5/00", "text": "Blades; Blade-carrying members", "children": [{"symbol": "F01D 5/02", "text": "Blade-carrying members, e.g. rotors (rotors of non-bladed type F01D 1/00; stators F01D 9/00)"}, {"symbol": "F01D 5/12", "text": "Blades (blade roots F01D 5/00; rotors with blades adjustable in operation F01D 7/00; stator blades F01D 9/02)", "children": [{"symbol": "F01D 5/14", "text": "Form or construction (selecting particular materials, measures against erosion or corrosion F01D 5/28)", "children": [{"symbol": "F01D 5/18", "text": "Hollow blades; Heating, heat-insulating, or cooling means on blades"}]}, {"symbol": "F01D 5/28", "text": "Selecting particular materials; Measures against erosion or corrosion"}]}]}, {"symbol": "F01D 7/00", "text": "Rotors with blades adjustable in operation; Control thereof"}, {"symbol": "F01D 9/00", "text": "Stators", "children": [{"symbol": "F01D 9/02", "text": "Nozzles; Nozzle boxes; Stator blades; Guide conduits", "children": [{"symbol": "F01D 9/04", "text": "forming ring or sector"}]}]}, {"symbol": "F01D 11/00", "text": "Preventing or minimising internal leakage of working fluid, e.g. between stages", "children": [{"symbol": "F01D 11/08", "text": "for sealing space between rotor blade tips and stator (specially-shaped blade tips therefor F01D 5/14)"}]}, {"symbol": "F01D 13/00", "text": "Combinations of two or more machines or engines"}, {"symbol": "F01D 15/00", "text": "Adaptations of machines or engines for special use; Combinations of engines with devices driven thereby"}, {"symbol": "F01D 17/00", "text": "Regulating or controlling by varying flow"}, {"symbol": "F01D 19/00", "text": "Starting of machines or engines; Regulating, controlling, or safety means in connection therewith"}, {"symbol": "F01D 21/00", "text": "Shutting-down of machines or engines, e.g. in emergency; Regulating, controlling, or safety means not otherwise provided for"}, {"symbol": "F01D 23/00", "text": "Non-positive-displacement machines or engines with movement other than pure rotation, e.g. of endless-chain type"}, {"symbol": "F01D 25/00", "text": "Component parts, details, or accessories, not provided for in, or of interest apart from, other groups", "children": [{"symbol": "F01D 25/08", "text": "Cooling (of machines or engines in general F01P); Heating; Heat insulation (of blade-carrying members, of blades F01D 5/00)"}, {"symbol": "F01D 25/16", "text": "Arrangement of bearings; Supporting or mounting bearings in casings (bearings <u>per se</u>F16C)"}, {"symbol": "F01D 25/24", "text": "Casings (modified for heating or cooling F01D 25/08); Casing parts, e.g. diaphragms, casing fastenings (casings for rotary machines or engines in general F16M)"}, {"symbol": "F01D 25/28", "text": "Supporting or mounting arrangements, e.g. for turbine casing"}]}]}, {"symbol": "F01K", "text": "STEAM ENGINE PLANTS; STEAM ACCUMULATORS; ENGINE PLANTS NOT OTHERWISE PROVIDED FOR; ENGINES USING SPECIAL WORKING FLUIDS OR CYCLES", "children": [{"symbol": "F01K 1/00", "text": "Steam accumulators"}, {"symbol": "F01K 3/00", "text": "Plants characterised by the use of steam or heat accumulators, or intermediate steam heaters, therein"}, {"symbol": "F01K 5/00", "text": "Plants characterised by use of means for storing steam in an alkali to increase steam pressure, e.g. of Honigmann or Koenemann type"}, {"symbol": "F01K 7/00", "text": "Plants characterised by the use of specific types of engine"}, {"symbol": "F01K 9/00", "text": "Plants characterised by condensers arranged or modified to co-operate with the engines"}, {"symbol": "F01K 11/00", "text": "Plants characterised by the engines being structurally combined with boilers or condensers"}, {"symbol": "F01K 13/00", "text": "General layout or general methods of operation, of complete plants"}, {"symbol": "F01K 15/00", "text": "Adaptations of plants for special use"}, {"symbol": "F01K 17/00", "text": "Use of steam or condensate extracted or exhausted from steam engine plant"}, {"symbol": "F01K 19/00", "text": "Regenerating or otherwise treating steam exhaust from steam engine plant"}, {"symbol": "F01K 21/00", "text": "Steam engine plants not otherwise provided for"}, {"symbol": "F01K 23/00", "text": "Plants characterised by more than one engine delivering power external to the plant, the engines being driven by different fluids", "children": [{"symbol": "F01K 23/02", "text": "the engine cycles being thermally coupled", "children": [{"symbol": "F01K 23/06", "text": "combustion heat from one cycle heating the fluid in another cycle", "children": [{"symbol": "F01K 23/10", "text": "with exhaust fluid of one cycle heating the fluid in another cycle"}]}]}]}, {"symbol": "F01K 25/00", "text": "Plants or engines characterised by use of special working fluids, not otherwise provided for; Plants operating in closed cycles and not otherwise provided for"}, {"symbol": "F01K 27/00", "text": "Plants for converting heat or fluid energy into mechanical energy, not otherwise provided for"}]}, {"symbol": "F01L", "text": "CYCLICALLY OPERATING VALVES FOR MACHINES OR ENGINES", "children": [{"symbol": "F01L 1/00", "text": "Valve-gear or valve arrangements, e.g. lift-valve gear", "children": [{"symbol": "F01L 1/02", "text": "Valve drive (transmitting-gear between valve drive and valve F01L 1/12)", "children": [{"symbol": "F01L 1/04", "text": "by means of cams, camshafts, cam discs, eccentrics, or the like (F01L 1/10 takes precedence)", "children": [{"symbol": "F01L 1/08", "text": "Shape of cams"}]}, {"symbol": "F01L 1/10", "text": "by means of crank- or eccentric-driven rods"}]}, {"symbol": "F01L 1/12", "text": "Transmitting-gear between valve drive and valve (simultaneously operating two or more valves F01L 1/26)", "children": [{"symbol": "F01L 1/14", "text": "Tappets; Push-rods"}, {"symbol": "F01L 1/18", "text": "Rocking arms or levers"}]}, {"symbol": "F01L 1/20", "text": "Adjusting or compensating clearance, i.e. lash adjustment"}, {"symbol": "F01L 1/26", "text": "characterised by the provision of two or more valves operated simultaneously by same transmitting-gear; peculiar to machines or engines with more than two lift valves per cylinder (with coaxial valves F01L 1/28)"}, {"symbol": "F01L 1/28", "text": "characterised by the provision of coaxial valves; characterised by the provision of valves co-operating with both intake and exhaust ports"}, {"symbol": "F01L 1/34", "text": "characterised by the provision of means for changing the timing of the valves without changing the duration of opening", "children": [{"symbol": "F01L 1/344", "text": "changing the angular relationship between crankshaft and camshaft, e.g. using helicoidal gear"}]}]}, {"symbol": "F01L 3/00", "text": "Lift valves, i.e. cut-off apparatus with closure members having at least a component of their opening and closing motion perpendicular to the closing faces; Parts or accessories thereof", "children": [{"symbol": "F01L 3/02", "text": "Selecting particular materials for valve members or valve seats; Valve members or valve seats composed of two or more materials"}, {"symbol": "F01L 3/10", "text": "Connecting springs to valve members"}]}, {"symbol": "F01L 5/00", "text": "Slide-valve gear or valve arrangements"}, {"symbol": "F01L 7/00", "text": "Rotary or oscillatory slide-valve gear or valve arrangements"}, {"symbol": "F01L 9/00", "text": "Valve-gear or valve arrangements actuated non-mechanically", "children": [{"symbol": "F01L 9/04", "text": "by electric means"}]}, {"symbol": "F01L 11/00", "text": "Valve arrangements in working piston or piston-rod"}, {"symbol": "F01L 13/00", "text": "Modifications of valve-gear to facilitate reversing, braking, starting, changing compression ratio, or other specific operations", "children": [{"symbol": "F01L 13/02", "text": "for reversing"}, {"symbol": "F01L 13/04", "text": "for starting by means of fluid pressure"}, {"symbol": "F01L 13/06", "text": "for braking"}, {"symbol": "F01L 13/08", "text": "for decompression, e.g. during starting; for changing compression ratio"}]}, {"symbol": "F01L 15/00", "text": "Valve-gear or valve arrangements, e.g. with reciprocatory slide valves, other than provided for in groups F01L 17/00 to F01L 29/00"}, {"symbol": "F01L 17/00", "text": "Slide-valve gear or valve arrangements with cylindrical, sleeve, or part-annularly-shaped valves surrounding working cylinder or piston"}, {"symbol": "F01L 19/00", "text": "Slide-valve gear or valve arrangements with reciprocatory and other movement of same valve, other than provided for in group F01L 17/00, e.g. longitudinally and in cross direction of working cylinder"}, {"symbol": "F01L 21/00", "text": "Use of working pistons or piston-rods as fluid-distributing valves or as valve-supporting elements, e.g. in free-piston machines"}, {"symbol": "F01L 23/00", "text": "Valves controlled by impact of piston, e.g. in free-piston machines"}, {"symbol": "F01L 25/00", "text": "Drive, or adjustment during operation, of distribution or expansion valves by non-mechanical means"}, {"symbol": "F01L 27/00", "text": "Distribution or expansion-valve gear peculiar to free-piston machines or engines and not provided for in groups F01L 21/00 to F01L 25/00"}, {"symbol": "F01L 29/00", "text": "Reversing-gear"}, {"symbol": "F01L 31/00", "text": "Valve drive, valve adjustment during operation, or other valve control, not provided for in groups F01L 15/00 to F01L 29/00"}, {"symbol": "F01L 33/00", "text": "Rotary or oscillatory slide-valve gear or valve arrangements"}, {"symbol": "F01L 35/00", "text": "Lift-valve gear or valve arrangements"}]}, {"symbol": "F01M", "text": "LUBRICATING OF MACHINES OR ENGINES IN GENERAL", "children": [{"symbol": "F01M 1/00", "text": "Pressure lubrication", "children": [{"symbol": "F01M 1/02", "text": "using lubricating pumps (pumps in general F04; lubricating pumps <u>per se</u>F16N)"}, {"symbol": "F01M 1/06", "text": "Lubricating systems characterised by the provision therein of crankshafts or connecting-rods with lubricant passageways, e.g. bores (crankshafts, connecting-rods, <u>per se</u>F16C)"}, {"symbol": "F01M 1/16", "text": "Controlling lubricant pressure or quantity (rendering machines or engines inoperative or idling on lubricant-pressure failure F01M 1/00)"}]}, {"symbol": "F01M 3/00", "text": "Lubrication specially adapted for engines with crankcase compression of fuel-air mixture, or for other engines in which lubricant is contained in fuel, combustion air, or fuel-air mixture"}, {"symbol": "F01M 5/00", "text": "Heating, cooling, or controlling temperature of lubricant"}, {"symbol": "F01M 7/00", "text": "Lubrication means specially adapted for machine or engine running-in"}, {"symbol": "F01M 9/00", "text": "Lubrication means having pertinent characteristics not provided for in, or of interest apart from, groups F01M 1/00 to F01M 7/00"}, {"symbol": "F01M 11/00", "text": "Component parts, details, or accessories, not provided for in, or of interest apart from, groups F01M 1/00 to F01M 9/00", "children": [{"symbol": "F01M 11/02", "text": "Arrangements of lubricant conduits"}, {"symbol": "F01M 11/03", "text": "Mounting or connecting of lubricant purifying means relative to the machine or engine; Details of lubricant purifying means (filters B01D)"}, {"symbol": "F01M 11/04", "text": "Filling or draining lubricant of or from machines or engines"}, {"symbol": "F01M 11/10", "text": "Indicating devices; Other safety devices"}]}, {"symbol": "F01M 13/00", "text": "Crankcase ventilating or breathing"}]}, {"symbol": "F01N", "text": "GAS-FLOW SILENCERS OR EXHAUST APPARATUS FOR MACHINES OR ENGINES IN GENERAL; GAS-FLOW SILENCERS OR EXHAUST APPARATUS FOR INTERNAL-COMBUSTION ENGINES", "children": [{"symbol": "F01N 1/00", "text": "Silencing apparatus characterised by method of silencing", "children": [{"symbol": "F01N 1/02", "text": "by using resonance"}, {"symbol": "F01N 1/06", "text": "by using interference effect"}, {"symbol": "F01N 1/08", "text": "by reducing exhaust energy by throttling or whirling"}, {"symbol": "F01N 1/14", "text": "by adding air to exhaust gases"}, {"symbol": "F01N 1/16", "text": "by using movable parts"}, {"symbol": "F01N 1/24", "text": "by using sound-absorbing materials (F01N 1/02, F01N 1/06, F01N 1/08, F01N 1/14, F01N 1/16 take precedence)"}]}, {"symbol": "F01N 3/00", "text": "Exhaust or silencing apparatus having means for purifying, rendering innocuous, or otherwise treating exhaust", "children": [{"symbol": "F01N 3/02", "text": "for cooling, or for removing solid constituents of, exhaust (by means of electric or electrostatic separators F01N 3/00)", "children": [{"symbol": "F01N 3/021", "text": "by means of filters", "children": [{"symbol": "F01N 3/022", "text": "characterised by specially adapted filtering structure, e.g. honeycomb, mesh or fibrous"}, {"symbol": "F01N 3/023", "text": "using means for regenerating the filters, e.g. by burning trapped particles"}, {"symbol": "F01N 3/031", "text": "having means for by-passing filters, e.g. when clogged or during cold engine start"}, {"symbol": "F01N 3/033", "text": "in combination with other devices", "children": [{"symbol": "F01N 3/035", "text": "with catalytic reactors"}]}]}, {"symbol": "F01N 3/037", "text": "by means of inertial or centrifugal separators, e.g. associated with agglomerators"}, {"symbol": "F01N 3/038", "text": "by means of perforated plates defining expansion chambers associated with condensation and collection chambers"}, {"symbol": "F01N 3/04", "text": "by means of liquids"}, {"symbol": "F01N 3/05", "text": "by means of air, e.g. by mixing exhaust with air (silencers working by addition of air to exhaust F01N 1/14; arrangements for the supply of additional air for the thermal or catalytic conversion of noxious components of exhaust F01N 3/30)"}]}, {"symbol": "F01N 3/08", "text": "for rendering innocuous (using electric or electrostatic separators F01N 3/00; chemical aspects B01D 53/92)", "children": [{"symbol": "F01N 3/10", "text": "by thermal or catalytic conversion of noxious components of exhaust", "children": [{"symbol": "F01N 3/18", "text": "characterised by methods of operation; Regulation", "children": [{"symbol": "F01N 3/20", "text": "specially adapted for catalytic conversion (F01N 3/22 takes precedence)"}, {"symbol": "F01N 3/22", "text": "Regulation of additional air supply only, e.g. using by-passes or variable air pump drives"}]}, {"symbol": "F01N 3/24", "text": "characterised by constructional aspects of converting apparatus (filtering in combination with catalytic reactors F01N 3/035)", "children": [{"symbol": "F01N 3/26", "text": "Construction of thermal reactors"}, {"symbol": "F01N 3/28", "text": "Construction of catalytic reactors"}, {"symbol": "F01N 3/30", "text": "Arrangements for supply of additional air (regulation, e.g. using by-passes or variable air pump drives, F01N 3/22)"}, {"symbol": "F01N 3/36", "text": "Arrangements for supply of additional fuel"}, {"symbol": "F01N 3/38", "text": "Arrangements for igniting"}]}]}]}]}, {"symbol": "F01N 5/00", "text": "Exhaust or silencing apparatus combined or associated with devices profiting by exhaust energy"}, {"symbol": "F01N 7/00", "text": "Exhaust or silencing apparatus, or parts thereof, having pertinent characteristics not provided for in, or of interest apart from, groups F01N 1/00 to F01N 5/00, F01N 9/00, F01N 11/00", "children": [{"symbol": "F01N 7/08", "text": "Other arrangements or adaptations of exhaust conduits (pipes in general F16L)", "children": [{"symbol": "F01N 7/10", "text": "of exhaust manifolds"}]}, {"symbol": "F01N 7/14", "text": "having thermal insulation"}, {"symbol": "F01N 7/18", "text": "Construction facilitating manufacture, assembly, or disassembly"}]}, {"symbol": "F01N 9/00", "text": "Electrical control of exhaust gas treating apparatus"}, {"symbol": "F01N 11/00", "text": "Monitoring or diagnostic devices for exhaust-gas treatment apparatus"}]}, {"symbol": "F01P", "text": "COOLING OF MACHINES OR ENGINES IN GENERAL; COOLING OF INTERNAL-COMBUSTION ENGINES", "children": [{"symbol": "F01P 1/00", "text": "Air cooling"}, {"symbol": "F01P 3/00", "text": "Liquid cooling", "children": [{"symbol": "F01P 3/02", "text": "Arrangements for cooling cylinders or cylinder heads"}, {"symbol": "F01P 3/20", "text": "Cooling circuits not specific to a single part of engine or machine (F01P 3/22 takes precedence)"}, {"symbol": "F01P 3/22", "text": "characterised by evaporation and condensation of coolant in closed cycles (other cooling by evaporation F01P 9/00); characterised by the coolant reaching higher temperatures than normal atmospheric boiling-point"}]}, {"symbol": "F01P 5/00", "text": "Pumping cooling-air or liquid coolants", "children": [{"symbol": "F01P 5/02", "text": "Pumping cooling-air; Arrangements of cooling-air pumps, e.g. fans or blowers"}]}, {"symbol": "F01P 7/00", "text": "Controlling of coolant flow", "children": [{"symbol": "F01P 7/14", "text": "the coolant being liquid"}]}, {"symbol": "F01P 9/00", "text": "Cooling having pertinent characteristics not provided for in, or of interest apart from, groups F01P 1/00 to F01P 7/00"}, {"symbol": "F01P 11/00", "text": "Component parts, details, or accessories, not provided for in, or of interest apart from, groups F01P 1/00 to F01P 9/00", "children": [{"symbol": "F01P 11/08", "text": "Arrangements of lubricant coolers (in lubrication apparatus F01M)"}, {"symbol": "F01P 11/10", "text": "Guiding or ducting cooling-air to or from liquid-to-air heat-exchangers"}, {"symbol": "F01P 11/14", "text": "Indicating devices; Other safety devices"}]}]}]}, {"symbol": "F02", "text": "COMBUSTION ENGINES", "children": [{"symbol": "F02B", "text": "INTERNAL-COMBUSTION PISTON ENGINES; COMBUSTION ENGINES IN GENERAL", "children": [{"symbol": "F02B 1/00", "text": "Engines with fuel-air mixture compression"}, {"symbol": "F02B 3/00", "text": "Engines with air compression and subsequent fuel addition"}, {"symbol": "F02B 5/00", "text": "Engines with positive ignition"}, {"symbol": "F02B 7/00", "text": "Engines with fuel-air charge ignited by compression ignition of an additional fuel"}, {"symbol": "F02B 9/00", "text": "Engines characterised by other types of ignition"}, {"symbol": "F02B 11/00", "text": "Engines with both fuel-air mixture compression and air compression, or with both positive ignition and compression ignition, e.g. in different cylinders"}, {"symbol": "F02B 13/00", "text": "Engines with introduction of fuel into cylinders by use of auxiliary fluid"}, {"symbol": "F02B 15/00", "text": "Engines characterised by method of introducing fuel into cylinders and not otherwise provided for"}, {"symbol": "F02B 17/00", "text": "Engines characterised by means for effecting stratification of charge in cylinders"}, {"symbol": "F02B 19/00", "text": "Engines with precombustion chambers", "children": [{"symbol": "F02B 19/08", "text": "the chamber being of air-swirl type"}]}, {"symbol": "F02B 21/00", "text": "Engines having air-storage chambers"}, {"symbol": "F02B 23/00", "text": "Other engines having special shape or construction of combustion chambers to improve operation", "children": [{"symbol": "F02B 23/02", "text": "with compression ignition"}, {"symbol": "F02B 23/08", "text": "with positive ignition", "children": [{"symbol": "F02B 23/10", "text": "with separate admission of air and fuel into cylinder"}]}]}, {"symbol": "F02B 25/00", "text": "Engines using fresh charge for scavenging cylinders"}, {"symbol": "F02B 27/00", "text": "Use of kinetic or wave energy of charge in induction systems, or of combustion residues in exhaust systems, for improving quantity of charge or for increasing removal of combustion residues", "children": [{"symbol": "F02B 27/02", "text": "the systems having variable, i.e. adjustable, cross-sectional areas, chambers of variable volume, or like variable means (in exhaust systems only F02B 27/00)"}]}, {"symbol": "F02B 29/00", "text": "Engines characterised by other provisions for charging or scavenging; Details not provided for in, or of interest apart from, groups F02B 25/00 and F02B 27/00"}, {"symbol": "F02B 31/00", "text": "Modifying induction systems for imparting a rotation to the charge in the cylinder"}, {"symbol": "F02B 33/00", "text": "Engines with pumps for charging or scavenging", "children": [{"symbol": "F02B 33/02", "text": "Engines with reciprocating-piston pumps; Engines with crankcase pumps"}, {"symbol": "F02B 33/44", "text": "Passages conducting the charge from the pump to the engine inlet, e.g. reservoirs (cooling of charge after leaving pump F02B 29/00)"}]}, {"symbol": "F02B 35/00", "text": "Engines with pumps for sucking combustion residues from cylinders"}, {"symbol": "F02B 37/00", "text": "Engines with pumps driven at least for part of the time by exhaust", "children": [{"symbol": "F02B 37/007", "text": "with exhaust-driven pumps arranged in parallel"}, {"symbol": "F02B 37/013", "text": "with exhaust-driven pumps arranged in series"}, {"symbol": "F02B 37/02", "text": "Gas passages between engine outlet and pump drive, e.g. reservoirs"}, {"symbol": "F02B 37/04", "text": "Engines with exhaust drive and other drive of pumps, e.g. with exhaust-driven pump and mechanically-driven second pump"}, {"symbol": "F02B 37/12", "text": "Control of the pumps", "children": [{"symbol": "F02B 37/18", "text": "by bypassing exhaust"}]}]}, {"symbol": "F02B 39/00", "text": "Component parts, details, or accessories relating to, but not provided for in, or of interest apart from, groups F02B 33/00 to F02B 37/00", "children": [{"symbol": "F02B 39/02", "text": "Drives of pumps (exhaust drives or combined exhaust and other drives F02B 37/00); Varying pump drive gear ratio (control acting both on engine and on pump drive gear ratio F02D)"}]}, {"symbol": "F02B 41/00", "text": "Engines with special means for improving conversion of heat or pressure energy into mechanical power"}, {"symbol": "F02B 43/00", "text": "Engines operating on gaseous fuels; Plants including such engines"}, {"symbol": "F02B 45/00", "text": "Engines operating on other non-liquid fuels; Plants including such engines"}, {"symbol": "F02B 47/00", "text": "Methods of operating engines involving adding non-fuel substances or anti-knock agents to combustion air, fuel, or fuel-air mixtures of engines"}, {"symbol": "F02B 49/00", "text": "Methods of operating air-compressing compression-ignition engines involving introduction of small quantities of fuel in the form of a fine mist into the air in the engine's intake"}, {"symbol": "F02B 51/00", "text": "Other methods of operating engines involving pre-treating of, or adding substances to, combustion air, fuel, or fuel-air mixture of the engines"}, {"symbol": "F02B 53/00", "text": "Internal-combustion aspects of rotary-piston or oscillating-piston engines"}, {"symbol": "F02B 55/00", "text": "Internal-combustion aspects of rotary pistons; Outer members for co-operation with rotary pistons"}, {"symbol": "F02B 57/00", "text": "Internal-combustion aspects of rotary engines in which the combusted gases displace one or more reciprocating pistons"}, {"symbol": "F02B 59/00", "text": "Internal-combustion aspects of other reciprocating-piston engines with movable, e.g. oscillating, cylinders"}, {"symbol": "F02B 61/00", "text": "Adaptations of engines for driving vehicles or for driving propellers; Combinations of engines with gearing"}, {"symbol": "F02B 63/00", "text": "Adaptations of engines for driving hand-held tools, electric generators, or pumps; Portable combinations with engine-driven devices"}, {"symbol": "F02B 65/00", "text": "Adaptations of engines for other special use; Combinations of engines with other devices, e.g. with non-driven apparatus"}, {"symbol": "F02B 67/00", "text": "Engines characterised by the arrangement of auxiliary apparatus not being otherwise provided for, e.g. the apparatus having different functions; Driving auxiliary apparatus from engines, not otherwise provided for", "children": [{"symbol": "F02B 67/04", "text": "of mechanically-driven auxiliary apparatus", "children": [{"symbol": "F02B 67/06", "text": "driven by means of chains, belts, or like endless members"}]}]}, {"symbol": "F02B 69/00", "text": "Internal-combustion engines convertible into other combustion-engine type, not provided for in group F02B 11/00; Internal-combustion engines of different types characterised by constructions facilitating use of same main engine-parts in different types"}, {"symbol": "F02B 71/00", "text": "Free-piston engines; Engines without rotary main shaft"}, {"symbol": "F02B 73/00", "text": "Combinations of two or more engines, not otherwise provided for"}, {"symbol": "F02B 75/00", "text": "Other engines, e.g. single-cylinder engines", "children": [{"symbol": "F02B 75/02", "text": "Engines characterised by their cycles, e.g. six-stroke"}, {"symbol": "F02B 75/32", "text": "Engines characterised by connections between pistons and main shafts and not specific to preceding main groups"}]}, {"symbol": "F02B 77/00", "text": "Component parts, details, or accessories, not otherwise provided for", "children": [{"symbol": "F02B 77/02", "text": "Surface coverings of combustion-gas-swept parts (of pistons or cylinders only F02F)"}, {"symbol": "F02B 77/04", "text": "Cleaning of, preventing corrosion or erosion in, or preventing unwanted deposits in, combustion engines"}, {"symbol": "F02B 77/08", "text": "Safety, indicating, or supervising devices (thermal insulation F02B 77/11; monitoring or diagnostic devices for exhaust-gas treatment apparatus F01N 11/00)", "children": [{"symbol": "F02B 77/10", "text": "Safety means relating to crankcase explosions"}]}, {"symbol": "F02B 77/11", "text": "Thermal or acoustic insulation"}, {"symbol": "F02B 77/14", "text": "Engine-driven auxiliary devices combined into units"}]}, {"symbol": "F02B 79/00", "text": "Running-in of internal-combustion engines"}]}, {"symbol": "F02C", "text": "GAS-TURBINE PLANTS; AIR INTAKES FOR JET-PROPULSION PLANTS; CONTROLLING FUEL SUPPLY IN AIR-BREATHING JET-PROPULSION PLANTS", "children": [{"symbol": "F02C 1/00", "text": "Gas-turbine plants characterised by the use of hot gases or unheated pressurised gases, as the working fluid"}, {"symbol": "F02C 3/00", "text": "Gas-turbine plants characterised by the use of combustion products as the working fluid", "children": [{"symbol": "F02C 3/20", "text": "using a special fuel, oxidant, or dilution fluid to generate the combustion products", "children": [{"symbol": "F02C 3/26", "text": "the fuel or oxidant being solid or pulverulent, e.g. in slurry or suspension"}]}]}, {"symbol": "F02C 5/00", "text": "Gas-turbine plants characterised by the working fluid being generated by intermittent combustion"}, {"symbol": "F02C 6/00", "text": "Plural gas-turbine plants; Combinations of gas-turbine plants with other apparatus", "children": [{"symbol": "F02C 6/18", "text": "using the waste heat of gas-turbine plants outside the plants themselves, e.g. gas-turbine power heat plants (using waste heat as source of energy for refrigeration plants F25B 27/02)"}]}, {"symbol": "F02C 7/00", "text": "Features, component parts, details or accessories, not provided for in, or of interest apart from, groups F02C 1/00 to F02C 6/00; Air intakes for jet-propulsion plants", "children": [{"symbol": "F02C 7/04", "text": "Air intakes for gas-turbine plants or jet-propulsion plants"}, {"symbol": "F02C 7/06", "text": "Arrangement of bearings (bearings F16C); Lubricating (of engines in general F01M)"}, {"symbol": "F02C 7/08", "text": "Heating air supply before combustion, e.g. by exhaust gases"}, {"symbol": "F02C 7/12", "text": "Cooling of plants (of component parts, <u>see</u> the relevant subclasses, e.g. F01D; cooling of engines in general F01P)", "children": [{"symbol": "F02C 7/16", "text": "characterised by cooling medium"}]}, {"symbol": "F02C 7/20", "text": "Mounting or supporting of plant; Accommodating heat expansion or creep"}, {"symbol": "F02C 7/22", "text": "Fuel supply systems"}, {"symbol": "F02C 7/24", "text": "Heat or noise insulation (air intakes having provisions for noise suppression F02C 7/04; turbine exhaust heads, chambers, or the like F01D 25/00; silencing nozzles of jet-propulsion plants F02K 1/00)"}, {"symbol": "F02C 7/26", "text": "Starting; Ignition"}, {"symbol": "F02C 7/28", "text": "Arrangement of seals"}]}, {"symbol": "F02C 9/00", "text": "Controlling gas-turbine plants; Controlling fuel supply in air-breathing jet-propulsion plants"}]}, {"symbol": "F02D", "text": "CONTROLLING COMBUSTION ENGINES", "children": [{"symbol": "F02D 1/00", "text": "Controlling fuel-injection pumps, e.g. of high-pressure injection type", "children": [{"symbol": "F02D 1/02", "text": "not restricted to adjustment of injection timing, e.g. varying amount of fuel delivered", "children": [{"symbol": "F02D 1/04", "text": "by mechanical means dependent on engine speed, e.g. using centrifugal governors (F02D 1/08 takes precedence)"}, {"symbol": "F02D 1/08", "text": "Transmission of control impulse to pump control, e.g. with power drive or power assistance"}]}]}, {"symbol": "F02D 3/00", "text": "Controlling low-pressure fuel injection, i.e. where the air-fuel mixture containing fuel thus injected will be substantially compressed by the compression stroke of the engine, by means other than controlling only an injection pump"}, {"symbol": "F02D 7/00", "text": "Other non-electrical fuel injection control"}, {"symbol": "F02D 9/00", "text": "Controlling engines by throttling air or fuel-and-air induction conduits or exhaust conduits", "children": [{"symbol": "F02D 9/02", "text": "concerning induction conduits (throttle valves, or arrangements thereof in conduits F02D 9/08)"}, {"symbol": "F02D 9/08", "text": "Throttle valves specially adapted therefor; Arrangements of such valves in conduits (throttle valves modified for use in, or arranged in, carburettors F02M; throttle valves in general F16K)"}]}, {"symbol": "F02D 11/00", "text": "Arrangements for, or adaptations to, non-automatic engine control initiation means, e.g. operator initiated", "children": [{"symbol": "F02D 11/06", "text": "characterised by non-mechanical control linkages, e.g. fluid control linkages or by control linkages with power drive or assistance", "children": [{"symbol": "F02D 11/10", "text": "of the electric type"}]}]}, {"symbol": "F02D 13/00", "text": "Controlling the engine output power by varying inlet or exhaust valve operating characteristics, e.g. timing", "children": [{"symbol": "F02D 13/02", "text": "during engine operation", "children": [{"symbol": "F02D 13/04", "text": "using engine as brake"}, {"symbol": "F02D 13/06", "text": "Cutting-out cylinders"}]}]}, {"symbol": "F02D 15/00", "text": "Varying compression ratio"}, {"symbol": "F02D 17/00", "text": "Controlling engines by cutting-out individual cylinders; Rendering engines inoperative or idling"}, {"symbol": "F02D 19/00", "text": "Controlling engines characterised by their use of non-liquid fuels, pluralities of fuels, or non-fuel substances added to the combustible mixtures"}, {"symbol": "F02D 21/00", "text": "Controlling engines characterised by their being supplied with non-airborne oxygen or other non-fuel gas"}, {"symbol": "F02D 23/00", "text": "Controlling engines characterised by their being supercharged"}, {"symbol": "F02D 25/00", "text": "Controlling two or more co-operating engines"}, {"symbol": "F02D 27/00", "text": "Controlling engines characterised by their being reversible"}, {"symbol": "F02D 28/00", "text": "Programme-control of engines"}, {"symbol": "F02D 29/00", "text": "Controlling engines, such controlling being peculiar to the devices driven thereby, the devices being other than parts or accessories essential to engine operation, e.g. controlling of engines by signals external thereto", "children": [{"symbol": "F02D 29/02", "text": "peculiar to engines driving vehicles; peculiar to engines driving variable-pitch propellers"}, {"symbol": "F02D 29/04", "text": "peculiar to engines driving pumps"}, {"symbol": "F02D 29/06", "text": "peculiar to engines driving electric generators"}]}, {"symbol": "F02D 31/00", "text": "Use of speed-sensing governors to control combustion engines, not otherwise provided for"}, {"symbol": "F02D 33/00", "text": "Controlling delivery of fuel or combustion-air, not otherwise provided for"}, {"symbol": "F02D 35/00", "text": "Controlling engines, dependent on conditions exterior or interior to engines, not otherwise provided for", "children": [{"symbol": "F02D 35/02", "text": "on interior conditions"}]}, {"symbol": "F02D 37/00", "text": "Controlling conjointly two or more functions of engines, not otherwise provided for"}, {"symbol": "F02D 39/00", "text": "Other non-electrical control"}, {"symbol": "F02D 41/00", "text": "Electrical control of supply of combustible mixture or its constituents", "children": [{"symbol": "F02D 41/02", "text": "Circuit arrangements for generating control signals", "children": [{"symbol": "F02D 41/04", "text": "Introducing corrections for particular operating conditions (F02D 41/14 takes precedence)", "children": [{"symbol": "F02D 41/06", "text": "for engine starting or warming up"}, {"symbol": "F02D 41/08", "text": "for idling (F02D 41/06, F02D 41/16 take precedence)"}, {"symbol": "F02D 41/10", "text": "for acceleration"}, {"symbol": "F02D 41/12", "text": "for deceleration"}]}, {"symbol": "F02D 41/14", "text": "Introducing closed-loop corrections", "children": [{"symbol": "F02D 41/16", "text": "for idling"}]}, {"symbol": "F02D 41/18", "text": "by measuring intake air flow (measuring flow, in general G01F)"}]}, {"symbol": "F02D 41/20", "text": "Output circuits, e.g. for controlling currents in command coils (current control in inductive loads in general H03K 17/60)"}, {"symbol": "F02D 41/22", "text": "Safety or indicating devices for abnormal conditions"}, {"symbol": "F02D 41/30", "text": "Controlling fuel injection", "children": [{"symbol": "F02D 41/32", "text": "of the low pressure type", "children": [{"symbol": "F02D 41/34", "text": "with means for controlling injection timing or duration (ignition timing F02P 5/00)"}]}, {"symbol": "F02D 41/38", "text": "of the high pressure type", "children": [{"symbol": "F02D 41/40", "text": "with means for controlling injection timing or duration"}]}]}]}, {"symbol": "F02D 43/00", "text": "Conjoint electrical control of two or more functions, e.g. ignition, fuel-air mixture, recirculation, supercharging, exhaust-gas treatment", "children": [{"symbol": "F02D 43/02", "text": "using only analogue means"}, {"symbol": "F02D 43/04", "text": "using only digital means"}]}, {"symbol": "F02D 45/00", "text": "Electrical control not provided for in groups F02D 41/00 to F02D 43/00"}]}, {"symbol": "F02F", "text": "CYLINDERS, PISTONS, OR CASINGS FOR COMBUSTION ENGINES; ARRANGEMENTS OF SEALINGS IN COMBUSTION ENGINES", "children": [{"symbol": "F02F 1/00", "text": "Cylinders; Cylinder heads", "children": [{"symbol": "F02F 1/02", "text": "having cooling means (cylinder heads F02F 1/26)"}, {"symbol": "F02F 1/18", "text": "Other cylinders"}, {"symbol": "F02F 1/24", "text": "Cylinder heads", "children": [{"symbol": "F02F 1/26", "text": "having cooling means"}, {"symbol": "F02F 1/42", "text": "Shape or arrangement of intake or exhaust channels in cylinder heads"}]}]}, {"symbol": "F02F 3/00", "text": "Pistons", "children": [{"symbol": "F02F 3/02", "text": "having means for accommodating or controlling heat expansion"}, {"symbol": "F02F 3/10", "text": "having surface coverings (F02F 3/02 takes precedence)"}, {"symbol": "F02F 3/16", "text": "having cooling means"}, {"symbol": "F02F 3/24", "text": "having means for guiding gases in cylinders, e.g. for guiding scavenging charge in two-stroke engines"}, {"symbol": "F02F 3/26", "text": "having combustion chamber in piston head (the surface thereof being covered F02F 3/10)"}, {"symbol": "F02F 3/28", "text": "Other pistons with specially-shaped head"}]}, {"symbol": "F02F 5/00", "text": "Piston rings, e.g. associated with piston crown"}, {"symbol": "F02F 7/00", "text": "Casings, e.g. crankcases"}, {"symbol": "F02F 11/00", "text": "Arrangements of sealings in combustion engines"}]}, {"symbol": "F02G", "text": "HOT-GAS OR COMBUSTION-PRODUCT POSITIVE-DISPLACEMENT ENGINE PLANTS", "children": [{"symbol": "F02G 1/00", "text": "Hot gas positive-displacement engine plants"}, {"symbol": "F02G 3/00", "text": "Positive-displacement engine plants characterised by the working gas being generated by combustion in the plant"}, {"symbol": "F02G 5/00", "text": "Profiting from waste heat of combustion engines, not otherwise provided for"}]}, {"symbol": "F02K", "text": "JET-PROPULSION PLANTS", "children": [{"symbol": "F02K 1/00", "text": "Plants characterised by the form or arrangement of the jet pipe or nozzle; Jet pipes or nozzles peculiar thereto"}, {"symbol": "F02K 3/00", "text": "Plants including a gas turbine driving a compressor or a ducted fan"}, {"symbol": "F02K 5/00", "text": "Plants including an engine, other than a gas turbine, driving a compressor or a ducted fan"}, {"symbol": "F02K 7/00", "text": "Plants in which the working-fluid is used in a jet only, i.e. the plants not having a turbine or other engine driving a compressor or a ducted fan; Control thereof"}, {"symbol": "F02K 9/00", "text": "Rocket-engine plants, i.e. plants carrying both fuel and oxidant therefor; Control thereof"}, {"symbol": "F02K 11/00", "text": "Plants not provided for in the other groups of this subclass"}]}, {"symbol": "F02M", "text": "SUPPLYING COMBUSTION ENGINES IN GENERAL WITH COMBUSTIBLE MIXTURES OR CONSTITUENTS THEREOF", "children": [{"symbol": "F02M 1/00", "text": "Carburettors with means for facilitating engine's starting or its idling below operational temperatures"}, {"symbol": "F02M 3/00", "text": "Idling devices"}, {"symbol": "F02M 5/00", "text": "Float-controlled apparatus for maintaining a constant fuel level"}, {"symbol": "F02M 7/00", "text": "Carburettors with means for influencing, e.g. enriching or keeping constant, fuel/air ratio of charge under varying conditions"}, {"symbol": "F02M 9/00", "text": "Carburettors having air or fuel-air mixture passage throttling valves other than of butterfly type"}, {"symbol": "F02M 11/00", "text": "Multi-stage carburettors; Register-type carburettors, i.e. with slidable or rotatable throttling valves in which a plurality of fuel nozzles, other than only an idling nozzle and a main one, are sequentially exposed to air stream by throttling valve"}, {"symbol": "F02M 13/00", "text": "Arrangements of two or more separate carburettors"}, {"symbol": "F02M 15/00", "text": "Carburettors with heating, cooling, or thermal insulating means for combustion-air, fuel, or fuel-air mixture"}, {"symbol": "F02M 17/00", "text": "Carburettors having pertinent characteristics not provided for in, or of interest apart from, the apparatus of main groups F02M 1/00 to F02M 15/00"}, {"symbol": "F02M 19/00", "text": "Details, component parts, or accessories of carburettors, not provided for in, or of interest apart from, the apparatus of groups F02M 1/00 to F02M 17/00"}, {"symbol": "F02M 21/00", "text": "Apparatus for supplying engines with non-liquid fuels, e.g. gaseous fuels stored in liquid form", "children": [{"symbol": "F02M 21/02", "text": "for gaseous fuels (apparatus for vaporising liquid fuel by heat F02M 31/00; engines with apparatus generating gas from solid fuel, e.g. from wood, F02B 43/00)", "children": [{"symbol": "F02M 21/04", "text": "Gas-air mixing apparatus (carburettors adapted to use liquid and gaseous fuels F02M 13/00; carburetting gases in general C10J)"}, {"symbol": "F02M 21/06", "text": "Apparatus for de-liquefying, e.g. by heating (discharging liquefied gases in general F17C)"}]}]}, {"symbol": "F02M 23/00", "text": "Apparatus for adding secondary air to fuel-air mixture"}, {"symbol": "F02M 25/00", "text": "Engine-pertinent apparatus for adding non-fuel substances or small quantities of secondary fuel to combustion-air, main fuel, or fuel-air mixture", "children": [{"symbol": "F02M 25/06", "text": "adding lubricant vapours or exhaust gases", "children": [{"symbol": "F02M 25/07", "text": "adding exhaust gases"}]}, {"symbol": "F02M 25/08", "text": "adding fuel vapours drawn from engine fuel reservoir"}]}, {"symbol": "F02M 27/00", "text": "Apparatus for treating combustion-air, fuel, or fuel-air mixture, by catalysts, electric means, magnetism, rays, sonic waves, or the like"}, {"symbol": "F02M 29/00", "text": "Apparatus for re-atomising condensed fuel or homogenising fuel-air mixture"}, {"symbol": "F02M 31/00", "text": "Apparatus for thermally treating combustion-air, fuel, or fuel-air mixture", "children": [{"symbol": "F02M 31/02", "text": "for heating"}]}, {"symbol": "F02M 33/00", "text": "Other apparatus for treating combustion-air, fuel or fuel-air mixture"}, {"symbol": "F02M 35/00", "text": "Combustion-air cleaners, air intakes, intake silencers, or induction systems specially adapted for, or arranged on, internal-combustion engines", "children": [{"symbol": "F02M 35/02", "text": "Air cleaners"}, {"symbol": "F02M 35/10", "text": "Air intakes; Induction systems (using kinetic or wave energy of charge in induction systems for improving quantity of charge F02B)", "children": [{"symbol": "F02M 35/104", "text": "Intake manifolds"}]}, {"symbol": "F02M 35/12", "text": "Intake silencers"}, {"symbol": "F02M 35/14", "text": "Combined air cleaners and silencers"}]}, {"symbol": "F02M 37/00", "text": "Apparatus or systems for feeding liquid fuel from storage containers to carburettors or fuel-injection apparatus", "children": [{"symbol": "F02M 37/02", "text": "Feeding by means of suction apparatus, e.g. by air flow through carburettors (by driven pumps F02M 37/04)"}, {"symbol": "F02M 37/04", "text": "Feeding by means of driven pumps (pump construction F04)", "children": [{"symbol": "F02M 37/06", "text": "mechanically driven"}, {"symbol": "F02M 37/08", "text": "electrically driven"}, {"symbol": "F02M 37/18", "text": "characterised by provision of main and auxiliary pumps"}]}, {"symbol": "F02M 37/20", "text": "characterised by means for preventing vapour lock"}, {"symbol": "F02M 37/22", "text": "Arrangements for purifying liquid fuel specially adapted for, or arranged on, internal-combustion engines, e.g. arrangement in the feeding system"}]}, {"symbol": "F02M 39/00", "text": "Arrangements of fuel-injection apparatus with respect to engines; Pump drives adapted to such arrangements"}, {"symbol": "F02M 41/00", "text": "Fuel-injection apparatus with two or more injectors fed from a common pressure-source sequentially by means of a distributor", "children": [{"symbol": "F02M 41/08", "text": "the distributor and pumping elements being combined"}]}, {"symbol": "F02M 43/00", "text": "Fuel-injection apparatus operating simultaneously on two or more fuels or on a liquid fuel and another liquid, e.g. the other liquid being an anti-knock additive"}, {"symbol": "F02M 45/00", "text": "Fuel-injection apparatus characterised by having a cyclic delivery of specific time/pressure or time/quantity relationship"}, {"symbol": "F02M 47/00", "text": "Fuel-injection apparatus operated cyclically with fuel-injection valves actuated by fluid pressure", "children": [{"symbol": "F02M 47/02", "text": "of accumulator-injector type, i.e. having fuel pressure of accumulator tending to open, and fuel pressure in other chamber tending to close, injection valves, and having means for periodically releasing that closing pressure"}]}, {"symbol": "F02M 49/00", "text": "Fuel-injection apparatus in which injection pumps are driven, or injectors are actuated, by the pressure in engine working cylinders, or by impact of engine working piston"}, {"symbol": "F02M 51/00", "text": "Fuel-injection apparatus characterised by being operated electrically", "children": [{"symbol": "F02M 51/02", "text": "specially for low-pressure fuel-injection (pumps <u>per se</u>F02M 51/04; injectors <u>per se</u>F02M 51/08)"}, {"symbol": "F02M 51/04", "text": "Pumps peculiar thereto"}, {"symbol": "F02M 51/06", "text": "Injectors peculiar thereto", "children": [{"symbol": "F02M 51/08", "text": "specially for low-pressure fuel-injection"}]}]}, {"symbol": "F02M 53/00", "text": "Fuel-injection apparatus characterised by having heating, cooling, or thermally-insulating means"}, {"symbol": "F02M 55/00", "text": "Fuel-injection apparatus characterised by their fuel conduits or their venting means", "children": [{"symbol": "F02M 55/02", "text": "Conduits between injection pumps and injectors"}]}, {"symbol": "F02M 57/00", "text": "Fuel injectors combined or associated with other devices"}, {"symbol": "F02M 59/00", "text": "Pumps specially adapted for fuel-injection and not provided for in groups F02M 39/00 to F02M 57/00", "children": [{"symbol": "F02M 59/20", "text": "Varying fuel delivery in quantity or timing"}]}, {"symbol": "F02M 61/00", "text": "Fuel injectors not provided for in groups F02M 39/00 to F02M 57/00"}, {"symbol": "F02M 63/00", "text": "Other fuel-injection apparatus having pertinent characteristics not provided for in groups F02M 39/00 to F02M 57/00; Details, component parts, or accessories of fuel-injection apparatus, not provided for in, or of interest apart from, the apparatus of groups F02M 39/00 to F02M 61/00"}, {"symbol": "F02M 65/00", "text": "Testing fuel-injection apparatus, e.g. testing injection timing"}, {"symbol": "F02M 67/00", "text": "Apparatus in which fuel-injection is effected by means of high-pressure gas, the gas carrying the fuel into working cylinders of the engine, e.g. air-injection type"}, {"symbol": "F02M 69/00", "text": "Low-pressure fuel-injection apparatus", "children": [{"symbol": "F02M 69/02", "text": "Pumps peculiar thereto"}, {"symbol": "F02M 69/04", "text": "Injectors peculiar thereto"}, {"symbol": "F02M 69/06", "text": "characterised by the pressurisation of the fuel being caused by centrifugal force acting on the fuel"}, {"symbol": "F02M 69/08", "text": "characterised by the fuel being carried by compressed air into main stream of combustion-air"}, {"symbol": "F02M 69/10", "text": "peculiar to scavenged two-stroke engines, e.g. injecting into crankcase-pump chamber"}, {"symbol": "F02M 69/12", "text": "comprising a fuel-displaced free piston for intermittently metering and supplying fuel to injection nozzles"}, {"symbol": "F02M 69/14", "text": "having cyclically-operated valves connecting injection nozzles to a source of fuel under pressure during the injection period"}, {"symbol": "F02M 69/16", "text": "characterised by means for metering continuous fuel flow to injectors or means for varying fuel pressure upstream of injectors"}, {"symbol": "F02M 69/28", "text": "characterised by means for cutting-out the fuel supply to the engine or to main injectors during certain operating periods, e.g. deceleration"}, {"symbol": "F02M 69/30", "text": "characterised by means for facilitating the starting-up or idling of engines or by means for enriching fuel charge, e.g. below operational temperatures or upon high power demand of engines (at acceleration F02M 69/44)"}, {"symbol": "F02M 69/44", "text": "characterised by means for supplying extra fuel to the engine on sudden air throttle opening, e.g at acceleration"}, {"symbol": "F02M 69/46", "text": "Details, component parts or accessories not provided for in, or of interest apart from, the apparatus covered by groups F02M 69/02 to F02M 69/44"}]}, {"symbol": "F02M 71/00", "text": "Combinations of carburettors and low-pressure fuel-injection apparatus"}, {"symbol": "F02M 99/00", "text": "Subject matter not provided for in other groups of this subclass"}]}, {"symbol": "F02N", "text": "STARTING OF COMBUSTION ENGINES", "children": [{"symbol": "F02N 1/00", "text": "Starting apparatus having hand cranks"}, {"symbol": "F02N 3/00", "text": "Other muscle-operated starting apparatus"}, {"symbol": "F02N 5/00", "text": "Starting apparatus having mechanical power storage"}, {"symbol": "F02N 7/00", "text": "Starting apparatus having fluid-driven auxiliary engines or apparatus"}, {"symbol": "F02N 9/00", "text": "Starting of engines by supplying auxiliary pressure fluid to their working chambers"}, {"symbol": "F02N 11/00", "text": "Starting of engines by means of electric motors", "children": [{"symbol": "F02N 11/04", "text": "the motors being associated with current generators"}, {"symbol": "F02N 11/08", "text": "Circuits specially adapted for starting of engines"}]}, {"symbol": "F02N 13/00", "text": "Starting of engines, or driving of starting apparatus by use of explosives, e.g. stored in cartridges"}, {"symbol": "F02N 15/00", "text": "Other power-operated starting apparatus; Component parts, details, or accessories, not provided for in, or of interest apart from, groups F02N 5/00 to F02N 13/00", "children": [{"symbol": "F02N 15/02", "text": "Gearing between starting-engines and started engines; Engagement or disengagement thereof"}]}, {"symbol": "F02N 17/00", "text": "Other starting means; Starting aids not otherwise provided for"}]}, {"symbol": "F02P", "text": "IGNITION, OTHER THAN COMPRESSION IGNITION, FOR INTERNAL-COMBUSTION ENGINES; TESTING OF IGNITION TIMING IN COMPRESSION-IGNITION ENGINES", "children": [{"symbol": "F02P 1/00", "text": "Installations having electric ignition energy generated by magneto- or dynamo-electric generators without subsequent storage"}, {"symbol": "F02P 3/00", "text": "Other installations", "children": [{"symbol": "F02P 3/02", "text": "having inductive energy storage, e.g. arrangements of induction coils"}]}, {"symbol": "F02P 5/00", "text": "Advancing or retarding ignition; Control therefor", "children": [{"symbol": "F02P 5/04", "text": "automatically, as a function of the working conditions of the engine or vehicle or of the atmospheric conditions (dependent on position of personal controls of engine F02P 5/00)", "children": [{"symbol": "F02P 5/145", "text": "using electrical means", "children": [{"symbol": "F02P 5/15", "text": "Digital data processing", "children": [{"symbol": "F02P 5/152", "text": "dependent on pinking (detecting or indicating knocks in internal-combustion engines G01L 23/00)"}, {"symbol": "F02P 5/153", "text": "dependent on combustion pressure"}]}]}]}]}, {"symbol": "F02P 7/00", "text": "Arrangement of distributors, circuit-makers or -breakers, or pick-up devices"}, {"symbol": "F02P 9/00", "text": "Electric spark ignition control, not otherwise provided for"}, {"symbol": "F02P 11/00", "text": "Safety means for electric spark ignition, not otherwise provided for"}, {"symbol": "F02P 13/00", "text": "Sparking plugs structurally combined with other parts of internal-combustion engines"}, {"symbol": "F02P 15/00", "text": "Electric spark ignition having characteristics not provided for in, or of interest apart from, groups F02P 1/00 to F02P 13/00"}, {"symbol": "F02P 17/00", "text": "Testing of ignition installations, e.g. in combination with adjusting", "children": [{"symbol": "F02P 17/12", "text": "Testing characteristics of the spark, ignition voltage or current (testing of sparking plugs G01M 19/02)"}]}, {"symbol": "F02P 19/00", "text": "Incandescent ignition, e.g. during starting of internal-combustion engines; Combination of incandescent and spark ignition"}, {"symbol": "F02P 21/00", "text": "Direct use of flames or burners for ignition"}, {"symbol": "F02P 23/00", "text": "Other ignition"}]}]}, {"symbol": "F03", "text": "MACHINES OR ENGINES FOR LIQUIDS", "children": [{"symbol": "F03B", "text": "MACHINES OR ENGINES FOR LIQUIDS", "children": [{"symbol": "F03B 1/00", "text": "Engines of impulse type, i.e. turbines with jets of high-velocity liquid impinging on bladed or like rotors, e.g. Pelton wheels; Parts or details peculiar thereto"}, {"symbol": "F03B 3/00", "text": "Machines or engines of reaction type; Parts or details peculiar thereto"}, {"symbol": "F03B 5/00", "text": "Machines or engines characterised by non-bladed rotors, e.g. serrated, using friction"}, {"symbol": "F03B 7/00", "text": "Water wheels"}, {"symbol": "F03B 9/00", "text": "Endless-chain type machines or engines"}, {"symbol": "F03B 11/00", "text": "Parts or details not provided for in, or of interest apart from, groups F03B 1/00 to F03B 9/00"}, {"symbol": "F03B 13/00", "text": "Adaptations of machines or engines for special use; Combinations of machines or engines with driving or driven apparatus"}, {"symbol": "F03B 15/00", "text": "Controlling"}, {"symbol": "F03B 17/00", "text": "Other machines or engines"}]}, {"symbol": "F03C", "text": "POSITIVE-DISPLACEMENT ENGINES DRIVEN BY LIQUIDS", "children": [{"symbol": "F03C 1/00", "text": "Reciprocating-piston liquid engines", "children": [{"symbol": "F03C 1/007", "text": "with single cylinder, double-acting piston"}]}, {"symbol": "F03C 2/00", "text": "Rotary-piston engines"}, {"symbol": "F03C 4/00", "text": "Oscillating-piston engines"}, {"symbol": "F03C 5/00", "text": "Other engines"}]}, {"symbol": "F03D", "text": "WIND MOTORS", "children": [{"symbol": "F03D 1/00", "text": "Wind motors with rotation axis substantially in wind direction"}, {"symbol": "F03D 3/00", "text": "Wind motors with rotation axis substantially at right angle to wind direction"}, {"symbol": "F03D 5/00", "text": "Other wind motors"}, {"symbol": "F03D 7/00", "text": "Controlling wind motors"}, {"symbol": "F03D 9/00", "text": "Adaptations of wind motors for special use; Combinations of wind motors with apparatus driven thereby"}, {"symbol": "F03D 11/00", "text": "Details, component parts, or accessories not provided for in, or of interest apart from, the other groups of this subclass"}]}, {"symbol": "F03G", "text": "SPRING, WEIGHT, INERTIA, OR LIKE MOTORS; MECHANICAL-POWER-PRODUCING DEVICES OR MECHANISMS, NOT OTHERWISE PROVIDED FOR OR USING ENERGY SOURCES NOT OTHERWISE PROVIDED FOR", "children": [{"symbol": "F03G 1/00", "text": "Spring motors"}, {"symbol": "F03G 3/00", "text": "Other motors, e.g. gravity or inertia motors"}, {"symbol": "F03G 4/00", "text": "Devices for producing mechanical power from geothermal energy"}, {"symbol": "F03G 5/00", "text": "Devices for producing mechanical power from muscle energy"}, {"symbol": "F03G 6/00", "text": "Devices for producing mechanical power from solar energy"}, {"symbol": "F03G 7/00", "text": "Mechanical-power-producing mechanisms, not otherwise provided for or using energy sources not otherwise provided for", "children": [{"symbol": "F03G 7/06", "text": "using expansion or contraction of bodies due to heating, cooling, moistening, drying, or the like (using thermal expansion of non-vaporising liquids F01K)"}]}]}, {"symbol": "F03H", "text": "PRODUCING A REACTIVE PROPULSIVE THRUST, NOT OTHERWISE PROVIDED FOR", "children": [{"symbol": "F03H 1/00", "text": "Use of plasma to produce a reactive propulsive thrust"}, {"symbol": "F03H 3/00", "text": "Use of photons to produce a reactive propulsive thrust"}, {"symbol": "F03H 5/00", "text": "Producing a reactive propulsive thrust, not otherwise provided for"}]}]}, {"symbol": "F04", "text": "POSITIVE-DISPLACEMENT MACHINES FOR LIQUIDS; PUMPS FOR LIQUIDS OR ELASTIC FLUIDS", "children": [{"symbol": "F04B", "text": "POSITIVE-DISPLACEMENT MACHINES FOR LIQUIDS; PUMPS", "children": [{"symbol": "F04B 1/00", "text": "Multi-cylinder machines or pumps characterised by number or arrangement of cylinders", "children": [{"symbol": "F04B 1/12", "text": "having cylinder axes coaxial with, or parallel or inclined to, main shaft axis", "children": [{"symbol": "F04B 1/20", "text": "having rotary cylinder block"}]}]}, {"symbol": "F04B 3/00", "text": "Machines or pumps with pistons coacting within one cylinder, e.g. multi-stage"}, {"symbol": "F04B 5/00", "text": "Machines or pumps with differential-surface pistons"}, {"symbol": "F04B 7/00", "text": "Piston machines or pumps characterised by having positively-driven valving"}, {"symbol": "F04B 9/00", "text": "Piston machines or pumps characterised by the driving or driven means to or from their working members", "children": [{"symbol": "F04B 9/02", "text": "the means being mechanical (with cylinder axes coaxial with, or parallel or inclined to, main shaft axis F04B 1/12)"}]}, {"symbol": "F04B 11/00", "text": "Equalisation of pulses, e.g. by use of air vessels; Counteracting cavitation"}, {"symbol": "F04B 13/00", "text": "Pumps specially modified to deliver fixed or variable measured quantities"}, {"symbol": "F04B 15/00", "text": "Pumps adapted to handle specific fluids, e.g. by selection of specific materials for pumps or pump parts"}, {"symbol": "F04B 17/00", "text": "Pumps characterised by combination with, or adaptation to, specific driving engines or motors", "children": [{"symbol": "F04B 17/03", "text": "driven by electric motors"}]}, {"symbol": "F04B 19/00", "text": "Machines or pumps having pertinent characteristics not provided for in, or of interest apart from, groups F04B 1/00 to F04B 17/00"}, {"symbol": "F04B 23/00", "text": "Pumping installations or systems"}, {"symbol": "F04B 25/00", "text": "Multi-stage pumps"}, {"symbol": "F04B 27/00", "text": "Multi-cylinder pumps characterised by number or arrangement of cylinders", "children": [{"symbol": "F04B 27/08", "text": "having cylinders coaxial with, or parallel or inclined to, main shaft axis", "children": [{"symbol": "F04B 27/10", "text": "having stationary cylinders"}, {"symbol": "F04B 27/14", "text": "Control"}]}]}, {"symbol": "F04B 31/00", "text": "Free-piston pumps; Systems incorporating such pumps"}, {"symbol": "F04B 33/00", "text": "Pumps actuated by muscle power, e.g. for inflating"}, {"symbol": "F04B 35/00", "text": "Piston pumps characterised by the driving means to their working members, or by combination with, or adaptation to, specific driving engines or motors, not otherwise provided for"}, {"symbol": "F04B 37/00", "text": "Pumps having pertinent characteristics not provided for in, or of interest apart from, groups F04B 25/00 to F04B 35/00"}, {"symbol": "F04B 39/00", "text": "Component parts, details, or accessories, of pumps or pumping systems, not otherwise provided for in, or of interest apart from, groups F04B 25/00 to F04B 37/00", "children": [{"symbol": "F04B 39/02", "text": "Lubrication (of machines or engines in general F01M)"}, {"symbol": "F04B 39/04", "text": "Measures to avoid lubricant contaminating the pumped fluid"}, {"symbol": "F04B 39/06", "text": "Cooling (of machines or engines in general F01P); Heating; Prevention of freezing"}, {"symbol": "F04B 39/08", "text": "Actuation of distribution members"}, {"symbol": "F04B 39/10", "text": "Adaptation or arrangement of distribution members"}, {"symbol": "F04B 39/12", "text": "Casings (casings for machines or engines in general F16M); Cylinders; Cylinder heads; Fluid connections"}, {"symbol": "F04B 39/14", "text": "Provisions for readily assembling or disassembling"}, {"symbol": "F04B 39/16", "text": "Filtration; Moisture separation"}]}, {"symbol": "F04B 41/00", "text": "Pumping installations or systems"}, {"symbol": "F04B 43/00", "text": "Machines, pumps, or pumping installations having flexible working members", "children": [{"symbol": "F04B 43/02", "text": "having plate-like flexible members, e.g. diaphragms (F04B 43/12 takes precedence)", "children": [{"symbol": "F04B 43/06", "text": "Pumps having fluid drive"}]}, {"symbol": "F04B 43/12", "text": "having peristaltic action"}]}, {"symbol": "F04B 45/00", "text": "Pumps or pumping installations having flexible working members and specially adapted for elastic fluids"}, {"symbol": "F04B 47/00", "text": "Pumps or pumping installations specially adapted for raising fluids from great depths, e.g. well pumps"}, {"symbol": "F04B 49/00", "text": "Control of, or safety measures for, machines, pumps, or pumping installations, not otherwise provided for in, or of interest apart from, groups F04B 1/00 to F04B 47/00", "children": [{"symbol": "F04B 49/02", "text": "Stopping, starting, unloading, or idling control (controlled electrically F04B 49/06)"}, {"symbol": "F04B 49/04", "text": "Regulating by means of floats (F04B 49/02 takes precedence)"}, {"symbol": "F04B 49/06", "text": "Control using electricity (regulating by means of floats actuating electric switches F04B 49/04)"}, {"symbol": "F04B 49/08", "text": "Regulating by delivery pressure"}, {"symbol": "F04B 49/10", "text": "Other safety measures"}, {"symbol": "F04B 49/12", "text": "by varying the length of stroke of the working members"}, {"symbol": "F04B 49/16", "text": "by adjusting the capacity of dead spaces of working chambers"}, {"symbol": "F04B 49/18", "text": "by changing the effective cross-section of the working surface of the piston"}, {"symbol": "F04B 49/20", "text": "by changing the driving speed (controlled electrically F04B 49/06)"}, {"symbol": "F04B 49/22", "text": "by means of valves (F04B 49/02 takes precedence)"}]}, {"symbol": "F04B 51/00", "text": "Testing machines, pumps, or pumping installations"}, {"symbol": "F04B 53/00", "text": "Component parts, details or accessories not provided for in, or of interest apart from, groups F04B 1/00 to F04B 23/00 or F04B 39/00 to F04B 47/00", "children": [{"symbol": "F04B 53/10", "text": "Valves; Arrangement of valves"}]}]}, {"symbol": "F04C", "text": "ROTARY-PISTON, OR OSCILLATING-PISTON, POSITIVE-DISPLACEMENT MACHINES FOR LIQUIDS", "children": [{"symbol": "F04C 2/00", "text": "Rotary-piston machines or pumps"}, {"symbol": "F04C 3/00", "text": "Rotary-piston machines or pumps, with non-parallel axes of movement of co-operating members, e.g. of screw type"}, {"symbol": "F04C 5/00", "text": "Rotary-piston machines or pumps with the working-chamber walls at least partly resiliently deformable"}, {"symbol": "F04C 7/00", "text": "Rotary-piston machines or pumps with fluid ring or the like"}, {"symbol": "F04C 9/00", "text": "Oscillating-piston machines or pumps"}, {"symbol": "F04C 11/00", "text": "Combinations of two or more machines or pumps, each being of rotary-piston or oscillating-piston type"}, {"symbol": "F04C 13/00", "text": "Adaptations of machines or pumps for special use, e.g. for extremely high pressures"}, {"symbol": "F04C 14/00", "text": "Control of, monitoring of, or safety arrangements for, machines, pumps or pumping installations"}, {"symbol": "F04C 15/00", "text": "Component parts, details or accessories of machines, pumps or pumping installations, not provided for in groups F04C 2/00 to F04C 14/00"}, {"symbol": "F04C 18/00", "text": "Rotary-piston pumps specially adapted for elastic fluids", "children": [{"symbol": "F04C 18/02", "text": "of arcuate-engagement type, i.e. with circular translatory movement of co-operating members, each member having the same number of teeth or tooth-equivalents", "children": [{"symbol": "F04C 18/04", "text": "of internal-axis type"}, {"symbol": "F04C 18/06", "text": "of other than internal-axis type (F04C 18/063 takes precedence)"}, {"symbol": "F04C 18/063", "text": "with coaxially-mounted members having continuously-changing circumferential spacing between them"}]}, {"symbol": "F04C 18/08", "text": "of intermeshing-engagement type, i.e. with engagement of co-operating members similar to that of toothed gearing", "children": [{"symbol": "F04C 18/12", "text": "of other than internal-axis type", "children": [{"symbol": "F04C 18/14", "text": "with toothed rotary pistons", "children": [{"symbol": "F04C 18/16", "text": "with helical teeth, e.g. chevron-shaped, screw type"}]}]}]}, {"symbol": "F04C 18/22", "text": "of internal-axis type with equidirectional movement of co-operating members at the points of engagement, or with one of the co-operating members being stationary, the inner member having more teeth or tooth-equivalents than the outer member"}, {"symbol": "F04C 18/24", "text": "of counter-engagement type, i.e. the movement of co-operating members at the points of engagement being in opposite directions"}, {"symbol": "F04C 18/30", "text": "having the characteristics covered by two or more of groups F04C 18/02, F04C 18/08, F04C 18/22, F04C 18/24, F04C 18/48, or having the characteristics covered by one of these groups together with some other type of movement between co-operating members", "children": [{"symbol": "F04C 18/34", "text": "having the movement defined in group F04C 18/08 or F04C 18/22 and relative reciprocation between the co-operating members", "children": [{"symbol": "F04C 18/356", "text": "with vanes reciprocating with respect to the outer member"}]}]}, {"symbol": "F04C 18/48", "text": "Rotary-piston pumps with non-parallel axes of movement of co-operating members"}]}, {"symbol": "F04C 19/00", "text": "Rotary-piston pumps with fluid ring or the like, specially adapted for elastic fluids"}, {"symbol": "F04C 21/00", "text": "Oscillating-piston pumps specially adapted for elastic fluids"}, {"symbol": "F04C 23/00", "text": "Combinations of two or more pumps, each being of rotary-piston or oscillating-piston type, specially adapted for elastic fluids; Pumping installations specially adapted for elastic fluids; Multi-stage pumps specially adapted for elastic fluids"}, {"symbol": "F04C 25/00", "text": "Adaptations for special use of pumps for elastic fluids"}, {"symbol": "F04C 27/00", "text": "Sealing arrangements in rotary-piston pumps specially adapted for elastic fluids"}, {"symbol": "F04C 28/00", "text": "Control of, monitoring of, or safety arrangements for, pumps or pumping installations specially adapted for elastic fluids"}, {"symbol": "F04C 29/00", "text": "Component parts, details, or accessories, of pumps or pumping installations specially adapted for elastic fluids, not provided for in groups F04C 18/00 to F04C 28/00", "children": [{"symbol": "F04C 29/02", "text": "Lubrication (of machines or engines in general F01M); Lubricant separation (separation in general B01D)"}, {"symbol": "F04C 29/04", "text": "Heating; Cooling (of machines or engines in general F01P); Heat insulation (heat insulation in general F16L 59/00)"}, {"symbol": "F04C 29/06", "text": "Silencing (gas-flow silencers or exhaust apparatus for machines or engines in general F01N)"}, {"symbol": "F04C 29/12", "text": "Arrangements for admission or discharge of the working fluid, e.g. constructional features of the inlet or outlet"}]}]}, {"symbol": "F04D", "text": "NON-POSITIVE-DISPLACEMENT PUMPS", "children": [{"symbol": "F04D 1/00", "text": "Radial-flow pumps, e.g. centrifugal pumps; Helico-centrifugal pumps"}, {"symbol": "F04D 3/00", "text": "Axial-flow pumps"}, {"symbol": "F04D 5/00", "text": "Pumps with circumferential or transverse flow"}, {"symbol": "F04D 7/00", "text": "Pumps adapted for handling specific fluids, e.g. by selection of specific materials for pumps or pump parts"}, {"symbol": "F04D 9/00", "text": "Priming; Preventing vapour lock"}, {"symbol": "F04D 11/00", "text": "Other rotary non-positive-displacement pumps"}, {"symbol": "F04D 13/00", "text": "Pumping installations or systems", "children": [{"symbol": "F04D 13/02", "text": "Units comprising pumps and their driving means (predominant aspects of the driving means, <u>see</u> the relevant classes for such means)", "children": [{"symbol": "F04D 13/06", "text": "the pump being electrically driven"}]}]}, {"symbol": "F04D 15/00", "text": "Control, e.g. regulation, of pumps, pumping installations, or systems", "children": [{"symbol": "F04D 15/02", "text": "Stopping of pumps, or operating valves, on occurrence of unwanted conditions"}]}, {"symbol": "F04D 17/00", "text": "Radial-flow pumps, e.g. centrifugal pumps; Helico-centrifugal pumps"}, {"symbol": "F04D 19/00", "text": "Axial-flow pumps"}, {"symbol": "F04D 21/00", "text": "Pumps involving supersonic speed of pumped fluids"}, {"symbol": "F04D 23/00", "text": "Other rotary non-positive-displacement pumps"}, {"symbol": "F04D 25/00", "text": "Pumping installations or systems", "children": [{"symbol": "F04D 25/02", "text": "Units comprising pumps and their driving means (predominant aspects of the driving means, <u>see</u> the relevant classes for such means)"}]}, {"symbol": "F04D 27/00", "text": "Control, e.g. regulation, of pumps, pumping installations, or systems", "children": [{"symbol": "F04D 27/02", "text": "Surge control"}]}, {"symbol": "F04D 29/00", "text": "Details, component parts, or accessories", "children": [{"symbol": "F04D 29/04", "text": "Shafts or bearings, or assemblies thereof (specially adapted for elastic fluid pumps F04D 29/05)"}, {"symbol": "F04D 29/05", "text": "Shafts or bearings, or assemblies therof, specially adapted for elastic fluid pumps"}, {"symbol": "F04D 29/06", "text": "Lubrication"}, {"symbol": "F04D 29/08", "text": "Sealings"}, {"symbol": "F04D 29/18", "text": "Rotors (specially adapted for elastic fluids F04D 29/26)"}, {"symbol": "F04D 29/26", "text": "Rotors specially adapted for elastic fluids", "children": [{"symbol": "F04D 29/28", "text": "for centrifugal or helico-centrifugal pumps", "children": [{"symbol": "F04D 29/30", "text": "Vanes"}]}, {"symbol": "F04D 29/32", "text": "for axial-flow pumps", "children": [{"symbol": "F04D 29/38", "text": "Blades"}]}]}, {"symbol": "F04D 29/40", "text": "Casings; Connections for working fluid", "children": [{"symbol": "F04D 29/42", "text": "for radial or helico-centrifugal pumps", "children": [{"symbol": "F04D 29/44", "text": "Fluid-guiding means, e.g. diffusers", "children": [{"symbol": "F04D 29/46", "text": "adjustable"}]}]}]}, {"symbol": "F04D 29/58", "text": "Cooling (of machines or engines in general F01P); Heating; Diminishing heat transfer"}, {"symbol": "F04D 29/60", "text": "Mounting; Assembling; Disassembling"}, {"symbol": "F04D 29/66", "text": "Combating cavitation, whirls, noise, vibration, or the like (gas-flow silencers for machines or engines in general F01N); Balancing (surge control F04D 27/02)"}]}, {"symbol": "F04D 31/00", "text": "Pumping liquids and elastic fluids at the same time"}, {"symbol": "F04D 33/00", "text": "Non-positive-displacement pumps with other than pure rotation, e.g. of oscillating type"}, {"symbol": "F04D 35/00", "text": "Pumps producing waves in liquids, i.e. wave-producers"}]}, {"symbol": "F04F", "text": "PUMPING OF FLUID BY DIRECT CONTACT OF ANOTHER FLUID OR BY USING INERTIA OF FLUID TO BE PUMPED", "children": [{"symbol": "F04F 1/00", "text": "Pumps using positively or negatively pressurised fluid medium acting directly on the liquid to be pumped"}, {"symbol": "F04F 3/00", "text": "Pumps using negative pressure acting directly on the liquid to be pumped"}, {"symbol": "F04F 5/00", "text": "Jet pumps, i.e. devices in which fluid flow is induced by pressure drop caused by velocity of another fluid flow"}, {"symbol": "F04F 7/00", "text": "Pumps displacing fluids by using inertia thereof, e.g. by generating vibrations therein"}, {"symbol": "F04F 9/00", "text": "Diffusion pumps"}, {"symbol": "F04F 10/00", "text": "Siphons"}, {"symbol": "F04F 11/00", "text": "Other pumps"}]}]}, {"symbol": "F15", "text": "FLUID-PRESSURE ACTUATORS; HYDRAULICS OR PNEUMATICS IN GENERAL", "children": [{"symbol": "F15B", "text": "SYSTEMS ACTING BY MEANS OF FLUIDS IN GENERAL; FLUID-PRESSURE ACTUATORS, e.g. SERVOMOTORS; DETAILS OF FLUID-PRESSURE SYSTEMS, NOT OTHERWISE PROVIDED FOR", "children": [{"symbol": "F15B 1/00", "text": "Installations or systems with accumulators; Supply reservoir or sump assemblies"}, {"symbol": "F15B 3/00", "text": "Intensifiers or fluid-pressure converters, e.g. pressure exchangers; Conveying pressure from one fluid system to another, without contact between the fluids"}, {"symbol": "F15B 5/00", "text": "Transducers converting variations of physical quantities, e.g. expressed by variations in positions of members, into fluid-pressure variations or <u>vice versa</u>; Varying fluid pressure as a function of variations of a plurality of fluid pressures or variations of other quantities"}, {"symbol": "F15B 7/00", "text": "Systems in which the movement produced is definitely related to the output of a volumetric pump; Telemotors"}, {"symbol": "F15B 9/00", "text": "Servomotors with follow-up action, i.e. in which the position of the actuated member conforms with that of the controlling member"}, {"symbol": "F15B 11/00", "text": "Servomotor systems without provision for follow-up action"}, {"symbol": "F15B 13/00", "text": "Details of servomotor systems"}, {"symbol": "F15B 15/00", "text": "Fluid-actuated devices for displacing a member from one position to another"}, {"symbol": "F15B 17/00", "text": "Combinations of telemotor and servomotor systems"}, {"symbol": "F15B 18/00", "text": "Parallel arrangements of independent servomotor systems"}, {"symbol": "F15B 19/00", "text": "Testing fluid-pressure systems or apparatus, so far as not provided for elsewhere"}, {"symbol": "F15B 20/00", "text": "Safety arrangements; Applications of safety devices"}, {"symbol": "F15B 21/00", "text": "Common features; Fluid-pressure systems, or details thereof, not covered by any other group of this subclass"}]}, {"symbol": "F15C", "text": "FLUID-CIRCUIT ELEMENTS PREDOMINANTLY USED FOR COMPUTING OR CONTROL PURPOSES", "children": [{"symbol": "F15C 1/00", "text": "Circuit elements having no moving parts"}, {"symbol": "F15C 3/00", "text": "Circuit elements having moving parts"}, {"symbol": "F15C 4/00", "text": "Circuit elements characterised by their special functions"}, {"symbol": "F15C 5/00", "text": "Manufacture of fluid-circuit elements; Manufacture of assemblages of such elements"}, {"symbol": "F15C 7/00", "text": "Hybrid elements, i.e. circuit elements having features according to groups F15C 1/00 and F15C 3/00"}]}, {"symbol": "F15D", "text": "FLUID DYNAMICS, i.e. METHODS OR MEANS FOR INFLUENCING THE FLOW OF GASES OR LIQUIDS", "children": [{"symbol": "F15D 1/00", "text": "Influencing the flow of fluids"}]}]}, {"symbol": "F16", "text": "ENGINEERING ELEMENTS OR UNITS; GENERAL MEASURES FOR PRODUCING AND MAINTAINING EFFECTIVE FUNCTIONING OF MACHINES OR INSTALLATIONS; THERMAL INSULATION IN GENERAL", "children": [{"symbol": "F16B", "text": "DEVICES FOR FASTENING OR SECURING CONSTRUCTIONAL ELEMENTS OR MACHINE PARTS TOGETHER, e.g. NAILS, BOLTS, CIRCLIPS, CLAMPS, CLIPS, WEDGES; JOINTS OR JOINTING", "children": [{"symbol": "F16B 1/00", "text": "Devices for securing together, or preventing relative movement between, constructional elements or machine parts"}, {"symbol": "F16B 2/00", "text": "Friction-grip releasable fastenings", "children": [{"symbol": "F16B 2/02", "text": "Clamps, i.e. with gripping action effected by positive means other than the inherent resistance to deformation of the material of the fastening"}, {"symbol": "F16B 2/20", "text": "Clips, i.e. with gripping action effected solely by the inherent resistance to deformation of the material of the fastening"}]}, {"symbol": "F16B 3/00", "text": "Key-type connections; Keys"}, {"symbol": "F16B 4/00", "text": "Shrinkage connection, e.g. assembled with the parts at different temperature; Force fits"}, {"symbol": "F16B 5/00", "text": "Joining sheets or plates to one another or to strips or bars parallel to them", "children": [{"symbol": "F16B 5/02", "text": "by means of fastening members using screw-thread (construction of screw-threaded connections F16B 25/00 to F16B 39/00)"}, {"symbol": "F16B 5/06", "text": "by means of clamps or clips (friction-grip releasable fastenings in general F16B 2/00)"}, {"symbol": "F16B 5/12", "text": "Fastening strips or bars to sheets or plates, e.g. rubber strips, decorative strips for motor vehicles, by means of clips (friction-grip releasable fastenings in general F16B 2/00; fastening rods or tubular parts to flat surfaces at an angle F16B 9/00; clips for connecting hoses to rigid members F16L 33/02)"}]}, {"symbol": "F16B 7/00", "text": "Connections of rods or tubes, e.g. of non-circular section, mutually, including resilient connections", "children": [{"symbol": "F16B 7/04", "text": "Clamping or clipping connections (friction-grip releasable fastenings in general F16B 2/00)"}, {"symbol": "F16B 7/18", "text": "using screw-thread elements"}]}, {"symbol": "F16B 9/00", "text": "Connections of rods or tubular parts to flat surfaces at an angle"}, {"symbol": "F16B 11/00", "text": "Connecting constructional elements or machine parts by sticking or pressing them together, e.g. cold pressure welding"}, {"symbol": "F16B 12/00", "text": "Jointing of furniture or the like, e.g. hidden from exterior"}, {"symbol": "F16B 13/00", "text": "Dowels or other devices fastened in walls or the like by inserting them in holes made therein for that purpose", "children": [{"symbol": "F16B 13/04", "text": "with parts gripping in the hole or behind the reverse side of the wall after inserting from the front (friction-grip releasable fastenings in general F16B 2/00)", "children": [{"symbol": "F16B 13/06", "text": "combined with expanding sleeve"}]}]}, {"symbol": "F16B 15/00", "text": "Nails; Staples"}, {"symbol": "F16B 17/00", "text": "Connecting constructional elements or machine parts by a part of or on one member entering a hole in the other"}, {"symbol": "F16B 19/00", "text": "Bolts without screw-thread; Pins, including deformable elements", "children": [{"symbol": "F16B 19/04", "text": "Rivets; Spigots or the like fastened by riveting (lead seals G09F 3/00)"}]}, {"symbol": "F16B 21/00", "text": "Means for preventing relative axial movement of a pin, spigot, shaft, or the like and a member surrounding it"}, {"symbol": "F16B 23/00", "text": "Specially-shaped heads of bolts or screws for rotations by a tool"}, {"symbol": "F16B 25/00", "text": "Screws that form threads in the body into which they are screwed, e.g. wood screws, self-tapping screws"}, {"symbol": "F16B 27/00", "text": "Bolts, screws, or nuts formed in integral series but easily separable, particularly for use in automatic machines"}, {"symbol": "F16B 29/00", "text": "Screwed connection with deformation of nut or auxiliary member while fastening"}, {"symbol": "F16B 31/00", "text": "Screwed connections specially modified in view of tensile load; Break-bolts"}, {"symbol": "F16B 33/00", "text": "Features common to bolt and nut"}, {"symbol": "F16B 35/00", "text": "Screw-bolts; Stay bolts; Screw-threaded studs; Screws; Set screws", "children": [{"symbol": "F16B 35/04", "text": "with specially-shaped head or shaft in order to fix the bolt on or in an object (locking the bolt against turning in the object by the use of accessory parts F16B 39/00)"}]}, {"symbol": "F16B 37/00", "text": "Nuts or like thread-engaging members", "children": [{"symbol": "F16B 37/04", "text": "Devices for fastening nuts to surfaces, e.g. sheets, plates"}, {"symbol": "F16B 37/08", "text": "Quickly-detachable nuts, e.g. consisting of two or more parts; Nuts movable along the bolt after tilting the nut"}]}, {"symbol": "F16B 39/00", "text": "Locking of screws, bolts, or nuts"}, {"symbol": "F16B 41/00", "text": "Measures against loss of bolts, nuts, or pins; Measures against unauthorised operation of bolts, nuts, or pins"}, {"symbol": "F16B 43/00", "text": "Washers or equivalent devices; Other devices for supporting bolt-heads or nuts"}, {"symbol": "F16B 45/00", "text": "Hooks; Eyes"}, {"symbol": "F16B 47/00", "text": "Suction cups for attaching purposes; Equivalent means using adhesives"}]}, {"symbol": "F16C", "text": "SHAFTS; FLEXIBLE SHAFTS; ELEMENTS OF CRANKSHAFT MECHANISMS; ROTARY BODIES OTHER THAN GEARING ELEMENTS; BEARINGS", "children": [{"symbol": "F16C 1/00", "text": "Flexible shafts", "children": [{"symbol": "F16C 1/10", "text": "Means for transmitting linear movement in a flexible sheathing, e.g. \"Bowden mechanisms\" (guiding-sheathings F16C 1/00)"}]}, {"symbol": "F16C 3/00", "text": "Shafts", "children": [{"symbol": "F16C 3/02", "text": "Shafts; Axles"}, {"symbol": "F16C 3/04", "text": "Crankshafts, eccentric-shafts; Cranks, eccentrics"}]}, {"symbol": "F16C 5/00", "text": "Crossheads; Constructions of connecting-rod heads or piston-rod connections rigid with crossheads"}, {"symbol": "F16C 7/00", "text": "Connecting-rods or like links pivoted at both ends"}, {"symbol": "F16C 9/00", "text": "Bearings for crankshafts or connecting-rods; Attachment of connecting-rods"}, {"symbol": "F16C 11/00", "text": "Pivots; Pivotal connections", "children": [{"symbol": "F16C 11/04", "text": "Pivotal connections (hinges for doors, windows or wings E05D; rubber springs with stiff outer sleeve and inner sleeve or pin F16F 1/38)", "children": [{"symbol": "F16C 11/06", "text": "Ball-joints; Other joints having more than one degree of angular freedom, i.e. universal joints (for transmitting rotary motion F16D 3/00; supports for apparatus with ball-joint heads F16M 11/02)"}]}]}, {"symbol": "F16C 13/00", "text": "Rolls, drums, discs, or the like", "children": [{"symbol": "F16C 13/02", "text": "Bearings"}]}, {"symbol": "F16C 15/00", "text": "Construction of rotary bodies to resist centrifugal force"}, {"symbol": "F16C 17/00", "text": "Sliding-contact bearings", "children": [{"symbol": "F16C 17/02", "text": "for radial load only", "children": [{"symbol": "F16C 17/03", "text": "with tiltably-supported segments, e.g. Michell bearings"}]}, {"symbol": "F16C 17/04", "text": "for axial load only"}]}, {"symbol": "F16C 19/00", "text": "Bearings with rolling contact", "children": [{"symbol": "F16C 19/02", "text": "with bearing balls essentially of the same size in one or more circular rows"}, {"symbol": "F16C 19/22", "text": "with bearing rollers essentially of the same size in one or more circular rows, e.g. needle bearings"}, {"symbol": "F16C 19/49", "text": "Bearings with both balls and rollers"}]}, {"symbol": "F16C 21/00", "text": "Combinations of sliding-contact bearings with ball or roller bearings"}, {"symbol": "F16C 23/00", "text": "Bearings adjustable for aligning or positioning"}, {"symbol": "F16C 25/00", "text": "Bearings adjustable for wear or play"}, {"symbol": "F16C 27/00", "text": "Elastic or yielding bearings or bearing supports"}, {"symbol": "F16C 29/00", "text": "Bearings for parts moving only linearly", "children": [{"symbol": "F16C 29/04", "text": "Ball or roller bearings", "children": [{"symbol": "F16C 29/06", "text": "in which the rolling bodies circulate partly without carrying load"}]}]}, {"symbol": "F16C 31/00", "text": "Bearings for parts which both rotate and move linearly"}, {"symbol": "F16C 32/00", "text": "Bearings not otherwise provided for", "children": [{"symbol": "F16C 32/04", "text": "using magnetic or electric supporting means"}, {"symbol": "F16C 32/06", "text": "with moving member supported by a fluid cushion formed, at least to a large extent, otherwise than by movement of the shaft, e.g. hydrostatic air-cushion bearings"}]}, {"symbol": "F16C 33/00", "text": "Parts of bearings; Special methods for making bearings or parts thereof", "children": [{"symbol": "F16C 33/02", "text": "Parts of sliding-contact bearings", "children": [{"symbol": "F16C 33/04", "text": "Brasses; Bushes; Linings"}]}, {"symbol": "F16C 33/30", "text": "Parts of ball or roller bearings", "children": [{"symbol": "F16C 33/38", "text": "Ball cages"}, {"symbol": "F16C 33/46", "text": "Cages for rollers or needles"}, {"symbol": "F16C 33/58", "text": "Raceways; Race rings", "children": [{"symbol": "F16C 33/62", "text": "Selection of substances"}]}, {"symbol": "F16C 33/66", "text": "Special parts or details in view of lubrication"}]}, {"symbol": "F16C 33/72", "text": "Sealings (sealings in general F16J)", "children": [{"symbol": "F16C 33/76", "text": "of ball or roller bearings"}]}]}, {"symbol": "F16C 35/00", "text": "Rigid support of bearing units; Housings, e.g. caps, covers", "children": [{"symbol": "F16C 35/04", "text": "in the case of ball or roller bearings"}]}, {"symbol": "F16C 37/00", "text": "Cooling of bearings"}, {"symbol": "F16C 39/00", "text": "Relieving load on bearings"}, {"symbol": "F16C 41/00", "text": "Other accessories"}, {"symbol": "F16C 43/00", "text": "Assembling bearings"}]}, {"symbol": "F16D", "text": "COUPLINGS FOR TRANSMITTING ROTATION; CLUTCHES; BRAKES", "children": [{"symbol": "F16D 1/00", "text": "Couplings for rigidly connecting two coaxial shafts or other movable machine elements", "children": [{"symbol": "F16D 1/02", "text": "for connecting two abutting shafts or the like"}, {"symbol": "F16D 1/06", "text": "for attachment of a member on a shaft or on a shaft-end (attachment of marine propellers on shafts B63H 23/00)"}]}, {"symbol": "F16D 3/00", "text": "Yielding couplings, i.e. with means permitting movement between the connected parts during the drive", "children": [{"symbol": "F16D 3/02", "text": "adapted to specific functions (universal joints, <u>see</u> the appropriate groups)", "children": [{"symbol": "F16D 3/12", "text": "specially adapted for accumulation of energy to absorb shocks or vibration (by making use of fluid elements F16D 3/00)"}]}, {"symbol": "F16D 3/16", "text": "Universal joints in which flexibility is produced by means of pivots or sliding or rolling connecting parts"}, {"symbol": "F16D 3/50", "text": "with the coupling parts connected by one or more intermediate members (F16D 3/16 takes precedence)"}]}, {"symbol": "F16D 5/00", "text": "Impulse couplings, i.e. couplings that alternately accelerate and decelerate the driven member"}, {"symbol": "F16D 7/00", "text": "Slip couplings, e.g. slipping on overload, for absorbing shock"}, {"symbol": "F16D 9/00", "text": "Couplings with safety member for disconnecting"}, {"symbol": "F16D 11/00", "text": "Clutches in which the members have interengaging parts"}, {"symbol": "F16D 13/00", "text": "Friction clutches", "children": [{"symbol": "F16D 13/58", "text": "Details", "children": [{"symbol": "F16D 13/60", "text": "Clutching elements (friction lining or attachment thereof F16D 69/00)", "children": [{"symbol": "F16D 13/64", "text": "Clutch-plates; Clutch-lamellae (brake-plates, brake-lamellae F16D 65/12)"}]}]}]}, {"symbol": "F16D 15/00", "text": "Clutches with wedging balls or rollers or with other wedgeable separate clutching members"}, {"symbol": "F16D 17/00", "text": "Clutches in which the drive is transmitted solely by virtue of the eccentricity of the contacting surfaces of clutch members which fit one around the other"}, {"symbol": "F16D 19/00", "text": "Clutches with mechanically-actuated clutching members not otherwise provided for"}, {"symbol": "F16D 21/00", "text": "Systems comprising a plurality of mechanically-actuated clutches"}, {"symbol": "F16D 23/00", "text": "Details of mechanically-actuated clutches not specific for one distinct type", "children": [{"symbol": "F16D 23/02", "text": "Arrangements for synchronisation, also for power-operated clutches (shape or mounting of interengaging parts of clutch members to facilitate engagement F16D 11/00)"}]}, {"symbol": "F16D 25/00", "text": "Fluid-actuated clutches", "children": [{"symbol": "F16D 25/02", "text": "with means for actuating or keeping engaged by a force derived at least partially from one of the shafts to be connected"}, {"symbol": "F16D 25/06", "text": "in which the fluid actuates a piston incorporated in the clutch (F16D 25/02 takes precedence)"}, {"symbol": "F16D 25/08", "text": "with fluid-actuated member not rotating with a clutching member (F16D 25/02 takes precedence)"}]}, {"symbol": "F16D 27/00", "text": "Magnetically-actuated clutches; Control or electric circuits therefor", "children": [{"symbol": "F16D 27/10", "text": "with an electromagnet not rotating with a clutching member, i.e. without collecting rings"}]}, {"symbol": "F16D 28/00", "text": "Electrically-actuated clutches"}, {"symbol": "F16D 29/00", "text": "Clutches or systems of clutches involving both fluid and magnetic or both fluid and electric actuation"}, {"symbol": "F16D 31/00", "text": "Fluid couplings or clutches with pumping sets of the volumetric type, i.e. in the case of liquid passing a predetermined volume per revolution", "children": [{"symbol": "F16D 31/02", "text": "using pumps with pistons or plungers working in cylinders"}]}, {"symbol": "F16D 33/00", "text": "Rotary fluid couplings or clutches of the hydrokinetic type"}, {"symbol": "F16D 35/00", "text": "Fluid clutches in which the clutching is predominantly obtained by fluid adhesion"}, {"symbol": "F16D 37/00", "text": "Clutches in which the drive is transmitted through a medium consisting of small particles, e.g. centrifugally speed-responsive"}, {"symbol": "F16D 39/00", "text": "Combinations of couplings according to two or more of the groups F16D 31/00 to F16D 37/00"}, {"symbol": "F16D 41/00", "text": "Freewheels or freewheel clutches"}, {"symbol": "F16D 43/00", "text": "Internally controlled automatic clutches"}, {"symbol": "F16D 45/00", "text": "Freewheels or freewheel clutches combined with automatic clutches"}, {"symbol": "F16D 47/00", "text": "Systems of clutches, or clutches and couplings, comprising devices of types grouped under at least two of the following sets of groups: F16D 1/00 to F16D 9/00; F16D 11/00 to F16D 23/00; F16D 25/00 to F16D 29/00; F16D 31/00 to F16D 39/00; F16D 41/00 to F16D 45/00"}, {"symbol": "F16D 48/00", "text": "External control of clutches"}, {"symbol": "F16D 49/00", "text": "Brakes with a braking member co-operating with the periphery of a drum, wheel-rim, or the like"}, {"symbol": "F16D 51/00", "text": "Brakes with outwardly-movable braking members co-operating with the inner surface of a drum or the like"}, {"symbol": "F16D 53/00", "text": "Brakes with braking members co-operating with both the periphery and the inner surface of a drum, wheel-rim, or the like"}, {"symbol": "F16D 55/00", "text": "Brakes with substantially-radial braking surfaces pressed together in axial direction, e.g. disc brakes", "children": [{"symbol": "F16D 55/02", "text": "with axially-movable discs or pads pressed against axially-located rotating members", "children": [{"symbol": "F16D 55/22", "text": "by clamping an axially-located rotating disc between movable braking members, e.g. movable brake discs or brake pads"}]}, {"symbol": "F16D 55/24", "text": "with a plurality of axially-movable discs, lamellae, or pads, pressed from one side towards an axially-located member"}]}, {"symbol": "F16D 57/00", "text": "Liquid-resistance brakes; Air-resistance brakes"}, {"symbol": "F16D 59/00", "text": "Self-acting brakes, e.g. coming into operation at a predetermined speed"}, {"symbol": "F16D 61/00", "text": "Brakes with means for making the energy absorbed available for use"}, {"symbol": "F16D 63/00", "text": "Brakes not otherwise provided for; Brakes combining more than one of the types of groups F16D 49/00 to F16D 61/00"}, {"symbol": "F16D 65/00", "text": "Parts or details", "children": [{"symbol": "F16D 65/02", "text": "Braking members; Mounting thereof (friction linings or attachment thereof F16D 69/00)", "children": [{"symbol": "F16D 65/04", "text": "Bands, shoes or pads; Pivots or supporting members therefor", "children": [{"symbol": "F16D 65/092", "text": "for axially-engaging brakes, e.g. disc brakes"}]}, {"symbol": "F16D 65/12", "text": "Discs; Drums for disc brakes"}]}, {"symbol": "F16D 65/14", "text": "Actuating mechanisms for brakes; Means for initiating operation at a predetermined position (brake control systems, parts thereof B60T)", "children": [{"symbol": "F16D 65/16", "text": "arranged in or on the brake", "children": [{"symbol": "F16D 65/18", "text": "adapted for drawing members together"}]}]}, {"symbol": "F16D 65/38", "text": "Slack adjusters"}]}, {"symbol": "F16D 66/00", "text": "Arrangements for monitoring working conditions, e.g. wear, temperature"}, {"symbol": "F16D 67/00", "text": "Combinations of couplings and brakes; Combinations of clutches and brakes"}, {"symbol": "F16D 69/00", "text": "Friction linings; Attachment thereof; Selection of coacting friction substances or surfaces", "children": [{"symbol": "F16D 69/02", "text": "Composition of linings (chemical aspects, <u>see</u> the relevant classes)"}]}, {"symbol": "F16D 71/00", "text": "Mechanisms for bringing members to rest in a predetermined position"}]}, {"symbol": "F16F", "text": "SPRINGS; SHOCK-ABSORBERS; MEANS FOR DAMPING VIBRATION", "children": [{"symbol": "F16F 1/00", "text": "Springs", "children": [{"symbol": "F16F 1/02", "text": "made of steel or other material having low internal friction (F16F 1/36 takes precedence); Wound, torsion, leaf, cup, ring or the like springs, the material of the spring not being relevant", "children": [{"symbol": "F16F 1/04", "text": "Wound springs"}]}, {"symbol": "F16F 1/36", "text": "made of plastics, e.g. rubber; made of material having high internal friction", "children": [{"symbol": "F16F 1/38", "text": "with a sleeve of elastic material between a rigid outer sleeve and a rigid inner sleeve or pin"}, {"symbol": "F16F 1/42", "text": "characterised by the mode of stressing", "children": [{"symbol": "F16F 1/44", "text": "loaded mainly in compression"}]}]}]}, {"symbol": "F16F 3/00", "text": "Spring units consisting of several springs, e.g. for obtaining a desired spring characteristic"}, {"symbol": "F16F 5/00", "text": "Liquid springs in which the liquid works as a spring by compression, e.g. combined with throttling action; Combinations of devices including liquid springs"}, {"symbol": "F16F 6/00", "text": "Magnetic springs; Fluid magnetic springs"}, {"symbol": "F16F 7/00", "text": "Vibration-dampers; Shock-absorbers", "children": [{"symbol": "F16F 7/10", "text": "using inertia effect"}, {"symbol": "F16F 7/12", "text": "using plastic deformation of members"}]}, {"symbol": "F16F 9/00", "text": "Springs, vibration-dampers, shock-absorbers, or similarly-constructed movement-dampers using a fluid or the equivalent as damping medium", "children": [{"symbol": "F16F 9/02", "text": "using gas only"}, {"symbol": "F16F 9/10", "text": "using liquid only; using a fluid of which the nature is immaterial", "children": [{"symbol": "F16F 9/14", "text": "Devices with one or more members, e.g. pistons, vanes, moving to and fro in chambers and using throttling effect"}]}, {"symbol": "F16F 9/32", "text": "Details", "children": [{"symbol": "F16F 9/34", "text": "Special valve constructions (valves in general F16K); Shape or construction of throttling passages"}, {"symbol": "F16F 9/36", "text": "Special sealings, including sealings or guides for piston-rods"}, {"symbol": "F16F 9/43", "text": "Filling arrangements, e.g. for supply of gas"}, {"symbol": "F16F 9/44", "text": "Means on or in the damper for manual or non-automatic adjustment; such means combined with temperature correction (F16F 9/53, F16F 9/56 take precedence; temperature correction only F16F 9/50)"}, {"symbol": "F16F 9/48", "text": "Arrangements for providing different damping effects at different parts of the stroke (F16F 9/53, F16F 9/56 take precedence)"}, {"symbol": "F16F 9/50", "text": "Special means providing automatic damping adjustment (F16F 9/53, F16F 9/56 take precedence; automatic temperature damping adjustment combined with external adjustment F16F 9/44)"}, {"symbol": "F16F 9/53", "text": "Means for adjusting damping characteristics by varying fluid viscosity, e.g. electromagnetically"}, {"symbol": "F16F 9/54", "text": "Arrangements for attachment"}, {"symbol": "F16F 9/56", "text": "Means for adjusting the length of, or for locking, the spring or damper, e.g. at the end of the stroke"}, {"symbol": "F16F 9/58", "text": "Stroke limiting stops, e.g. arranged on the piston rod outside the cylinder (F16F 9/48 takes precedence)"}]}]}, {"symbol": "F16F 11/00", "text": "Vibration-dampers or shock-absorbers working with both friction and a damping fluid"}, {"symbol": "F16F 13/00", "text": "Units comprising springs of the non-fluid type as well as vibration-dampers, shock-absorbers, or fluid springs", "children": [{"symbol": "F16F 13/02", "text": "damping by frictional contact between the spring and braking means (frictionally coacting wound springs F16F 3/00)"}, {"symbol": "F16F 13/04", "text": "comprising both a plastics spring and a damper, e.g. a friction damper"}]}, {"symbol": "F16F 15/00", "text": "Suppression of vibrations in systems", "children": [{"symbol": "F16F 15/02", "text": "Suppression of vibrations of non-rotating, e.g. reciprocating, systems; Suppression of vibrations of rotating systems by use of members not moving with the rotating system (layered products B32B; suppression of vibration in ships B63)", "children": [{"symbol": "F16F 15/023", "text": "using fluid means"}, {"symbol": "F16F 15/03", "text": "using electromagnetic means (F16F 9/53 takes precedence)"}, {"symbol": "F16F 15/04", "text": "using elastic means (single elements or their attachment F16F 1/00 to F16F 13/00)", "children": [{"symbol": "F16F 15/06", "text": "with metal springs (with rubber springs also F16F 15/08)"}, {"symbol": "F16F 15/08", "text": "with rubber springs"}]}]}, {"symbol": "F16F 15/10", "text": "Suppression of vibrations in rotating systems by making use of members moving with the system (by balancing F16F 15/22; with flywheels acting variably or intermittently F16H)", "children": [{"symbol": "F16F 15/12", "text": "using elastic members or friction-damping members, e.g. between a rotating shaft and a gyratory mass mounted thereon (F16F 15/16 takes precedence)", "children": [{"symbol": "F16F 15/121", "text": "using springs as elastic members, e.g. metallic springs (F16F 15/131 takes precedence)"}, {"symbol": "F16F 15/131", "text": "the rotating system comprising two or more gyratory masses"}]}, {"symbol": "F16F 15/16", "text": "using a fluid (devices connecting input and output members F16D)"}]}, {"symbol": "F16F 15/22", "text": "Compensation of inertia forces"}, {"symbol": "F16F 15/30", "text": "Flywheels (F16F 15/16 takes precedence; suppression of vibrations in rotating systems using elastic members or friction-damping members moving with the system F16F 15/12; rotary-body aspects in general F16C 13/00, F16C 15/00)"}]}]}, {"symbol": "F16G", "text": "BELTS, CABLES, OR ROPES, PREDOMINANTLY USED FOR DRIVING PURPOSES; CHAINS; FITTINGS PREDOMINANTLY USED THEREFOR", "children": [{"symbol": "F16G 1/00", "text": "Driving-belts", "children": [{"symbol": "F16G 1/28", "text": "with a contact surface of special shape, e.g. toothed"}]}, {"symbol": "F16G 3/00", "text": "Belt fastenings, e.g. for conveyer belts"}, {"symbol": "F16G 5/00", "text": "V-belts, i.e. belts of tapered cross-section"}, {"symbol": "F16G 7/00", "text": "V-belt fastenings"}, {"symbol": "F16G 9/00", "text": "Ropes or cables specially adapted for driving, or for being driven by, pulleys or other gearing elements"}, {"symbol": "F16G 11/00", "text": "Means for fastening cables or ropes to one another or to other objects"}, {"symbol": "F16G 13/00", "text": "Chains"}, {"symbol": "F16G 15/00", "text": "Chain couplings; Shackles; Chain joints; Chain links; Chain bushes"}, {"symbol": "F16G 17/00", "text": "Hooks as integral parts of chains"}]}, {"symbol": "F16H", "text": "GEARING", "children": [{"symbol": "F16H 1/00", "text": "Toothed gearings for conveying rotary motion", "children": [{"symbol": "F16H 1/02", "text": "without gears having orbital motion", "children": [{"symbol": "F16H 1/04", "text": "involving only two intermeshing members"}]}, {"symbol": "F16H 1/28", "text": "with gears having orbital motion", "children": [{"symbol": "F16H 1/32", "text": "in which the central axis of the gearing lies inside the periphery of an orbital gear"}]}]}, {"symbol": "F16H 3/00", "text": "Toothed gearings for conveying rotary motion with variable gear ratio or for reversing rotary motion", "children": [{"symbol": "F16H 3/02", "text": "without gears having orbital motion", "children": [{"symbol": "F16H 3/08", "text": "exclusively or essentially with continuously- meshing gears, that can be disengaged from their shafts"}]}, {"symbol": "F16H 3/44", "text": "using gears having orbital motion"}]}, {"symbol": "F16H 7/00", "text": "Gearings for conveying rotary motion by endless flexible members", "children": [{"symbol": "F16H 7/02", "text": "with belts; with V-belts"}, {"symbol": "F16H 7/08", "text": "Means for varying tension of belts, ropes, or chains (pulleys of adjustable construction F16H 55/32)", "children": [{"symbol": "F16H 7/10", "text": "by adjusting the axis of a pulley", "children": [{"symbol": "F16H 7/12", "text": "of an idle pulley"}]}]}]}, {"symbol": "F16H 9/00", "text": "Gearings for conveying rotary motion with variable gear ratio, or for reversing rotary motion, by endless flexible members", "children": [{"symbol": "F16H 9/02", "text": "without members having orbital motion"}, {"symbol": "F16H 9/26", "text": "with members having orbital motion"}]}, {"symbol": "F16H 13/00", "text": "Gearing for conveying rotary motion with constant gear ratio by friction between rotary members"}, {"symbol": "F16H 15/00", "text": "Gearings for conveying rotary motion with variable gear ratio, or for reversing rotary motion, by friction between rotary members", "children": [{"symbol": "F16H 15/02", "text": "without members having orbital motion", "children": [{"symbol": "F16H 15/04", "text": "Gearings providing a continuous range of gear ratios", "children": [{"symbol": "F16H 15/06", "text": "in which a member A of uniform effective diameter mounted on a shaft may co-operate with different parts of a member B", "children": [{"symbol": "F16H 15/08", "text": "in which the member B is a disc with a flat or approximately-flat friction surface"}, {"symbol": "F16H 15/16", "text": "in which the member B has a conical friction surface"}, {"symbol": "F16H 15/26", "text": "in which the member B has a spherical friction surface centered on its axis of revolution"}, {"symbol": "F16H 15/32", "text": "in which the member B has a curved friction surface formed as a surface of a body of revolution generated by a curve which is neither a circular arc centered on its axis of revolution nor a straight line"}]}]}]}]}, {"symbol": "F16H 19/00", "text": "Gearings comprising essentially only toothed gears or friction members and not capable of conveying indefinitely-continuing rotary motion"}, {"symbol": "F16H 21/00", "text": "Gearings comprising primarily only links or levers, with or without slides"}, {"symbol": "F16H 23/00", "text": "Wobble-plate gearings; Oblique-crank gearings"}, {"symbol": "F16H 25/00", "text": "Gearings comprising primarily only cams, cam-followers and screw-and-nut mechanisms", "children": [{"symbol": "F16H 25/18", "text": "for conveying or interconverting oscillating or reciprocating motions", "children": [{"symbol": "F16H 25/20", "text": "Screw mechanisms (with automatic reversal F16H 25/00)", "children": [{"symbol": "F16H 25/22", "text": "with balls, rollers, or similar members between the co-operating parts; Elements essential to the use of such members"}, {"symbol": "F16H 25/24", "text": "Elements essential to such mechanisms, e.g. screws, nuts (F16H 25/22 takes precedence)"}]}]}]}, {"symbol": "F16H 27/00", "text": "Step-by-step mechanisms without freewheel members, e.g. Geneva drives"}, {"symbol": "F16H 29/00", "text": "Gearings for conveying rotary motion with intermittently-driving members, e.g. with freewheel action"}, {"symbol": "F16H 31/00", "text": "Other gearings with freewheeling members or other intermittently-driving members"}, {"symbol": "F16H 33/00", "text": "Gearings based on repeated accumulation and delivery of energy"}, {"symbol": "F16H 35/00", "text": "Gearings or mechanisms with other special functional features"}, {"symbol": "F16H 37/00", "text": "Combinations of mechanical gearings, not hereinbefore provided for", "children": [{"symbol": "F16H 37/02", "text": "comprising essentially only toothed or friction gearings", "children": [{"symbol": "F16H 37/06", "text": "with a plurality of driving or driven shafts; with arrangements for dividing torque between two or more intermediate shafts"}]}]}, {"symbol": "F16H 39/00", "text": "Rotary fluid gearing using pumps and motors of the volumetric type, i.e. passing a predetermined volume of fluid per revolution"}, {"symbol": "F16H 41/00", "text": "Rotary fluid gearing of the hydrokinetic type"}, {"symbol": "F16H 43/00", "text": "Other fluid gearing, e.g. with oscillating input or output"}, {"symbol": "F16H 45/00", "text": "Combinations of fluid gearings for conveying rotary motion with couplings or clutches"}, {"symbol": "F16H 47/00", "text": "Combinations of mechanical gearing with fluid clutches or fluid gearing"}, {"symbol": "F16H 48/00", "text": "Differential gearings"}, {"symbol": "F16H 49/00", "text": "Other gearing"}, {"symbol": "F16H 51/00", "text": "Levers"}, {"symbol": "F16H 53/00", "text": "Cams; Non-rotary cams; Cam-followers, e.g. rollers"}, {"symbol": "F16H 55/00", "text": "Elements with teeth or friction surfaces for conveying motion; Worms; Pulleys; Sheaves", "children": [{"symbol": "F16H 55/02", "text": "Toothed members; Worms", "children": [{"symbol": "F16H 55/06", "text": "Use of materials; Use of treatments of toothed members or worms to affect their intrinsic material properties"}, {"symbol": "F16H 55/17", "text": "Toothed wheels (worm wheels F16H 55/02; chain wheels F16H 55/02)"}]}, {"symbol": "F16H 55/32", "text": "Friction members (friction surfaces F16D 69/00)", "children": [{"symbol": "F16H 55/36", "text": "Pulleys (with features essential for adjustment F16H 55/32)"}]}]}, {"symbol": "F16H 57/00", "text": "General details of gearing", "children": [{"symbol": "F16H 57/02", "text": "Gear-boxes; Mounting gearing therein"}, {"symbol": "F16H 57/04", "text": "Features relating to lubrication or cooling", "children": [{"symbol": "F16H 57/05", "text": "of chains (for conveyers B65G 45/00)"}]}]}, {"symbol": "F16H 59/00", "text": "Control inputs to change-speed- or reversing-gearings for conveying rotary motion", "children": [{"symbol": "F16H 59/02", "text": "Selector apparatus", "children": [{"symbol": "F16H 59/04", "text": "Ratio selector apparatus"}, {"symbol": "F16H 59/08", "text": "Range selector apparatus", "children": [{"symbol": "F16H 59/10", "text": "comprising levers"}]}]}, {"symbol": "F16H 59/14", "text": "Inputs being a function of torque or torque demand", "children": [{"symbol": "F16H 59/18", "text": "dependent on the position of the accelerator pedal"}, {"symbol": "F16H 59/24", "text": "dependent on the throttle opening"}]}, {"symbol": "F16H 59/36", "text": "Inputs being a function of speed", "children": [{"symbol": "F16H 59/38", "text": "of gearing elements", "children": [{"symbol": "F16H 59/42", "text": "Input shaft speed"}]}, {"symbol": "F16H 59/44", "text": "dependent on machine speed (F16H 59/46 takes precedence)"}, {"symbol": "F16H 59/46", "text": "dependent on a comparison between speeds"}]}, {"symbol": "F16H 59/48", "text": "Inputs being a function of acceleration"}, {"symbol": "F16H 59/50", "text": "Inputs being a function of the status of the machine, e.g. position of doors or safety belts"}, {"symbol": "F16H 59/60", "text": "Inputs being a function of ambient conditions"}, {"symbol": "F16H 59/68", "text": "Inputs being a function of gearing status", "children": [{"symbol": "F16H 59/70", "text": "dependent on the ratio established"}, {"symbol": "F16H 59/72", "text": "dependent on oil characteristics, e.g. temperature, viscosity"}]}]}, {"symbol": "F16H 61/00", "text": "Control functions within change-speed- or reversing-gearings for conveying rotary motion", "children": [{"symbol": "F16H 61/02", "text": "characterised by the signals used"}, {"symbol": "F16H 61/04", "text": "Smoothing ratio shift", "children": [{"symbol": "F16H 61/06", "text": "by controlling rate of change of fluid pressure"}, {"symbol": "F16H 61/08", "text": "Timing control"}]}, {"symbol": "F16H 61/10", "text": "Regulating shift hysteresis"}, {"symbol": "F16H 61/12", "text": "Detecting malfunction or potential malfunction, e.g. fail safe"}, {"symbol": "F16H 61/14", "text": "Control of torque converter lock-up clutches"}, {"symbol": "F16H 61/16", "text": "Inhibiting shift during unfavourable conditions (F16H 61/18 takes precedence)"}, {"symbol": "F16H 61/18", "text": "Preventing unintentional or unsafe shift (constructional features of the final output mechanisms F16H 63/30)"}, {"symbol": "F16H 61/20", "text": "Preventing gear creeping"}, {"symbol": "F16H 61/21", "text": "Providing engine brake control"}, {"symbol": "F16H 61/22", "text": "Locking (F16H 63/30 takes precedence)"}, {"symbol": "F16H 61/24", "text": "Providing feel, e.g. to enable selection"}, {"symbol": "F16H 61/26", "text": "Generation or transmission of movements for final actuating mechanisms", "children": [{"symbol": "F16H 61/28", "text": "with at least one movement of the final actuating mechanism being caused by a non-mechanical force, e.g. power-assisted"}]}, {"symbol": "F16H 61/38", "text": "Control of exclusively fluid gearing", "children": [{"symbol": "F16H 61/40", "text": "hydrostatic (involving modification of the gearing F16H 39/00)"}]}, {"symbol": "F16H 61/66", "text": "specially adapted for continuously variable gearings (F16H 61/38 takes precedence)"}, {"symbol": "F16H 61/68", "text": "specially adapted for stepped gearings"}, {"symbol": "F16H 61/70", "text": "specially adapted for change-speed gearing in group arrangement, i.e. with separate change-speed gear trains arranged in series, e.g. range or overdrive-type gearing arrangements"}]}, {"symbol": "F16H 63/00", "text": "Control outputs to change-speed- or reversing-gearings for conveying rotary motion", "children": [{"symbol": "F16H 63/02", "text": "Final output mechanisms therefor; Actuating means for the final output mechanisms", "children": [{"symbol": "F16H 63/08", "text": "Multiple final output mechanisms being moved by a single common final actuating mechanism"}, {"symbol": "F16H 63/30", "text": "Constructional features of the final output mechanisms"}]}]}]}, {"symbol": "F16J", "text": "PISTONS; CYLINDERS; PRESSURE VESSELS IN GENERAL; SEALINGS", "children": [{"symbol": "F16J 1/00", "text": "Pistons; Trunk pistons; Plungers", "children": [{"symbol": "F16J 1/10", "text": "Connection to driving members"}]}, {"symbol": "F16J 3/00", "text": "Diaphragms; Bellows; Bellows pistons"}, {"symbol": "F16J 7/00", "text": "Piston-rods, i.e. rods rigidly connected to the piston"}, {"symbol": "F16J 9/00", "text": "Piston-rings, seats therefor; Ring sealings of similar construction in general", "children": [{"symbol": "F16J 9/26", "text": "characterised by the use of particular materials"}]}, {"symbol": "F16J 10/00", "text": "Engine or like cylinders"}, {"symbol": "F16J 12/00", "text": "Pressure vessels in general"}, {"symbol": "F16J 13/00", "text": "Covers or similar closure members for pressure vessels in general"}, {"symbol": "F16J 15/00", "text": "Sealings", "children": [{"symbol": "F16J 15/02", "text": "between relatively-stationary surfaces (F16J 15/46 takes precedence)", "children": [{"symbol": "F16J 15/06", "text": "with solid packing compressed between sealing surfaces", "children": [{"symbol": "F16J 15/08", "text": "with exclusively metal packing"}, {"symbol": "F16J 15/10", "text": "with non-metallic packing", "children": [{"symbol": "F16J 15/12", "text": "with metal reinforcement or covering"}]}]}]}, {"symbol": "F16J 15/16", "text": "between relatively-moving surfaces (F16J 15/50 takes precedence; bellows pistons F16J 3/00; piston-rings or ring sealings of similar construction in general F16J 9/00; spindle sealings for valves F16K 41/00)", "children": [{"symbol": "F16J 15/18", "text": "with stuffing-boxes for elastic or plastic packings"}, {"symbol": "F16J 15/32", "text": "with elastic sealing lip"}, {"symbol": "F16J 15/34", "text": "with slip-ring pressed against a more or less radial face on one member", "children": [{"symbol": "F16J 15/36", "text": "connected by a diaphragm to the other member"}, {"symbol": "F16J 15/38", "text": "sealed by a packing"}]}, {"symbol": "F16J 15/40", "text": "by means of fluid"}]}, {"symbol": "F16J 15/44", "text": "Free-space packings"}, {"symbol": "F16J 15/46", "text": "with packing ring expanded or pressed into place by fluid pressure, e.g. inflatable packings (connection of valves to inflatable elastic bodies B60C 29/00; specially adapted for tube connections F16L)"}, {"symbol": "F16J 15/50", "text": "between relatively-movable members, by means of a sealing without relatively-moving surfaces, e.g. fluid-tight sealings for transmitting motion through a wall"}]}]}, {"symbol": "F16K", "text": "VALVES; TAPS; COCKS; ACTUATING-FLOATS; DEVICES FOR VENTING OR AERATING", "children": [{"symbol": "F16K 1/00", "text": "Lift valves, i.e. cut-off apparatus with closure members having at least a component of their opening and closing motion perpendicular to the closing faces", "children": [{"symbol": "F16K 1/16", "text": "with pivoted closure members", "children": [{"symbol": "F16K 1/18", "text": "with pivoted discs or flaps", "children": [{"symbol": "F16K 1/22", "text": "with axis of rotation crossing the valve member, e.g. butterfly valves", "children": [{"symbol": "F16K 1/226", "text": "Shape or arrangement of the sealing"}]}]}]}, {"symbol": "F16K 1/32", "text": "Details (details of more general applicability F16K 25/00 to F16K 51/00)"}]}, {"symbol": "F16K 3/00", "text": "Gate valves or sliding valves, i.e. cut-off apparatus with closing members having a sliding movement along the seat for opening and closing", "children": [{"symbol": "F16K 3/02", "text": "with flat sealing faces; Packings therefor"}]}, {"symbol": "F16K 5/00", "text": "Taps or cocks comprising only cut-off apparatus having at least one of the sealing faces shaped as a more or less complete surface of a solid of revolution, the opening and closing movement being predominantly rotary", "children": [{"symbol": "F16K 5/06", "text": "with plugs having spherical surfaces; Packings therefor"}]}, {"symbol": "F16K 7/00", "text": "Diaphragm cut-off apparatus, e.g. with a member deformed, but not moved bodily, to close the passage", "children": [{"symbol": "F16K 7/12", "text": "with flat, dished, or bowl-shaped diaphragm"}]}, {"symbol": "F16K 11/00", "text": "Multiple-way valves, e.g. mixing valves; Pipe fittings incorporating such valves; Arrangement of valves and flow lines specially adapted for mixing fluid", "children": [{"symbol": "F16K 11/02", "text": "with all movable sealing faces moving as one unit", "children": [{"symbol": "F16K 11/06", "text": "comprising only sliding valves", "children": [{"symbol": "F16K 11/065", "text": "with linearly sliding closure members"}]}]}, {"symbol": "F16K 11/10", "text": "with two or more closure members not moving as a unit"}]}, {"symbol": "F16K 13/00", "text": "Other constructional types of cut-off apparatus"}, {"symbol": "F16K 15/00", "text": "Check valves", "children": [{"symbol": "F16K 15/02", "text": "with guided rigid valve members"}, {"symbol": "F16K 15/14", "text": "with flexible valve members"}]}, {"symbol": "F16K 17/00", "text": "Safety valves; Equalising valves", "children": [{"symbol": "F16K 17/02", "text": "opening on surplus pressure on one side; closing on insufficient pressure on one side (check valves F16K 15/00)", "children": [{"symbol": "F16K 17/04", "text": "spring-loaded", "children": [{"symbol": "F16K 17/06", "text": "with special arrangements for adjusting the opening pressure"}]}]}, {"symbol": "F16K 17/18", "text": "opening on surplus pressure on either side"}, {"symbol": "F16K 17/20", "text": "Excess-flow valves (actuated in consequence of shock or similar extraneous influence F16K 17/36)"}, {"symbol": "F16K 17/36", "text": "actuated in consequence of extraneous circumstances, e.g. shock, change of position"}]}, {"symbol": "F16K 21/00", "text": "Fluid-delivery valves"}, {"symbol": "F16K 23/00", "text": "Valves for preventing drip from nozzles"}, {"symbol": "F16K 24/00", "text": "Devices, e.g. valves, for venting or aerating enclosures"}, {"symbol": "F16K 25/00", "text": "Details relating to contact between valve members and seats"}, {"symbol": "F16K 27/00", "text": "Construction of housings", "children": [{"symbol": "F16K 27/02", "text": "of lift valves (for reducing the flow resistance of screw-spindle lift-valves F16K 1/00)"}, {"symbol": "F16K 27/04", "text": "of sliding valves"}, {"symbol": "F16K 27/06", "text": "of taps or cocks"}]}, {"symbol": "F16K 29/00", "text": "Arrangements for movement of valve members other than for opening or closing the valve, e.g. for grinding-in, for preventing sticking"}, {"symbol": "F16K 31/00", "text": "Operating means; Releasing devices", "children": [{"symbol": "F16K 31/02", "text": "electric; magnetic", "children": [{"symbol": "F16K 31/04", "text": "using a motor", "children": [{"symbol": "F16K 31/05", "text": "specially adapted for operating hand-operated valves or for combined motor and hand operation"}]}, {"symbol": "F16K 31/06", "text": "using a magnet", "children": [{"symbol": "F16K 31/08", "text": "using a permanent magnet"}, {"symbol": "F16K 31/10", "text": "with additional mechanism between armature and closure member"}]}]}, {"symbol": "F16K 31/12", "text": "actuated by fluid (fluid-actuated check valves F16K 15/00; fluid-actuated safety valves F16K 17/00)", "children": [{"symbol": "F16K 31/122", "text": "the fluid acting on a piston (F16K 31/14, F16K 31/16, F16K 31/36 take precedence)"}, {"symbol": "F16K 31/126", "text": "the fluid acting on a diaphragm, bellows, or the like (F16K 31/14, F16K 31/16, F16K 31/36 take precedence)"}, {"symbol": "F16K 31/14", "text": "for mounting on, or in combination with, hand-actuated valves"}, {"symbol": "F16K 31/16", "text": "with a mechanism, other than pulling- or pushing-rod, between fluid motor and closure member (with float F16K 31/18)"}, {"symbol": "F16K 31/18", "text": "actuated by a float (floats F16K 33/00; float-actuated valves in steam-traps F16T 1/00, in boilers F22D 5/00)"}, {"symbol": "F16K 31/36", "text": "in which fluid from the conduit is constantly supplied to the fluid motor"}]}, {"symbol": "F16K 31/44", "text": "Mechanical actuating means", "children": [{"symbol": "F16K 31/52", "text": "with crank, eccentric, or cam"}, {"symbol": "F16K 31/60", "text": "Handles"}]}, {"symbol": "F16K 31/64", "text": "responsive to temperature variation (dependant on excessive temperature F16K 17/36; control of fire-fighting equipment A62C 37/00; devices for preventing bursting of water pipes by freezing E03B 7/00)"}]}, {"symbol": "F16K 33/00", "text": "Floats for actuation of valves or other apparatus"}, {"symbol": "F16K 35/00", "text": "Means to prevent accidental or unauthorised actuation"}, {"symbol": "F16K 37/00", "text": "Special means in or on valves or other cut-off apparatus for indicating or recording operation thereof, or for enabling an alarm to be given"}, {"symbol": "F16K 39/00", "text": "Devices for relieving the pressure on the sealing faces"}, {"symbol": "F16K 41/00", "text": "Spindle sealings"}, {"symbol": "F16K 43/00", "text": "Auxiliary closure means in valves, which in case of repair, e.g. rewashering, of the valve, can take over the function of the normal closure means; Devices for temporary replacement of parts of valves for the same purpose"}, {"symbol": "F16K 47/00", "text": "Means in valves for absorbing fluid energy"}, {"symbol": "F16K 49/00", "text": "Means in or on valves for heating or cooling"}, {"symbol": "F16K 51/00", "text": "Other details not peculiar to particular types of valves or cut-off apparatus", "children": [{"symbol": "F16K 51/02", "text": "specially adapted for high-vacuum installations"}]}, {"symbol": "F16K 99/00", "text": "Subject matter not provided for in other groups of this subclass"}]}, {"symbol": "F16L", "text": "PIPES; JOINTS OR FITTINGS FOR PIPES; SUPPORTS FOR PIPES, CABLES OR PROTECTIVE TUBING; MEANS FOR THERMAL INSULATION IN GENERAL", "children": [{"symbol": "F16L 1/00", "text": "Laying or reclaiming pipes; Repairing or joining pipes on or under water", "children": [{"symbol": "F16L 1/024", "text": "Laying or reclaiming pipes on land, e.g. above the ground (F16L 1/12 takes precedence)", "children": [{"symbol": "F16L 1/026", "text": "in or on a frozen surface"}, {"symbol": "F16L 1/028", "text": "in the ground (F16L 1/026 takes precedence)"}, {"symbol": "F16L 1/06", "text": "Accessories therefor, e.g. anchors"}]}, {"symbol": "F16L 1/12", "text": "Laying or reclaiming pipes on or under water (buoyant hoses F16L 11/12)"}, {"symbol": "F16L 1/26", "text": "Repairing or joining pipes on or under water (buoyant hoses F16L 11/12; joints <u>per se</u>F16L 13/00 to F16L 49/00)"}]}, {"symbol": "F16L 3/00", "text": "Supports for pipes, cables or protective tubing, e.g. hangers, holders, clamps, cleats, clips, brackets", "children": [{"symbol": "F16L 3/01", "text": "for supporting or guiding the pipes, cables or protective tubing, between relatively movable points, e.g. movable channels (hauling- or hoisting-chains with arrangements for holding electric cables, hoses or the like F16G 13/00)"}, {"symbol": "F16L 3/02", "text": "partly surrounding the pipes, cables or protective tubing (bands or chains F16L 3/14)"}, {"symbol": "F16L 3/08", "text": "substantially surrounding the pipe, cable or protective tubing", "children": [{"symbol": "F16L 3/10", "text": "divided, i.e. with two members engaging the pipe, cable or protective tubing"}, {"symbol": "F16L 3/12", "text": "comprising a member substantially surrounding the pipe, cable or protective tubing"}]}, {"symbol": "F16L 3/14", "text": "Hangers in the form of bands or chains"}, {"symbol": "F16L 3/16", "text": "with special provision allowing movement of the pipe (F16L 3/01 takes precedence; supporting pipes or cables inside other pipes or sleeves F16L 7/00)"}, {"symbol": "F16L 3/22", "text": "specially adapted for supporting a number of parallel pipes at intervals"}, {"symbol": "F16L 3/24", "text": "with special member for attachment to profiled girders"}]}, {"symbol": "F16L 5/00", "text": "Devices for use where pipes, cables or protective tubing pass through walls or partitions", "children": [{"symbol": "F16L 5/02", "text": "Sealing"}]}, {"symbol": "F16L 7/00", "text": "Supporting pipes or cables inside other pipes or sleeves, e.g. for enabling pipes or cables to be inserted or withdrawn from under roads or railways without interruption of traffic"}, {"symbol": "F16L 9/00", "text": "Rigid pipes", "children": [{"symbol": "F16L 9/18", "text": "Double-walled pipes; Multi-channel pipes or pipe assemblies (joints therefor F16L 39/00)"}]}, {"symbol": "F16L 11/00", "text": "Hoses, i.e. flexible pipes", "children": [{"symbol": "F16L 11/04", "text": "made of rubber or flexible plastics", "children": [{"symbol": "F16L 11/08", "text": "with reinforcements embedded in the wall (F16L 11/11 takes precedence)"}, {"symbol": "F16L 11/11", "text": "with corrugated wall"}, {"symbol": "F16L 11/12", "text": "with arrangements for particular purposes, e.g. specially profiled, with protecting layer, heated, electrically conducting (F16L 11/11 takes precedence)"}]}]}, {"symbol": "F16L 13/00", "text": "Non-disconnectable pipe joints, e.g. soldered, adhesive, or caulked joints", "children": [{"symbol": "F16L 13/007", "text": "specially adapted for joining pipes of dissimilar materials"}, {"symbol": "F16L 13/14", "text": "made by plastically deforming the material of the pipe, e.g. by flanging, rolling"}]}, {"symbol": "F16L 15/00", "text": "Screw-threaded joints"}, {"symbol": "F16L 17/00", "text": "Joints with packing adapted to sealing by fluid pressure"}, {"symbol": "F16L 19/00", "text": "Joints in which sealing surfaces are pressed together by means of a member, e.g. a swivel nut, screwed on, or into, one of the joint parts", "children": [{"symbol": "F16L 19/02", "text": "Pipe ends provided with collars or flanges, integral with the pipe or not, pressed together by a screwed member"}]}, {"symbol": "F16L 21/00", "text": "Joints with sleeve or socket", "children": [{"symbol": "F16L 21/02", "text": "with elastic sealing rings between pipe and sleeve or between pipe and socket, e.g. with rolling or other prefabricated profiled rings (F16L 21/06, F16L 21/08 take precedence; if adjustability is essential F16L 27/00)"}, {"symbol": "F16L 21/06", "text": "with a divided sleeve or ring clamping around the pipe ends (flanged joints F16L 23/00; couplings of the quick-acting type F16L 37/00)"}, {"symbol": "F16L 21/08", "text": "with additional locking means (F16L 21/06 takes precedence; couplings of the quick-acting type F16L 37/00)"}]}, {"symbol": "F16L 23/00", "text": "Flanged joints"}, {"symbol": "F16L 25/00", "text": "Construction or details of pipe joints not provided for in, or of interest apart from, groups F16L 13/00 to F16L 23/00"}, {"symbol": "F16L 27/00", "text": "Adjustable joints; Joints allowing movement", "children": [{"symbol": "F16L 27/02", "text": "Universal joints, i.e. with mechanical connection allowing angular movement or adjustment of the axes of the parts in any direction"}, {"symbol": "F16L 27/12", "text": "allowing substantial longitudinal adjustment or movement (by use of screw-thread F16L 15/00)"}]}, {"symbol": "F16L 29/00", "text": "Joints with fluid cut-off means"}, {"symbol": "F16L 31/00", "text": "Arrangements for connecting hoses to one another or to flexible sleeves"}, {"symbol": "F16L 33/00", "text": "Arrangements for connecting hoses to rigid members", "children": [{"symbol": "F16L 33/01", "text": "specially adapted for hoses having a multi-layer wall"}, {"symbol": "F16L 33/02", "text": "Hose-clips"}, {"symbol": "F16L 33/16", "text": "with sealing or securing means using fluid pressure"}, {"symbol": "F16L 33/18", "text": "characterised by the use of additional sealing means"}, {"symbol": "F16L 33/20", "text": "Undivided rings, sleeves, or like members contracted on the hose or expanded inside the hose by means of tools; Arrangements using such members"}, {"symbol": "F16L 33/22", "text": "with means not mentioned in the preceding groups for gripping the hose between inner and outer parts"}, {"symbol": "F16L 33/24", "text": "with parts screwed directly on or into the hose (F16L 33/22 takes precedence)"}, {"symbol": "F16L 33/26", "text": "specially adapted for hoses made of metal"}, {"symbol": "F16L 33/28", "text": "for hoses with one end terminating in a radial flange or collar"}, {"symbol": "F16L 33/30", "text": "comprising parts inside the hoses only (F16L 33/24 takes precedence)"}, {"symbol": "F16L 33/32", "text": "comprising parts outside the hoses only (F16L 33/24 takes precedence)"}, {"symbol": "F16L 33/34", "text": "with bonding obtained by vulcanisation, gluing, melting, or the like"}]}, {"symbol": "F16L 35/00", "text": "Special arrangements used in connection with end fittings of hoses, e.g. safety or protecting devices"}, {"symbol": "F16L 37/00", "text": "Couplings of the quick-acting type", "children": [{"symbol": "F16L 37/28", "text": "with fluid cut-off means"}]}, {"symbol": "F16L 39/00", "text": "Joints or fittings for double-walled or multi-channel pipes or pipe assemblies"}, {"symbol": "F16L 41/00", "text": "Branching pipes; Joining pipes to walls", "children": [{"symbol": "F16L 41/02", "text": "Branch units, e.g. made in one piece, welded, riveted"}, {"symbol": "F16L 41/08", "text": "Joining pipes to walls or pipes, the joined pipe axis being perpendicular to the plane of a wall or to the axis of another pipe (F16L 41/02 takes precedence)"}]}, {"symbol": "F16L 43/00", "text": "Bends; Siphons"}, {"symbol": "F16L 45/00", "text": "Pipe units with cleaning aperture and closure therefor"}, {"symbol": "F16L 47/00", "text": "Connecting arrangements or other fittings specially adapted to be made of plastics or to be used with pipes made of plastics", "children": [{"symbol": "F16L 47/02", "text": "Welded joints; Adhesive joints"}]}, {"symbol": "F16L 49/00", "text": "Connecting arrangements, e.g. joints, specially adapted for pipes of brittle material, e.g. glass, earthenware"}, {"symbol": "F16L 51/00", "text": "Expansion-compensation arrangements for pipe-lines"}, {"symbol": "F16L 53/00", "text": "Heating or cooling pipes or pipe systems"}, {"symbol": "F16L 55/00", "text": "Devices or appurtenances for use in, or in connection with, pipes or pipe systems", "children": [{"symbol": "F16L 55/02", "text": "Energy absorbers; Noise absorbers (in valves F16K 47/00)"}, {"symbol": "F16L 55/04", "text": "Devices damping pulsations or vibrations in fluids"}, {"symbol": "F16L 55/07", "text": "Arrangement or mounting of devices, e.g. valves, for venting or aerating or draining (arrangement of draining devices in water-supply systems E03B 7/00; apparatus for draining F16K, F16T; venting or aerating devices <u>per se</u>F16K 24/00)"}, {"symbol": "F16L 55/09", "text": "Air-conditioning, e.g. de-watering, in pneumatic systems (in general F24)"}, {"symbol": "F16L 55/10", "text": "Means for stopping flow in pipes or hoses (F16L 29/00, F16L 37/28 take precedence; for covering leaks F16L 55/16; valves F16K)"}, {"symbol": "F16L 55/16", "text": "Devices for covering leaks in pipes or hoses, e.g. hose-menders", "children": [{"symbol": "F16L 55/162", "text": "from inside the pipe (specially adapted for bends, branch units, branching pipes, or the like F16L 55/16)"}]}, {"symbol": "F16L 55/18", "text": "Appliances for use in repairing pipes (F16L 55/10 takes precedence)"}, {"symbol": "F16L 55/24", "text": "Preventing accumulation of dirt or other matter in pipes, e.g. by traps, by strainers"}, {"symbol": "F16L 55/26", "text": "Pigs or moles, i.e. devices movable in a pipe or conduit with or without self-contained propulsion means (tunnel railway systems B61B 13/10; conveying articles through pipes or tubes, e.g. tube mail systems, B65G 51/00)"}]}, {"symbol": "F16L 57/00", "text": "Protection of pipes or objects of similar shape against external or internal damage or wear"}, {"symbol": "F16L 58/00", "text": "Protection of pipes or pipe fittings against corrosion or incrustation", "children": [{"symbol": "F16L 58/02", "text": "by means of internal or external coatings (coatings for thermal insulation F16L 59/00; methods or machines for applying coatings, <u>see</u> the relevant places, e.g. B28B 21/00)"}]}, {"symbol": "F16L 59/00", "text": "Thermal insulation in general", "children": [{"symbol": "F16L 59/02", "text": "Shape or form of insulating materials, with or without coverings integral with the insulating materials (chemical aspects, <u>see</u> the relevant classes)"}, {"symbol": "F16L 59/04", "text": "Arrangements using dry fillers, e.g. using slag wool"}, {"symbol": "F16L 59/06", "text": "Arrangements using an air layer or vacuum"}, {"symbol": "F16L 59/08", "text": "Means for preventing radiation, e.g. with metal foil"}, {"symbol": "F16L 59/10", "text": "Bandages or covers for the protection of the insulation, e.g. against the influence of the environment or against mechanical damage (integral with insulating materials F16L 59/02)"}, {"symbol": "F16L 59/12", "text": "Arrangements for supporting insulation from the wall or body insulated, e.g. by means of spacers between pipe and heat-insulating material; Arrangements specially adapted for supporting insulated bodies"}]}]}, {"symbol": "F16M", "text": "FRAMES, CASINGS, OR BEDS, OF ENGINES OR OTHER MACHINES OR APPARATUS, NOT SPECIFIC TO AN ENGINE, MACHINE, OR APPARATUS PROVIDED FOR ELSEWHERE; STANDS OR SUPPORTS", "children": [{"symbol": "F16M 1/00", "text": "Frames or casings of engines, machines, or apparatus; Frames serving as machinery beds"}, {"symbol": "F16M 3/00", "text": "Portable or wheeled frames or beds, e.g. for emergency power-supply aggregates, compressor sets"}, {"symbol": "F16M 5/00", "text": "Engine beds, i.e. means for supporting engines or machines on foundations"}, {"symbol": "F16M 7/00", "text": "Details of attaching or adjusting engine beds, frames, or supporting-legs on foundation or base; Attaching non-moving engine parts, e.g. cylinder blocks"}, {"symbol": "F16M 9/00", "text": "Special layout of foundations with respect to machinery to be supported"}, {"symbol": "F16M 11/00", "text": "Stands or trestles as supports for apparatus or articles placed thereon", "children": [{"symbol": "F16M 11/02", "text": "Heads"}, {"symbol": "F16M 11/20", "text": "Undercarriages with or without wheels"}]}, {"symbol": "F16M 13/00", "text": "Other supports for positioning apparatus or articles", "children": [{"symbol": "F16M 13/02", "text": "for supporting on, or attaching to, an object, e.g. tree, gate, window-frame, cycle"}, {"symbol": "F16M 13/04", "text": "for supporting on, or holding steady relative to, a person, e.g. by chains"}, {"symbol": "F16M 13/06", "text": "also serviceable for other purposes, e.g. to be used as spade, chair, ski-stick"}]}]}, {"symbol": "F16N", "text": "LUBRICATING", "children": [{"symbol": "F16N 1/00", "text": "Constructional modifications of parts of machines or apparatus for the purpose of lubrication"}, {"symbol": "F16N 3/00", "text": "Devices for supplying lubricant by manual action"}, {"symbol": "F16N 5/00", "text": "Apparatus with hand-positioned nozzle supplied with lubricant under pressure"}, {"symbol": "F16N 7/00", "text": "Arrangements for supplying oil or unspecified lubricant from a stationary reservoir or the equivalent in or on the machine or member to be lubricated"}, {"symbol": "F16N 9/00", "text": "Arrangements for supplying oil or unspecified lubricant from a moving reservoir or the equivalent"}, {"symbol": "F16N 11/00", "text": "Arrangements for supplying grease from a stationary reservoir or the equivalent in or on the machine or member to be lubricated; Grease cups"}, {"symbol": "F16N 13/00", "text": "Lubricating-pumps"}, {"symbol": "F16N 15/00", "text": "Lubrication with substances other than oil or grease; Lubrication characterised by the use of particular lubricants in particular apparatus or conditions"}, {"symbol": "F16N 17/00", "text": "Lubrication of machines or apparatus working under extreme conditions"}, {"symbol": "F16N 19/00", "text": "Lubricant containers for use in lubricators or lubrication systems"}, {"symbol": "F16N 21/00", "text": "Conduits; Junctions"}, {"symbol": "F16N 23/00", "text": "Special adaptations of check valves"}, {"symbol": "F16N 25/00", "text": "Distributing equipment"}, {"symbol": "F16N 27/00", "text": "Proportioning devices"}, {"symbol": "F16N 29/00", "text": "Special means in lubricating arrangements or systems providing for the indication or detection of undesired conditions; Use of devices responsive to conditions in lubricating arrangements or systems"}, {"symbol": "F16N 31/00", "text": "Means for collecting, retaining, or draining-off lubricant in or on machines or apparatus"}, {"symbol": "F16N 33/00", "text": "Mechanical arrangements for cleaning lubricating equipment; Special racks or the like for use in draining lubricant from machine parts"}, {"symbol": "F16N 35/00", "text": "Storage of lubricants in engine-rooms or the like"}, {"symbol": "F16N 37/00", "text": "Equipment for transferring lubricant from one container to another"}, {"symbol": "F16N 39/00", "text": "Arrangements for conditioning of lubricants in the lubricating system"}, {"symbol": "F16N 99/00", "text": "Subject matter not provided for in other groups of this subclass"}]}, {"symbol": "F16P", "text": "SAFETY DEVICES IN GENERAL", "children": [{"symbol": "F16P 1/00", "text": "Safety devices independent of the control or operation of any machine"}, {"symbol": "F16P 3/00", "text": "Safety devices acting in conjunction with the control or operation of a machine; Control arrangements requiring the simultaneous use of two or more parts of the body"}, {"symbol": "F16P 5/00", "text": "Emergency means for rendering ineffective a coupling conveying reciprocating movement if the motion of the driven part is prematurely resisted"}, {"symbol": "F16P 7/00", "text": "Emergency devices preventing damage to a machine or apparatus"}]}, {"symbol": "F16S", "text": "CONSTRUCTIONAL ELEMENTS IN GENERAL; STRUCTURES BUILT-UP FROM SUCH ELEMENTS, IN GENERAL", "children": [{"symbol": "F16S 1/00", "text": "Sheets, panels, or other members of similar proportions; Constructions comprising assemblies of such members"}, {"symbol": "F16S 3/00", "text": "Elongated members, e.g. profiled members; Assemblies thereof; Gratings or grilles"}, {"symbol": "F16S 5/00", "text": "Other constructional members not restricted to an application fully provided for in a single class"}]}, {"symbol": "F16T", "text": "STEAM TRAPS OR LIKE APPARATUS FOR DRAINING-OFF LIQUIDS FROM ENCLOSURES PREDOMINANTLY CONTAINING GASES OR VAPOURS", "children": [{"symbol": "F16T 1/00", "text": "Steam traps or like apparatus for draining-off liquids from enclosures predominantly containing gases or vapours, e.g. gas lines, steam lines, containers"}]}]}, {"symbol": "F17", "text": "STORING OR DISTRIBUTING GASES OR LIQUIDS", "children": [{"symbol": "F17B", "text": "GAS-HOLDERS OF VARIABLE CAPACITY", "children": [{"symbol": "F17B 1/00", "text": "Gas-holders of variable capacity"}]}, {"symbol": "F17C", "text": "VESSELS FOR CONTAINING OR STORING COMPRESSED, LIQUEFIED, OR SOLIDIFIED GASES; FIXED-CAPACITY GAS-HOLDERS; FILLING VESSELS WITH, OR DISCHARGING FROM VESSELS, COMPRESSED, LIQUEFIED, OR SOLIDIFIED GASES", "children": [{"symbol": "F17C 1/00", "text": "Pressure vessels, e.g. gas cylinder, gas tank, replaceable cartridge"}, {"symbol": "F17C 3/00", "text": "Vessels not under pressure"}, {"symbol": "F17C 5/00", "text": "Methods or apparatus for filling pressure vessels with liquefied, solidified, or compressed gases"}, {"symbol": "F17C 6/00", "text": "Methods or apparatus for filling vessels not under pressure with liquefied or solidified gases"}, {"symbol": "F17C 7/00", "text": "Methods or apparatus for discharging liquefied, solidified, or compressed gases from pressure vessels, not covered by another subclass"}, {"symbol": "F17C 9/00", "text": "Methods or apparatus for discharging liquefied or solidified gases from vessels not under pressure"}, {"symbol": "F17C 11/00", "text": "Use of gas-solvents or gas-sorbents in vessels"}, {"symbol": "F17C 13/00", "text": "Details of vessels or of the filling or discharging of vessels", "children": [{"symbol": "F17C 13/04", "text": "Arrangement or mounting of valves (valves <u>per se</u>F16K)"}, {"symbol": "F17C 13/08", "text": "Mounting arrangements for vessels"}]}]}, {"symbol": "F17D", "text": "PIPE-LINE SYSTEMS; PIPE-LINES", "children": [{"symbol": "F17D 1/00", "text": "Pipe-line systems"}, {"symbol": "F17D 3/00", "text": "Arrangements for supervising or controlling working operations"}, {"symbol": "F17D 5/00", "text": "Protection or supervision of installations"}]}]}, {"symbol": "F21", "text": "LIGHTING", "children": [{"symbol": "F21H", "text": "INCANDESCENT MANTLES; OTHER INCANDESCENT BODIES HEATED BY COMBUSTION", "children": [{"symbol": "F21H 1/00", "text": "Incandescent mantles; Selection of imbibition liquids therefor"}, {"symbol": "F21H 3/00", "text": "Manufacturing incandescent mantles; Treatment prior to use, e.g. burning-off; Machines for manufacturing"}, {"symbol": "F21H 5/00", "text": "Solid incandescent bodies"}]}, {"symbol": "F21K", "text": "LIGHT SOURCES NOT OTHERWISE PROVIDED FOR", "children": [{"symbol": "F21K 2/00", "text": "Light sources using luminescence"}, {"symbol": "F21K 5/00", "text": "Light sources using charges of combustible material, e.g. illuminating flash devices"}, {"symbol": "F21K 7/00", "text": "Other light sources"}]}, {"symbol": "F21L", "text": "LIGHTING DEVICES OR SYSTEMS THEREOF, BEING PORTABLE OR SPECIALLY ADAPTED FOR TRANSPORTATION", "children": [{"symbol": "F21L 2/00", "text": "Systems of lighting devices"}, {"symbol": "F21L 4/00", "text": "Devices with self-contained electric batteries or cells"}, {"symbol": "F21L 13/00", "text": "Devices with built-in electric generators"}, {"symbol": "F21L 14/00", "text": "Devices without a self-contained power source, e.g. for mains connection"}, {"symbol": "F21L 17/00", "text": "Torches; Flares"}, {"symbol": "F21L 19/00", "text": "Lanterns, e.g. hurricane lamps, candle lamps"}, {"symbol": "F21L 21/00", "text": "Pocket-lamps, e.g. producing sparks"}, {"symbol": "F21L 23/00", "text": "Miners' hand-lamps"}, {"symbol": "F21L 26/00", "text": "Non-electric portable lighting devices, or systems thereof, not provided for in groups F21L 17/00 to F21L 23/00"}, {"symbol": "F21L 27/00", "text": "Devices or systems employing combinations of electric and non-electric light sources; Replacing electric by non-electric light sources or <u>vice versa</u>"}]}, {"symbol": "F21S", "text": "NON-PORTABLE LIGHTING DEVICES OR SYSTEMS THEREOF", "children": [{"symbol": "F21S 2/00", "text": "Systems of lighting devices, not provided for in main groups F21S 4/00 to F21S 10/00, e.g. of modular construction"}, {"symbol": "F21S 4/00", "text": "Devices or systems using a string or strip of light sources"}, {"symbol": "F21S 6/00", "text": "Devices intended to be free-standing"}, {"symbol": "F21S 8/00", "text": "Devices intended for fixed installation", "children": [{"symbol": "F21S 8/02", "text": "of recess-mounted type, e.g. downlighters (F21S 8/10 takes precedence)"}, {"symbol": "F21S 8/04", "text": "intended only for mounting on a ceiling or like overhead structure (F21S 8/02 takes precedence)"}, {"symbol": "F21S 8/08", "text": "with a standard"}, {"symbol": "F21S 8/10", "text": "specially adapted for vehicles (arrangement of signalling or lighting devices, the mounting or supporting thereof or circuits therefor, for vehicles in general B60Q)"}]}, {"symbol": "F21S 9/00", "text": "Devices with a built-in power supply; Systems employing such devices"}, {"symbol": "F21S 10/00", "text": "Devices or systems producing a varying lighting effect"}, {"symbol": "F21S 11/00", "text": "Devices or systems using daylight"}, {"symbol": "F21S 13/00", "text": "Devices or systems employing a point-like light source; Devices or systems employing a light source of unspecified shape"}, {"symbol": "F21S 15/00", "text": "Devices or systems employing light sources not covered by group F21S 11/00 or F21S 13/00"}, {"symbol": "F21S 19/00", "text": "Devices or systems employing combinations of electric and non-electric light sources; Replacing electric by non-electric light sources or <u>vice versa</u>"}]}, {"symbol": "F21V", "text": "FUNCTIONAL FEATURES OR DETAILS OF LIGHTING DEVICES OR SYSTEMS THEREOF; STRUCTURAL COMBINATIONS OF LIGHTING DEVICES WITH OTHER ARTICLES, NOT OTHERWISE PROVIDED FOR", "children": [{"symbol": "F21V 1/00", "text": "Shades"}, {"symbol": "F21V 3/00", "text": "Globes; Bowls; Cover glasses"}, {"symbol": "F21V 5/00", "text": "Refractors"}, {"symbol": "F21V 7/00", "text": "Reflectors"}, {"symbol": "F21V 8/00", "text": "Use of light guides, e.g. fibre optic devices, in lighting devices or systems"}, {"symbol": "F21V 9/00", "text": "Light filters"}, {"symbol": "F21V 11/00", "text": "Screens not covered by groups F21V 1/00, F21V 3/00, F21V 7/00, F21V 9/00"}, {"symbol": "F21V 13/00", "text": "Producing particular characteristics or distribution of the light emitted by means of a combination of elements specified in two or more of main groups F21V 1/00 to F21V 11/00"}, {"symbol": "F21V 14/00", "text": "Changing the characteristics or distribution of the light emitted by adjustment of parts"}, {"symbol": "F21V 15/00", "text": "Protecting lighting devices from damage"}, {"symbol": "F21V 17/00", "text": "Fastening of component parts of lighting devices, e.g. shades, globes, refractors, reflectors, filters, screens, grids or protective cages"}, {"symbol": "F21V 19/00", "text": "Fastening of light sources or lamp holders", "children": [{"symbol": "F21V 19/02", "text": "with provision for adjustment, e.g. for focusing (changing the characteristics or distribution of the light emitted by adjustment of parts F21V 14/00)"}, {"symbol": "F21V 19/04", "text": "with provision for changing light source, e.g. turret"}]}, {"symbol": "F21V 21/00", "text": "Supporting, suspending, or attaching arrangements for lighting devices", "children": [{"symbol": "F21V 21/002", "text": "making direct electrical contact, e.g. by piercing (F21V 21/34 takes precedence)"}, {"symbol": "F21V 21/005", "text": "for several lighting devices in an end-to-end arrangement, i.e. light tracks"}, {"symbol": "F21V 21/008", "text": "Suspending from a cable or suspension line"}, {"symbol": "F21V 21/02", "text": "Wall, ceiling, or floor bases; Fixing pendants or arms to the bases (F21V 21/08 takes precedence; bases for movable standing lamps F21V 21/06)"}, {"symbol": "F21V 21/06", "text": "Bases for movable standing lamps; Fixing standards to the bases (F21V 21/08 takes precedence)"}, {"symbol": "F21V 21/08", "text": "Devices for easy attachment to a desired place"}, {"symbol": "F21V 21/10", "text": "Pendants, arms, or standards; Fixing lighting devices to pendants, arms, or standards (adjustable mounting F21V 21/14; construction of posts not peculiar to use with lighting devices E04H 12/00)"}, {"symbol": "F21V 21/13", "text": "Spring-loaded poles fixed at both ends"}, {"symbol": "F21V 21/14", "text": "Adjustable mountings"}, {"symbol": "F21V 21/34", "text": "Supporting elements displaceable along a guiding element"}, {"symbol": "F21V 21/36", "text": "Hoisting or lowering devices, e.g. for maintenance (F21V 21/14 takes precedence)"}, {"symbol": "F21V 21/40", "text": "Hand grips"}]}, {"symbol": "F21V 23/00", "text": "Arrangement of electric circuit elements in or on lighting devices", "children": [{"symbol": "F21V 23/02", "text": "the elements being transformers or impedances"}, {"symbol": "F21V 23/04", "text": "the elements being switches (safety devices F21V 25/00)"}]}, {"symbol": "F21V 25/00", "text": "Safety devices structurally associated with lighting devices"}, {"symbol": "F21V 27/00", "text": "Cable-stowing arrangements structurally associated with lighting devices, e.g. reels"}, {"symbol": "F21V 29/00", "text": "Cooling or heating arrangements"}, {"symbol": "F21V 31/00", "text": "Gas-tight or water-tight arrangements"}, {"symbol": "F21V 33/00", "text": "Structural combinations of lighting devices with other articles, not otherwise provided for"}, {"symbol": "F21V 35/00", "text": "Candle holders"}, {"symbol": "F21V 36/00", "text": "Arrangements of mantles or other incandescent bodies on burners"}, {"symbol": "F21V 37/00", "text": "Details of lighting devices employing combustion as light source, not otherwise provided for"}, {"symbol": "F21V 99/00", "text": "Subject matter not provided for in other groups of this subclass"}]}]}, {"symbol": "F22", "text": "STEAM GENERATION", "children": [{"symbol": "F22B", "text": "METHODS OF STEAM GENERATION; STEAM BOILERS", "children": [{"symbol": "F22B 1/00", "text": "Methods of steam generation characterised by form of heating method"}, {"symbol": "F22B 3/00", "text": "Other methods of steam generation"}, {"symbol": "F22B 5/00", "text": "Steam boilers of drum type, i.e. without internal furnace or fire tubes, the boiler body being contacted externally by flue gas"}, {"symbol": "F22B 7/00", "text": "Steam boilers of furnace-tube type, i.e. the combustion of fuel being performed inside one or more furnace tubes built-in in the boiler body"}, {"symbol": "F22B 9/00", "text": "Steam boilers of fire-tube type, i.e. the flue gas from a combustion chamber outside the boiler body flowing through tubes built-in in the boiler body"}, {"symbol": "F22B 11/00", "text": "Steam boilers of combined fire-tube type and water-tube type, i.e. steam boilers of fire-tube type having auxiliary water tubes"}, {"symbol": "F22B 13/00", "text": "Steam boilers of fire-box type, i.e. the combustion of fuel being performed in a chamber or fire-box with subsequent flue(s) or fire tube(s), both chamber or fire-box and flues or fire tubes being built-in in the boiler body"}, {"symbol": "F22B 15/00", "text": "Water-tube boilers of horizontal type, i.e. the water-tube sets being arranged horizontally"}, {"symbol": "F22B 17/00", "text": "Water-tube boilers of horizontally-inclined type, i.e. the water-tube sets being inclined slightly with respect to the horizontal plane"}, {"symbol": "F22B 19/00", "text": "Water-tube boilers of combined horizontally-inclined type and vertical type, i.e. water-tube boilers of horizontally-inclined type having auxiliary water-tube sets in vertical or substantially-vertical arrangement"}, {"symbol": "F22B 21/00", "text": "Water-tube boilers of vertical or steeply-inclined type, i.e. the water-tube sets being arranged vertically or substantially vertically"}, {"symbol": "F22B 23/00", "text": "Water-tube boilers built-up from sets of spaced double-walled water tubes of return type in unilaterial abutting connection with a boiler drum or with a header box, i.e. built-up from Field water tubes comprising an inner tube arranged within an outer unilaterally-closed tube"}, {"symbol": "F22B 25/00", "text": "Water-tube boilers built-up from sets of water tubes with internally-arranged flue tubes, or fire tubes, extending through the water tubes"}, {"symbol": "F22B 27/00", "text": "Instantaneous or flash steam boilers"}, {"symbol": "F22B 29/00", "text": "Steam boilers of forced-flow type"}, {"symbol": "F22B 31/00", "text": "Modifications of boiler construction, or of tube systems, dependent on installation of combustion apparatus; Arrangements or dispositions of combustion apparatus"}, {"symbol": "F22B 33/00", "text": "Steam-generation plants, e.g. comprising steam boilers of different types in mutual association"}, {"symbol": "F22B 35/00", "text": "Control systems for steam boilers"}, {"symbol": "F22B 37/00", "text": "Component parts or details of steam boilers"}]}, {"symbol": "F22D", "text": "PREHEATING, OR ACCUMULATING PREHEATED, FEED-WATER; FEED-WATER SUPPLY; CONTROLLING WATER LEVEL; CIRCULATING WATER WITHIN BOILERS", "children": [{"symbol": "F22D 1/00", "text": "Feed-water heaters, e.g. preheaters"}, {"symbol": "F22D 3/00", "text": "Accumulators for preheated water"}, {"symbol": "F22D 5/00", "text": "Controlling water feed or water level; Automatic water feeding or water-level regulators"}, {"symbol": "F22D 7/00", "text": "Auxiliary devices or apparatus for promoting water circulation"}, {"symbol": "F22D 11/00", "text": "Feed-water supply not provided for in other main groups"}]}, {"symbol": "F22G", "text": "SUPERHEATING OF STEAM", "children": [{"symbol": "F22G 1/00", "text": "Steam superheating characterised by heating method"}, {"symbol": "F22G 3/00", "text": "Steam superheaters characterised by constructional features; Details or component parts thereof"}, {"symbol": "F22G 5/00", "text": "Controlling superheat temperature"}, {"symbol": "F22G 7/00", "text": "Steam superheaters characterised by location, arrangement, or disposition"}]}]}, {"symbol": "F23", "text": "COMBUSTION APPARATUS; COMBUSTION PROCESSES", "children": [{"symbol": "F23B", "text": "METHODS OR APPARATUS FOR COMBUSTION USING ONLY SOLID FUEL", "children": [{"symbol": "F23B 10/00", "text": "Combustion apparatus characterised by the combination of two or more combustion chambers"}, {"symbol": "F23B 20/00", "text": "Combustion apparatus specially adapted for portability or transportability"}, {"symbol": "F23B 30/00", "text": "Combustion apparatus with driven means for agitating the burning fuel; Combustion apparatus with driven means for advancing the burning fuel through the combustion chamber", "children": [{"symbol": "F23B 30/02", "text": "with movable, e.g. vibratable, fuel-supporting surfaces; with fuel-supporting surfaces that have movable parts"}]}, {"symbol": "F23B 40/00", "text": "Combustion apparatus with driven means for feeding fuel into the combustion chamber", "children": [{"symbol": "F23B 40/02", "text": "the fuel being fed by scattering over the fuel-supporting surface"}, {"symbol": "F23B 40/04", "text": "the fuel being fed from below through an opening in the fuel-supporting surface"}, {"symbol": "F23B 40/06", "text": "the fuel being fed along the fuel-supporting surface"}]}, {"symbol": "F23B 50/00", "text": "Combustion apparatus in which the fuel is fed into or through the combustion zone by gravity, e.g. from a fuel storage situated above the combustion zone", "children": [{"symbol": "F23B 50/02", "text": "the fuel forming a column, stack or thick layer with the combustion zone at its bottom"}, {"symbol": "F23B 50/12", "text": "the fuel being fed to the combustion zone by free fall or by sliding along inclined surfaces, e.g. from a conveyer terminating above the fuel bed"}]}, {"symbol": "F23B 60/00", "text": "Combustion apparatus in which the fuel burns essentially without moving", "children": [{"symbol": "F23B 60/02", "text": "with combustion air supplied through a grate"}]}, {"symbol": "F23B 70/00", "text": "Combustion apparatus characterised by means for returning solid combustion residues to the combustion chamber"}, {"symbol": "F23B 80/00", "text": "Combustion apparatus characterised by means creating a distinct flow path for flue gases or for non-combusted gases given off by the fuel", "children": [{"symbol": "F23B 80/02", "text": "by means for returning flue gases to the combustion chamber or to the combustion zone"}, {"symbol": "F23B 80/04", "text": "by means for guiding the flow of flue gases, e.g. baffles"}]}, {"symbol": "F23B 90/00", "text": "Combustion methods not related to a particular type of apparatus"}, {"symbol": "F23B 99/00", "text": "Subject matter not provided for in other groups of this subclass"}]}, {"symbol": "F23C", "text": "METHODS OR APPARATUS FOR COMBUSTION USING FLUENT FUEL", "children": [{"symbol": "F23C 1/00", "text": "Combustion apparatus specially adapted for combustion of two or more kinds of fuel simultaneously or alternately, at least one kind of fuel being fluent"}, {"symbol": "F23C 3/00", "text": "Combustion apparatus characterised by the shape of the combustion chamber"}, {"symbol": "F23C 5/00", "text": "Combustion apparatus characterised by the arrangement or mounting of burners"}, {"symbol": "F23C 6/00", "text": "Combustion apparatus characterised by the combination of two or more combustion chambers"}, {"symbol": "F23C 7/00", "text": "Combustion apparatus characterised by arrangements for air supply"}, {"symbol": "F23C 9/00", "text": "Combustion apparatus characterised by arrangements for returning combustion products or flue gases to the combustion chamber"}, {"symbol": "F23C 10/00", "text": "Apparatus in which combustion takes place in a fluidised bed of fuel or other particles", "children": [{"symbol": "F23C 10/01", "text": "in a fluidised bed of catalytic particles"}]}, {"symbol": "F23C 13/00", "text": "Apparatus in which combustion takes place in the presence of catalytic material", "children": [{"symbol": "F23C 13/02", "text": "characterised by arrangements for starting the operation, e.g. for heating the catalytic material to operating temperature"}, {"symbol": "F23C 13/04", "text": "characterised by the arrangement of two or more catalytic elements in series connection"}, {"symbol": "F23C 13/06", "text": "in which non-catalytic combustion takes place in addition to catalytic combustion, e.g. downstream of a catalytic element"}, {"symbol": "F23C 13/08", "text": "characterised by the catalytic material"}]}, {"symbol": "F23C 15/00", "text": "Apparatus in which combustion takes place in pulses influenced by acoustic resonance in a gas mass"}, {"symbol": "F23C 99/00", "text": "Subject matter not provided for in other groups of this subclass"}]}, {"symbol": "F23D", "text": "BURNERS", "children": [{"symbol": "F23D 1/00", "text": "Burners for combustion of pulverulent fuel"}, {"symbol": "F23D 3/00", "text": "Burners using capillary action"}, {"symbol": "F23D 5/00", "text": "Burners in which liquid fuel evaporates in the combustion space, with or without chemical conversion of evaporated fuel"}, {"symbol": "F23D 7/00", "text": "Burners in which drops of liquid fuel impinge on a surface"}, {"symbol": "F23D 9/00", "text": "Burners in which a stream of liquid fuel impinges intermittently on a hot surface"}, {"symbol": "F23D 11/00", "text": "Burners using a direct spraying action of liquid droplets or vaporised liquid into the combustion space", "children": [{"symbol": "F23D 11/10", "text": "the spraying being induced by a gaseous medium, e.g. water vapour"}, {"symbol": "F23D 11/24", "text": "by pressurisation of the fuel before a nozzle through which it is sprayed by a substantial pressure reduction into a space"}, {"symbol": "F23D 11/36", "text": "Details", "children": [{"symbol": "F23D 11/40", "text": "Mixing tubes; Burner heads"}]}]}, {"symbol": "F23D 14/00", "text": "Burners for combustion of a gas, e.g. of a gas stored under pressure as a liquid", "children": [{"symbol": "F23D 14/02", "text": "Premix gas burners, i.e. in which gaseous fuel is mixed with combustion air upstream of the combustion zone", "children": [{"symbol": "F23D 14/04", "text": "induction type, e.g. Bunsen burner"}]}, {"symbol": "F23D 14/12", "text": "Radiant burners", "children": [{"symbol": "F23D 14/18", "text": "using catalysis for flameless combustion"}]}, {"symbol": "F23D 14/46", "text": "Details", "children": [{"symbol": "F23D 14/48", "text": "Nozzles (for spraying or coating B05B)"}, {"symbol": "F23D 14/72", "text": "Safety devices, e.g. operative in case of failure of gas supply (protection or supervision of pipe-line systems F17D 5/00)"}]}]}, {"symbol": "F23D 17/00", "text": "Burners for combustion simultaneously or alternately of gaseous or liquid or pulverulent fuel"}, {"symbol": "F23D 21/00", "text": "Burners not otherwise provided for"}, {"symbol": "F23D 23/00", "text": "Assemblies of two or more burners"}]}, {"symbol": "F23G", "text": "CREMATION FURNACES; CONSUMING WASTE BY COMBUSTION", "children": [{"symbol": "F23G 1/00", "text": "Furnaces for cremation of human or animal carcasses"}, {"symbol": "F23G 5/00", "text": "Incineration of waste", "children": [{"symbol": "F23G 5/02", "text": "with pretreatment", "children": [{"symbol": "F23G 5/027", "text": "pyrolising or gasifying stage (pyrolisation of sludge C02F 11/00; destructive distillation of carbonaceous materials C10B 53/00)"}]}, {"symbol": "F23G 5/08", "text": "having supplementary heating", "children": [{"symbol": "F23G 5/14", "text": "including secondary combustion", "children": [{"symbol": "F23G 5/16", "text": "in a separate combustion chamber"}]}]}, {"symbol": "F23G 5/20", "text": "having rotating or oscillating drums"}, {"symbol": "F23G 5/24", "text": "having a vertical, substantially cylindrical, combustion chamber"}, {"symbol": "F23G 5/30", "text": "having a fluidised bed"}, {"symbol": "F23G 5/32", "text": "the waste being subjected to a whirling movement, e.g. cyclonic incinerators"}, {"symbol": "F23G 5/34", "text": "the waste being burnt in a pit or arranged in a heap for combustion"}, {"symbol": "F23G 5/36", "text": "having a conical combustion chamber, e.g. \"teepee\" incinerators (F23G 5/20 takes precedence)"}, {"symbol": "F23G 5/38", "text": "Multi-hearth arrangements"}, {"symbol": "F23G 5/40", "text": "Portable or mobile incinerators"}, {"symbol": "F23G 5/44", "text": "Details; Accessories", "children": [{"symbol": "F23G 5/46", "text": "Recuperation of heat"}, {"symbol": "F23G 5/48", "text": "Preventing corrosion"}]}, {"symbol": "F23G 5/50", "text": "Control or safety arrangements"}]}, {"symbol": "F23G 7/00", "text": "Incinerators or other apparatus specially adapted for consuming specific waste or low grade fuels, e.g. chemicals", "children": [{"symbol": "F23G 7/04", "text": "of waste liquors, e.g. sulfite liquors"}, {"symbol": "F23G 7/05", "text": "of waste oils"}, {"symbol": "F23G 7/06", "text": "of waste gases or noxious gases, e.g. exhaust gases (exhaust apparatus for machines, engines in general or internal combustion engines F01N; of uncombusted material from primary combustion within apparatus for combustion of solid or fluent fuel F23B, F23C)"}, {"symbol": "F23G 7/12", "text": "of plastics, e.g. rubber"}]}]}, {"symbol": "F23H", "text": "GRATES", "children": [{"symbol": "F23H 1/00", "text": "Grates with solid bars"}, {"symbol": "F23H 3/00", "text": "Grates with hollow bars"}, {"symbol": "F23H 5/00", "text": "Double grates"}, {"symbol": "F23H 7/00", "text": "Inclined grates"}, {"symbol": "F23H 9/00", "text": "Revolving grates; Rocking grates"}, {"symbol": "F23H 11/00", "text": "Travelling grates"}, {"symbol": "F23H 13/00", "text": "Grates not covered by any of groups F23H 1/00 to F23H 11/00"}, {"symbol": "F23H 15/00", "text": "Cleaning arrangements for grates"}, {"symbol": "F23H 17/00", "text": "Details of grates"}]}, {"symbol": "F23J", "text": "REMOVAL OR TREATMENT OF COMBUSTION PRODUCTS OR COMBUSTION RESIDUES; FLUES", "children": [{"symbol": "F23J 1/00", "text": "Removing ash, clinker, or slag from combustion chambers", "children": [{"symbol": "F23J 1/02", "text": "Apparatus for removing ash, clinker, or slag from ash-pits, e.g. by employing trucks or conveyers, by employing suction devices"}, {"symbol": "F23J 1/04", "text": "Hand tools, e.g. rakes, prickers, tongs"}, {"symbol": "F23J 1/06", "text": "Mechanically-operated devices, e.g. clinker pushers (forming part of the grate F23H)"}, {"symbol": "F23J 1/08", "text": "Liquid slag removal"}]}, {"symbol": "F23J 3/00", "text": "Removing solid residues from passages or chambers beyond the fire, e.g. from flues by soot blowers"}, {"symbol": "F23J 7/00", "text": "Arrangement of devices for supplying chemicals to fire"}, {"symbol": "F23J 9/00", "text": "Preventing premature solidification of molten combustion residues"}, {"symbol": "F23J 11/00", "text": "Devices for conducting smoke or fumes, e.g. flues"}, {"symbol": "F23J 13/00", "text": "Fittings for chimneys or flues"}, {"symbol": "F23J 15/00", "text": "Arrangements of devices for treating smoke or fumes", "children": [{"symbol": "F23J 15/02", "text": "of purifiers, e.g. for removing noxious material (traps for solid residues F23J 3/00)"}, {"symbol": "F23J 15/06", "text": "of coolers"}, {"symbol": "F23J 15/08", "text": "of heaters"}]}, {"symbol": "F23J 99/00", "text": "Subject matter not provided for in other groups of this subclass"}]}, {"symbol": "F23K", "text": "FEEDING FUEL TO COMBUSTION APPARATUS", "children": [{"symbol": "F23K 1/00", "text": "Preparation of lump or pulverulent fuel in readiness for delivery to combustion apparatus"}, {"symbol": "F23K 3/00", "text": "Feeding or distributing of lump or pulverulent fuel to combustion apparatus"}, {"symbol": "F23K 5/00", "text": "Feeding or distributing other fuel to combustion apparatus", "children": [{"symbol": "F23K 5/02", "text": "Liquid fuel"}]}]}, {"symbol": "F23L", "text": "AIR SUPPLY; DRAUGHT-INDUCING; SUPPLYING NON-COMBUSTIBLE LIQUID OR GAS", "children": [{"symbol": "F23L 1/00", "text": "Passages or apertures for delivering primary air for combustion"}, {"symbol": "F23L 3/00", "text": "Arrangements of valves or dampers before the fire"}, {"symbol": "F23L 5/00", "text": "Blast-producing apparatus before the fire"}, {"symbol": "F23L 7/00", "text": "Supplying non-combustible liquids or gases, other than air, to the fire, e.g. oxygen, steam"}, {"symbol": "F23L 9/00", "text": "Passages or apertures for delivering secondary air for completing combustion of fuel"}, {"symbol": "F23L 11/00", "text": "Arrangements of valves or dampers after the fire"}, {"symbol": "F23L 13/00", "text": "Construction of valves or dampers for controlling air supply or draught"}, {"symbol": "F23L 15/00", "text": "Heating of air supplied for combustion"}, {"symbol": "F23L 17/00", "text": "Inducing draught"}, {"symbol": "F23L 99/00", "text": "Subject matter not provided for in other groups of this subclass"}]}, {"symbol": "F23M", "text": "CONSTRUCTIONAL DETAILS OF COMBUSTION CHAMBERS, NOT OTHERWISE PROVIDED FOR", "children": [{"symbol": "F23M 3/00", "text": "Firebridges"}, {"symbol": "F23M 5/00", "text": "Casings; Linings; Walls"}, {"symbol": "F23M 7/00", "text": "Doors specially adapted for combustion chambers"}, {"symbol": "F23M 9/00", "text": "Baffles or deflectors for air or combustion products; Flame shields"}, {"symbol": "F23M 11/00", "text": "Safety arrangements"}, {"symbol": "F23M 13/00", "text": "Other details"}]}, {"symbol": "F23N", "text": "REGULATING OR CONTROLLING COMBUSTION", "children": [{"symbol": "F23N 1/00", "text": "Regulating fuel supply", "children": [{"symbol": "F23N 1/02", "text": "conjointly with air supply"}, {"symbol": "F23N 1/08", "text": "conjointly with another medium, e.g. boiler water"}]}, {"symbol": "F23N 3/00", "text": "Regulating air supply or draught"}, {"symbol": "F23N 5/00", "text": "Systems for controlling combustion", "children": [{"symbol": "F23N 5/02", "text": "using devices responsive to thermal changes or to thermal expansion of a medium", "children": [{"symbol": "F23N 5/08", "text": "using light-sensitive elements"}, {"symbol": "F23N 5/12", "text": "using ionisation-sensitive elements, i.e. flame rods"}, {"symbol": "F23N 5/14", "text": "using thermo-sensitive resistors"}]}, {"symbol": "F23N 5/16", "text": "using noise-sensitive detectors"}, {"symbol": "F23N 5/18", "text": "using detectors sensitive to rate of flow of air or fuel"}, {"symbol": "F23N 5/20", "text": "with a time programme acting through electrical means, e.g. using time-delay relays"}, {"symbol": "F23N 5/22", "text": "with a time programme acting through mechanical means, e.g. using cams"}, {"symbol": "F23N 5/24", "text": "Preventing development of abnormal or undesired conditions, i.e. safety arrangements (F23N 5/02 to F23N 5/18 take precedence)"}, {"symbol": "F23N 5/26", "text": "Details"}]}]}, {"symbol": "F23Q", "text": "IGNITION", "children": [{"symbol": "F23Q 1/00", "text": "Mechanical igniters"}, {"symbol": "F23Q 2/00", "text": "Lighters containing fuel, e.g. for cigarettes"}, {"symbol": "F23Q 3/00", "text": "Igniters using electrically-produced sparks"}, {"symbol": "F23Q 5/00", "text": "Make-and-break ignition, i.e. with spark generated between electrodes by breaking contact therebetween"}, {"symbol": "F23Q 7/00", "text": "Incandescent ignition; Igniters using electrically-produced heat, e.g. lighters for cigarettes"}, {"symbol": "F23Q 9/00", "text": "Pilot flame igniters"}, {"symbol": "F23Q 11/00", "text": "Arrangement of catalytic igniters"}, {"symbol": "F23Q 13/00", "text": "Igniters not otherwise provided for"}, {"symbol": "F23Q 21/00", "text": "Devices for effecting ignition from a remote location"}, {"symbol": "F23Q 23/00", "text": "Testing of ignition installations"}, {"symbol": "F23Q 25/00", "text": "Extinguishing devices, e.g. for blowing-out or snuffing candle flames"}]}, {"symbol": "F23R", "text": "GENERATING COMBUSTION PRODUCTS OF HIGH PRESSURE OR HIGH VELOCITY, e.g. GAS-TURBINE COMBUSTION CHAMBERS", "children": [{"symbol": "F23R 3/00", "text": "Continuous combustion chambers using liquid or gaseous fuel", "children": [{"symbol": "F23R 3/02", "text": "characterised by the air-flow or gas-flow configuration (reverse-flow combustion chambers F23R 3/00; cyclone or vortex type combustion chambers F23R 3/00)", "children": [{"symbol": "F23R 3/04", "text": "Air inlet arrangements"}]}, {"symbol": "F23R 3/28", "text": "characterised by the fuel supply (burners F23D)", "children": [{"symbol": "F23R 3/30", "text": "comprising fuel prevapourising devices"}, {"symbol": "F23R 3/34", "text": "Feeding into different combustion zones"}]}]}, {"symbol": "F23R 5/00", "text": "Continuous combustion chambers using solid or pulverulent fuel"}, {"symbol": "F23R 7/00", "text": "Intermittent or explosive combustion chambers"}]}]}, {"symbol": "F24", "text": "HEATING; RANGES; VENTILATING", "children": [{"symbol": "F24B", "text": "DOMESTIC STOVES OR RANGES FOR SOLID FUELS; IMPLEMENTS FOR USE IN CONNECTION WITH STOVES OR RANGES", "children": [{"symbol": "F24B 1/00", "text": "Stoves or ranges"}, {"symbol": "F24B 3/00", "text": "Heaters not covered by group F24B 1/00, e.g. charcoal brazier"}, {"symbol": "F24B 5/00", "text": "Combustion-air or flue-gas circulation in or around stoves or ranges"}, {"symbol": "F24B 7/00", "text": "Stoves, ranges, or flue-gas ducts, with additional provisions for convection heating"}, {"symbol": "F24B 9/00", "text": "Stoves, ranges, or flue-gas ducts, with additional provisions for heating water"}, {"symbol": "F24B 13/00", "text": "Details solely applicable to stoves or ranges burning solid fuels"}, {"symbol": "F24B 15/00", "text": "Implements for use in connection with stoves or ranges"}]}, {"symbol": "F24C", "text": "OTHER DOMESTIC STOVES OR RANGES; DETAILS OF DOMESTIC STOVES OR RANGES, OF GENERAL APPLICATION", "children": [{"symbol": "F24C 1/00", "text": "Stoves or ranges in which the fuel or energy supply is not restricted to solid fuel or to a type covered by a single one of groups F24C 3/00 to F24C 9/00; Stoves or ranges in which the type of fuel or energy supply is not specified"}, {"symbol": "F24C 3/00", "text": "Stoves or ranges for gaseous fuels", "children": [{"symbol": "F24C 3/08", "text": "Arrangement or mounting of burners (burners <u>per se</u>F23D)"}, {"symbol": "F24C 3/12", "text": "Arrangement or mounting of control or safety devices (control valves F16K; safety devices for burners F23D 14/72; regulating or controlling combustion F23N)"}]}, {"symbol": "F24C 5/00", "text": "Stoves or ranges for liquid fuels"}, {"symbol": "F24C 7/00", "text": "Stoves or ranges heated by electric energy", "children": [{"symbol": "F24C 7/02", "text": "using microwaves (heating using microwaves in general H05B 6/64)"}, {"symbol": "F24C 7/04", "text": "with heat radiated directly from the heating element (F24C 7/10 takes precedence)"}, {"symbol": "F24C 7/08", "text": "Arrangement or mounting of control or safety devices (switches H01H; circuit arrangements for electric heating H05B)"}, {"symbol": "F24C 7/10", "text": "with special adaptation for travelling, e.g. collapsible"}]}, {"symbol": "F24C 9/00", "text": "Stoves or ranges heated by a single type of energy supply not covered by groups F24C 3/00 to F24C 7/00 or subclass F24B"}, {"symbol": "F24C 11/00", "text": "Combinations of two or more stoves or ranges, e.g. each having a different kind of energy supply"}, {"symbol": "F24C 13/00", "text": "Stoves or ranges with additional provisions for heating water"}, {"symbol": "F24C 14/00", "text": "Stoves or ranges having self-cleaning provisions, e.g. continuous or catalytic cleaning, electrostatic cleaning"}, {"symbol": "F24C 15/00", "text": "Details", "children": [{"symbol": "F24C 15/02", "text": "Doors specially adapted for stoves or ranges (in general E06B; for combustion chambers F23M)"}, {"symbol": "F24C 15/08", "text": "Foundations or support plates; Legs or pillars; Casings; Wheels (F24C 15/10 takes precedence)"}, {"symbol": "F24C 15/10", "text": "Tops, e.g. hot plate; Rings (F24C 15/12, F24C 15/14 take precedence)"}, {"symbol": "F24C 15/12", "text": "Side rests; Side plates; Cover lids; Splash guards; Racks outside ovens, e.g. for drying plates"}, {"symbol": "F24C 15/14", "text": "Spillage trays or grooves"}, {"symbol": "F24C 15/16", "text": "Shelves, racks, or trays inside ovens; Supports therefor"}, {"symbol": "F24C 15/20", "text": "Removing cooking fumes (parts, details or accessories of cooking-vessels for withdrawing or condensing cooking vapours from such vessels A47J 36/00)"}, {"symbol": "F24C 15/32", "text": "Arrangements of ducts for hot gases, e.g. in or around baking ovens"}]}]}, {"symbol": "F24D", "text": "DOMESTIC- OR SPACE-HEATING SYSTEMS, e.g. CENTRAL HEATING SYSTEMS; DOMESTIC HOT-WATER SUPPLY SYSTEMS; ELEMENTS OR COMPONENTS THEREFOR", "children": [{"symbol": "F24D 1/00", "text": "Steam central heating systems"}, {"symbol": "F24D 3/00", "text": "Hot-water central heating systems", "children": [{"symbol": "F24D 3/10", "text": "Feed-line arrangements, e.g. providing for heat-accumulator tanks, expansion tanks"}, {"symbol": "F24D 3/12", "text": "Tube and panel arrangements for ceiling, wall, or underfloor heating (electric underfloor heating F24D 13/02; special adaptations of floors for incorporating ducts, e.g. for heating or ventilating, E04B 5/48; building elements of block or other shape for the construction of parts of buildings characterised by special adaptations, e.g. serving for locating conduits, E04C 1/00; building elements of relatively thin form for the construction of parts of buildings with special adaptations for auxiliary purposes, e.g. serving for locating conduits, E04C 2/52)"}]}, {"symbol": "F24D 5/00", "text": "Hot-air central heating systems"}, {"symbol": "F24D 7/00", "text": "Central heating systems employing heat-transfer fluids not covered by groups F24D 1/00 to F24D 5/00, e.g. oil, salt, gas"}, {"symbol": "F24D 9/00", "text": "Central heating systems employing combinations of heat-transfer fluids covered by two or more of groups F24D 1/00 to F24D 7/00"}, {"symbol": "F24D 10/00", "text": "District heating systems"}, {"symbol": "F24D 11/00", "text": "Central heating systems using heat accumulated in storage masses"}, {"symbol": "F24D 12/00", "text": "Other central heating systems"}, {"symbol": "F24D 13/00", "text": "Electric heating systems", "children": [{"symbol": "F24D 13/02", "text": "solely using resistance heating, e.g. underfloor heating"}]}, {"symbol": "F24D 15/00", "text": "Other domestic- or space-heating systems"}, {"symbol": "F24D 17/00", "text": "Domestic hot-water supply systems", "children": [{"symbol": "F24D 17/02", "text": "using heat pumps"}]}, {"symbol": "F24D 19/00", "text": "Details"}]}, {"symbol": "F24F", "text": "AIR-CONDITIONING; AIR-HUMIDIFICATION; VENTILATION; USE OF AIR CURRENTS FOR SCREENING", "children": [{"symbol": "F24F 1/00", "text": "Room units, e.g. receiving primary air from a central station", "children": [{"symbol": "F24F 1/01", "text": "in which secondary air is induced by injector action of the primary air (F24F 1/02 takes precedence)"}, {"symbol": "F24F 1/02", "text": "self-contained, i.e. with all apparatus for treatment installed in a common casing", "children": [{"symbol": "F24F 1/04", "text": "Arrangements for portability"}]}]}, {"symbol": "F24F 3/00", "text": "Air-conditioning systems in which conditioned primary air is supplied from one or more central stations to distributing units in the rooms or spaces where it may receive secondary treatment; Apparatus specially designed for such systems", "children": [{"symbol": "F24F 3/02", "text": "characterised by the pressure or velocity of the primary air (F24F 3/044 takes precedence)"}, {"symbol": "F24F 3/044", "text": "Systems in which all treatment is given in the central station, i.e. all-air systems"}, {"symbol": "F24F 3/06", "text": "characterised by the arrangements for the supply of heat-exchange fluid for the subsequent treatment of primary air in the room units (F24F 3/02 takes precedence)"}, {"symbol": "F24F 3/12", "text": "characterised by the treatment of the air otherwise than by heating and cooling (F24F 3/02, F24F 3/06 take precedence; apparatus for the individual treatment, <u>see</u> the appropriate subclasses for the treatments)", "children": [{"symbol": "F24F 3/16", "text": "by purification, e.g. by filtering; by sterilisation; by ozonisation"}]}]}, {"symbol": "F24F 5/00", "text": "Air-conditioning systems or apparatus not covered by group F24F 1/00 or F24F 3/00"}, {"symbol": "F24F 6/00", "text": "Air-humidification", "children": [{"symbol": "F24F 6/02", "text": "by evaporation of water in the air"}, {"symbol": "F24F 6/12", "text": "by forming water dispersions in the air"}, {"symbol": "F24F 6/18", "text": "by injection of steam into the air"}]}, {"symbol": "F24F 7/00", "text": "Ventilation", "children": [{"symbol": "F24F 7/007", "text": "with forced flow (using ducting systems F24F 7/06)", "children": [{"symbol": "F24F 7/013", "text": "using wall or window fans, displacing air through the wall or window"}]}, {"symbol": "F24F 7/02", "text": "Roof ventilation (F24F 7/007 takes precedence; ventilation of roof coverings E04D)"}, {"symbol": "F24F 7/04", "text": "with ducting systems", "children": [{"symbol": "F24F 7/06", "text": "with forced air circulation, e.g. by fan", "children": [{"symbol": "F24F 7/08", "text": "with separate ducts for supplied and exhausted air"}, {"symbol": "F24F 7/10", "text": "with air supply, or exhaust, through perforated wall, floor or ceiling (outlet members for directing or distributing air F24F 13/06)"}]}]}]}, {"symbol": "F24F 9/00", "text": "Use of air currents for screening, e.g. air curtain"}, {"symbol": "F24F 11/00", "text": "Control or safety systems or apparatus", "children": [{"symbol": "F24F 11/02", "text": "Arrangement or mounting of control or safety devices", "children": [{"symbol": "F24F 11/04", "text": "solely for controlling the rate of air-flow (F24F 11/08 takes precedence)"}, {"symbol": "F24F 11/06", "text": "solely for controlling the supply of heating or cooling fluids for secondary treatment (F24F 11/08 takes precedence)"}, {"symbol": "F24F 11/08", "text": "for controlling the primary treatment of air"}]}]}, {"symbol": "F24F 12/00", "text": "Use of energy recovery systems in air conditioning, ventilation or screening"}, {"symbol": "F24F 13/00", "text": "Details common to, or for air-conditioning, air-humidification, ventilation or use of air currents for screening", "children": [{"symbol": "F24F 13/02", "text": "Ducting arrangements", "children": [{"symbol": "F24F 13/04", "text": "Air-mixing units (F24F 13/06 takes precedence; mixing gases in general B01F 3/00)"}, {"symbol": "F24F 13/06", "text": "Outlets for directing or distributing air into rooms or spaces, e.g. ceiling air diffuser"}]}, {"symbol": "F24F 13/08", "text": "Air-flow control members, e.g. louvres, grilles, flaps, guide plates (F24F 7/013, F24F 13/06 take precedence; roof ventilation F24F 7/02)", "children": [{"symbol": "F24F 13/10", "text": "movable, e.g. damper (F24F 13/18 takes precedence; valves in general F16K)", "children": [{"symbol": "F24F 13/14", "text": "built-up of tilting members, e.g. louvre", "children": [{"symbol": "F24F 13/15", "text": "with parallel simultaneously tiltable lamellae"}]}]}, {"symbol": "F24F 13/18", "text": "specially adapted for insertion in flat panels, e.g. in door or window-pane"}]}, {"symbol": "F24F 13/32", "text": "Supports for air-conditioning, air-humidification or ventilation units"}]}]}, {"symbol": "F24H", "text": "FLUID HEATERS, e.g. WATER OR AIR HEATERS, HAVING HEAT-GENERATING MEANS, IN GENERAL", "children": [{"symbol": "F24H 1/00", "text": "Water heaters having heat generating means, e.g. boiler, flow-heater, water-storage heater", "children": [{"symbol": "F24H 1/06", "text": "Portable or mobile, e.g. collapsible"}, {"symbol": "F24H 1/08", "text": "Packaged or self-contained boilers, i.e. water heaters with control devices and pump in a single unit"}, {"symbol": "F24H 1/10", "text": "Continuous-flow heaters, i.e. heaters in which heat is generated only while the water is flowing, e.g. with direct contact of the water with the heating medium (F24H 1/48 takes precedence)", "children": [{"symbol": "F24H 1/12", "text": "in which the water is kept separate from the heating medium"}]}, {"symbol": "F24H 1/18", "text": "Water-storage heaters (F24H 1/48 takes precedence; combined with water-heating stoves for central heating F24H 1/22)", "children": [{"symbol": "F24H 1/20", "text": "with immersed heating elements, e.g. electric elements or furnace tubes"}]}, {"symbol": "F24H 1/22", "text": "Water heaters other than continuous-flow or water-storage heaters, e.g. water heaters for central heating (F24H 1/48 takes precedence)"}, {"symbol": "F24H 1/46", "text": "Water heaters having plural combustion chambers"}, {"symbol": "F24H 1/48", "text": "Water heaters for central heating incorporating heaters for domestic water"}]}, {"symbol": "F24H 3/00", "text": "Air heaters having heat generating means", "children": [{"symbol": "F24H 3/02", "text": "with forced circulation (F24H 3/12 takes precedence)", "children": [{"symbol": "F24H 3/04", "text": "the air being in direct contact with the heating medium, e.g. electric heating element"}]}, {"symbol": "F24H 3/12", "text": "with additional heating arrangements"}]}, {"symbol": "F24H 4/00", "text": "Fluid heaters using heat pumps"}, {"symbol": "F24H 6/00", "text": "Combined water and air heaters"}, {"symbol": "F24H 7/00", "text": "Storage heaters, i.e. heaters in which the energy is stored as heat in masses for subsequent release"}, {"symbol": "F24H 8/00", "text": "Fluid heaters having heat-generating means specially adapted for extracting latent heat from flue gases by means of condensation"}, {"symbol": "F24H 9/00", "text": "Details", "children": [{"symbol": "F24H 9/02", "text": "Casings; Cover lids; Ornamental panels"}, {"symbol": "F24H 9/06", "text": "Arrangement of mountings or supports"}, {"symbol": "F24H 9/12", "text": "Connecting heaters to circulation pipes (pipe joints in general F16L)"}, {"symbol": "F24H 9/14", "text": "Connecting different sections, e.g. in water heaters (in radiators F28F 9/26)"}, {"symbol": "F24H 9/16", "text": "Arrangements for water drainage (valves for drainage F16K, e.g. F16K 21/00; in pipes or pipe systems in general F16L 55/00; in domestic-or space-heating systems F24D 19/00)"}, {"symbol": "F24H 9/18", "text": "Arrangement or mounting of grates, burners, or heating elements (burners F23D; grates F23H; electric heating elements H05B)"}, {"symbol": "F24H 9/20", "text": "Arrangement or mounting of control or safety devices (control valves F16K; safety devices for burners F23D; combustion control devices F23N; of systems comprising a heater, <u>see</u> the relevant subclasses, e.g. of control heating systems F24D 19/00; automatic switching for electric heating apparatus H05B 1/02)"}]}]}, {"symbol": "F24J", "text": "PRODUCTION OR USE OF HEAT NOT OTHERWISE PROVIDED FOR", "children": [{"symbol": "F24J 1/00", "text": "Apparatus or devices using heat produced by exothermal chemical reactions other than by combustion"}, {"symbol": "F24J 2/00", "text": "Use of solar heat, e.g. solar heat collectors", "children": [{"symbol": "F24J 2/02", "text": "Solar heat collectors with support for article heated, e.g. stoves, ranges, crucibles, furnaces or ovens using solar heat"}, {"symbol": "F24J 2/04", "text": "Solar heat collectors having working fluid conveyed through collector", "children": [{"symbol": "F24J 2/06", "text": "having concentrating elements (optical elements or systems <u>per se</u>G02B)"}]}, {"symbol": "F24J 2/36", "text": "Rollable or foldable collector units"}, {"symbol": "F24J 2/38", "text": "employing tracking means (F24J 2/02, F24J 2/06 take precedence; rotary supports or mountings therefor F24J 2/00; direction-finders for determining the direction from which electromagnetic waves are being received G01S 3/78; control of position or direction G05D 3/00)"}, {"symbol": "F24J 2/40", "text": "Control arrangements"}, {"symbol": "F24J 2/42", "text": "Solar heat systems not otherwise provided for"}]}, {"symbol": "F24J 3/00", "text": "Other production or use of heat, not derived from combustion"}]}]}, {"symbol": "F25", "text": "REFRIGERATION OR COOLING; COMBINED HEATING AND REFRIGERATION SYSTEMS; HEAT PUMP SYSTEMS; MANUFACTURE OR STORAGE OF ICE; LIQUEFACTION OR SOLIDIFICATION OF GASES", "children": [{"symbol": "F25B", "text": "REFRIGERATION MACHINES, PLANTS, OR SYSTEMS; COMBINED HEATING AND REFRIGERATION SYSTEMS; HEAT PUMP SYSTEMS", "children": [{"symbol": "F25B 1/00", "text": "Compression machines, plant or systems with non-reversible cycle", "children": [{"symbol": "F25B 1/02", "text": "with compressor of reciprocating-piston type (F25B 1/10 takes precedence)"}, {"symbol": "F25B 1/04", "text": "with compressor of rotary type (F25B 1/10 takes precedence)"}, {"symbol": "F25B 1/06", "text": "with compressor of jet type, e.g. using liquid under pressure (F25B 1/10 takes precedence)"}, {"symbol": "F25B 1/10", "text": "with multi-stage compression (with cascade operation F25B 7/00)"}]}, {"symbol": "F25B 3/00", "text": "Self-contained rotary compression machines, i.e. with compressor, condenser, and evaporator rotating as a single unit"}, {"symbol": "F25B 5/00", "text": "Compression machines, plant, or systems, with several evaporator circuits, e.g. for varying refrigerating capacity"}, {"symbol": "F25B 6/00", "text": "Compression machines, plant, or systems, with several condenser circuits"}, {"symbol": "F25B 7/00", "text": "Compression machines, plant, or systems, with cascade operation, i.e. with two or more circuits, the heat from the condenser of one circuit being absorbed by the evaporator of the next circuit"}, {"symbol": "F25B 9/00", "text": "Compression machines, plant, or systems, in which the refrigerant is air or other gas of low boiling point", "children": [{"symbol": "F25B 9/02", "text": "using Joule-Thompson effect; using vortex effect"}, {"symbol": "F25B 9/06", "text": "using expanders (F25B 9/10 takes precedence)"}, {"symbol": "F25B 9/08", "text": "using ejectors (F25B 9/10 takes precedence)"}, {"symbol": "F25B 9/10", "text": "with several cooling stages"}, {"symbol": "F25B 9/12", "text": "using <sup>3</sup>He-<sup>4</sup>He dilution"}, {"symbol": "F25B 9/14", "text": "characterised by the cycle used, e.g. Stirling cycle"}]}, {"symbol": "F25B 11/00", "text": "Compression machines, plant, or systems, using turbines, e.g. gas turbines", "children": [{"symbol": "F25B 11/02", "text": "as expanders (F25B 9/06 takes precedence)"}]}, {"symbol": "F25B 13/00", "text": "Compression machines, plant, or systems, with reversible cycle"}, {"symbol": "F25B 15/00", "text": "Sorption machines, plant, or systems, operating continuously, e.g. absorption type", "children": [{"symbol": "F25B 15/02", "text": "without inert gas (F25B 15/12, F25B 15/14, F25B 15/16 take precedence)"}, {"symbol": "F25B 15/10", "text": "with inert gas (F25B 15/12, F25B 15/14, F25B 15/16 take precedence)"}, {"symbol": "F25B 15/12", "text": "with resorber (F25B 15/14 takes precedence)"}, {"symbol": "F25B 15/14", "text": "using osmosis"}, {"symbol": "F25B 15/16", "text": "using desorption cycle"}]}, {"symbol": "F25B 17/00", "text": "Sorption machines, plant, or systems, operating intermittently, e.g. absorption or adsorption type"}, {"symbol": "F25B 19/00", "text": "Machines, plant, or systems, using evaporation of a refrigerant but without recovery of the vapour"}, {"symbol": "F25B 21/00", "text": "Machines, plant, or systems, using electric or magnetic effects", "children": [{"symbol": "F25B 21/02", "text": "using Peltier effect; using Nernst-Ettinghausen effect (thermoelectric elements H01L 35/00, H01L 37/00)"}]}, {"symbol": "F25B 23/00", "text": "Machines, plant, or systems, with a single mode of operation not covered by groups F25B 1/00 to F25B 21/00, e.g. using selective radiation effect"}, {"symbol": "F25B 25/00", "text": "Machines, plant, or systems, using a combination of modes of operation covered by two or more of the groups F25B 1/00 to F25B 23/00"}, {"symbol": "F25B 27/00", "text": "Machines, plant, or systems, using particular sources of energy", "children": [{"symbol": "F25B 27/02", "text": "using waste heat, e.g. from internal-combustion engines"}]}, {"symbol": "F25B 29/00", "text": "Combined heating and refrigeration systems, e.g. operating alternately or simultaneously"}, {"symbol": "F25B 30/00", "text": "Heat pumps"}, {"symbol": "F25B 31/00", "text": "Compressor arrangements"}, {"symbol": "F25B 33/00", "text": "Boilers; Analysers; Rectifiers"}, {"symbol": "F25B 35/00", "text": "Boiler-absorbers, i.e. boilers usable for absorption or adsorption"}, {"symbol": "F25B 37/00", "text": "Absorbers; Adsorbers"}, {"symbol": "F25B 39/00", "text": "Evaporators; Condensers", "children": [{"symbol": "F25B 39/02", "text": "Evaporators"}, {"symbol": "F25B 39/04", "text": "Condensers"}]}, {"symbol": "F25B 40/00", "text": "Subcoolers, desuperheaters or superheaters"}, {"symbol": "F25B 41/00", "text": "Fluid-circulation arrangements, e.g. for transferring liquid from evaporator to boiler", "children": [{"symbol": "F25B 41/04", "text": "Disposition of valves (valves <u>per se</u>F16K)"}, {"symbol": "F25B 41/06", "text": "Flow restrictors, e.g. capillary tubes; Disposition thereof"}]}, {"symbol": "F25B 43/00", "text": "Arrangements for separating or purifying gases or liquids", "children": [{"symbol": "F25B 43/02", "text": "for separating lubricants from the refrigerant"}, {"symbol": "F25B 43/04", "text": "for withdrawing non-condensible gases"}]}, {"symbol": "F25B 45/00", "text": "Arrangements for charging or discharging refrigerant"}, {"symbol": "F25B 47/00", "text": "Arrangements for preventing or removing deposits or corrosion, not provided for in another subclass", "children": [{"symbol": "F25B 47/02", "text": "Defrosting cycles"}]}, {"symbol": "F25B 49/00", "text": "Arrangement or mounting of control or safety devices", "children": [{"symbol": "F25B 49/02", "text": "for compression type machines, plant or systems"}]}]}, {"symbol": "F25C", "text": "PRODUCTION, WORKING, STORING, OR DISTRIBUTION OF ICE", "children": [{"symbol": "F25C 1/00", "text": "Production of ice", "children": [{"symbol": "F25C 1/04", "text": "by using stationary moulds"}, {"symbol": "F25C 1/08", "text": "by immersing freezing chambers or plates into water"}, {"symbol": "F25C 1/10", "text": "by using rotating or otherwise moving moulds (F25C 1/08 takes precedence)"}, {"symbol": "F25C 1/12", "text": "by freezing water on cooled surfaces, e.g. to form slabs"}, {"symbol": "F25C 1/18", "text": "of a particular transparency or translucency, e.g. by injecting air"}, {"symbol": "F25C 1/22", "text": "Construction of moulds; Filling devices therefor (metering by volume in general G01F)"}]}, {"symbol": "F25C 3/00", "text": "Production of ice or snow for the purposes specified in the subgroups of this group"}, {"symbol": "F25C 5/00", "text": "Working or distributing ice"}]}, {"symbol": "F25D", "text": "REFRIGERATORS; COLD ROOMS; ICE-BOXES; COOLING OR FREEZING APPARATUS NOT COVERED BY ANY OTHER SUBCLASS", "children": [{"symbol": "F25D 1/00", "text": "Devices using naturally-cold air or water"}, {"symbol": "F25D 3/00", "text": "Devices using other cold materials; Devices using cold-storage bodies", "children": [{"symbol": "F25D 3/10", "text": "using liquefied gases, e.g. liquid air"}]}, {"symbol": "F25D 5/00", "text": "Devices using endothermic chemical reactions, e.g. using frigorific mixtures"}, {"symbol": "F25D 7/00", "text": "Devices using evaporation effects without recovery of the vapour"}, {"symbol": "F25D 9/00", "text": "Devices not covered by groups F25D 1/00 to F25D 7/00; Combinations of devices covered by two or more of the groups F25D 1/00 to F25D 7/00"}, {"symbol": "F25D 11/00", "text": "Self-contained movable devices, e.g. domestic refrigerator", "children": [{"symbol": "F25D 11/02", "text": "with cooling compartments at different temperatures"}, {"symbol": "F25D 11/04", "text": "specially adapted for storing deep-frozen articles (F25D 11/02 takes precedence)"}]}, {"symbol": "F25D 13/00", "text": "Stationary devices, e.g. cold rooms"}, {"symbol": "F25D 15/00", "text": "Devices not covered by group F25D 11/00 or F25D 13/00, e.g. non-self-contained movable devices"}, {"symbol": "F25D 16/00", "text": "Devices using a combination of a cooling mode associated with refrigerating machinery with a cooling mode not associated with refrigerating machinery"}, {"symbol": "F25D 17/00", "text": "Arrangements for circulating cooling fluids; Arrangements for circulating gas, e.g. air, within refrigerated spaces", "children": [{"symbol": "F25D 17/04", "text": "for circulating gas, e.g. by natural convection", "children": [{"symbol": "F25D 17/06", "text": "by forced circulation", "children": [{"symbol": "F25D 17/08", "text": "using ducts"}]}]}]}, {"symbol": "F25D 19/00", "text": "Arrangement or mounting of refrigeration units with respect to devices", "children": [{"symbol": "F25D 19/02", "text": "plug-in type"}, {"symbol": "F25D 19/04", "text": "with more than one refrigeration unit"}]}, {"symbol": "F25D 21/00", "text": "Defrosting; Preventing frosting; Removing condensed or defrost water", "children": [{"symbol": "F25D 21/06", "text": "Removing frost (defrosting cycles F25B 47/02)", "children": [{"symbol": "F25D 21/08", "text": "by electric heating"}]}, {"symbol": "F25D 21/14", "text": "Collecting or removing condensed and defrost water; Drip trays"}]}, {"symbol": "F25D 23/00", "text": "General constructional features", "children": [{"symbol": "F25D 23/02", "text": "Doors; Covers (F25D 23/08 takes precedence)", "children": [{"symbol": "F25D 23/04", "text": "with special compartments, e.g. butter conditioners"}]}, {"symbol": "F25D 23/06", "text": "Walls (F25D 23/08 takes precedence; containers with thermal insulation B65D 81/38)"}, {"symbol": "F25D 23/08", "text": "Parts formed wholly or mainly of plastics materials"}, {"symbol": "F25D 23/10", "text": "Arrangements for mounting in particular locations, e.g. for built-in type, for corner type"}, {"symbol": "F25D 23/12", "text": "Arrangements of compartments additional to cooling compartments; Combinations of refrigerators with other equipment, e.g. stove"}]}, {"symbol": "F25D 25/00", "text": "Charging, supporting, or discharging the articles to be cooled", "children": [{"symbol": "F25D 25/02", "text": "by shelves"}]}, {"symbol": "F25D 27/00", "text": "Lighting arrangements"}, {"symbol": "F25D 29/00", "text": "Arrangement or mounting of control or safety devices"}, {"symbol": "F25D 31/00", "text": "Other cooling or freezing apparatus"}]}, {"symbol": "F25J", "text": "LIQUEFACTION, SOLIDIFICATION, OR SEPARATION OF GASES OR GASEOUS MIXTURES BY PRESSURE AND COLD TREATMENT", "children": [{"symbol": "F25J 1/00", "text": "Processes or apparatus for liquefying or solidifying gases or gaseous mixtures"}, {"symbol": "F25J 3/00", "text": "Processes or apparatus for separating the constituents of gaseous mixtures involving the use of liquefaction or solidification", "children": [{"symbol": "F25J 3/02", "text": "by rectification, i.e. by continuous interchange of heat and material between a vapour stream and a liquid stream (F25J 3/08 takes precedence)", "children": [{"symbol": "F25J 3/04", "text": "for air"}]}, {"symbol": "F25J 3/06", "text": "by partial condensation (F25J 3/08 takes precedence; by rectification F25J 3/02)"}, {"symbol": "F25J 3/08", "text": "Separating gaseous impurities from gases or gaseous mixtures (cold traps B01D 8/00)"}]}, {"symbol": "F25J 5/00", "text": "Arrangements of cold-exchangers or cold-accumulators in separation or liquefaction plants"}]}]}, {"symbol": "F26", "text": "DRYING", "children": [{"symbol": "F26B", "text": "DRYING SOLID MATERIALS OR OBJECTS BY REMOVING LIQUID THEREFROM", "children": [{"symbol": "F26B 1/00", "text": "Preliminary treatment of solid materials or objects to facilitate drying"}, {"symbol": "F26B 3/00", "text": "Drying solid materials or objects by processes involving the application of heat", "children": [{"symbol": "F26B 3/02", "text": "by convection, i.e. heat being conveyed from a heat source to the materials or objects to be dried by a gas or vapour, e.g. air"}, {"symbol": "F26B 3/32", "text": "by development of heat within the materials or objects to be dried (by using ultrasonic vibration F26B 5/00)"}]}, {"symbol": "F26B 5/00", "text": "Drying solid materials or objects by processes not involving the application of heat", "children": [{"symbol": "F26B 5/04", "text": "by evaporation or sublimation of moisture under reduced pressure, e.g. in a vacuum"}]}, {"symbol": "F26B 7/00", "text": "Drying solid materials or objects by processes using a combination of processes not covered by a single one of groups F26B 3/00 or F26B 5/00"}, {"symbol": "F26B 9/00", "text": "Machines or apparatus for drying solid materials or objects at rest or with only local agitation; Domestic airing cupboards", "children": [{"symbol": "F26B 9/06", "text": "in stationary drums or chambers"}]}, {"symbol": "F26B 11/00", "text": "Machines or apparatus for drying solid materials or objects with movement which is non-progressive"}, {"symbol": "F26B 13/00", "text": "Machines or apparatus for drying fabrics, fibres, yarns, or other materials in long lengths, with progressive movement", "children": [{"symbol": "F26B 13/10", "text": "Arrangements for feeding, heating, or supporting materials; Regulating movement, tension, or position of materials (heating processes F26B 3/00)"}]}, {"symbol": "F26B 15/00", "text": "Machines or apparatus for drying objects with progressive movement; Machines or apparatus with progressive movement for drying batches of material in compact form"}, {"symbol": "F26B 17/00", "text": "Machines or apparatus for drying materials in loose, plastic, or fluidised form, e.g. granules, staple fibres, with progressive movement", "children": [{"symbol": "F26B 17/12", "text": "with movement performed solely by gravity"}]}, {"symbol": "F26B 19/00", "text": "Machines or apparatus for drying solid materials or objects not covered by groups F26B 9/00 to F26B 17/00"}, {"symbol": "F26B 20/00", "text": "Combinations of machines or apparatus covered by two or more of groups F26B 9/00 to F26B 19/00"}, {"symbol": "F26B 21/00", "text": "Arrangements for supplying or controlling air or gases for drying solid materials or objects", "children": [{"symbol": "F26B 21/02", "text": "Circulating air or gases in closed cycles, e.g. wholly within the drying enclosure (F26B 21/14 takes precedence)"}, {"symbol": "F26B 21/06", "text": "Controlling, e.g. regulating, parameters of gas supply (F26B 21/14 takes precedence)"}, {"symbol": "F26B 21/14", "text": "using gases or vapours other than air or steam"}]}, {"symbol": "F26B 23/00", "text": "Heating arrangements"}, {"symbol": "F26B 25/00", "text": "Details of general application not covered by group F26B 21/00 or F26B 23/00", "children": [{"symbol": "F26B 25/06", "text": "Chambers, containers, or receptacles"}, {"symbol": "F26B 25/22", "text": "Controlling the drying process in dependence on liquid content of solid materials or objects"}]}]}]}, {"symbol": "F27", "text": "FURNACES; KILNS; OVENS; RETORTS", "children": [{"symbol": "F27B", "text": "FURNACES, KILNS, OVENS, OR RETORTS IN GENERAL; OPEN SINTERING OR LIKE APPARATUS", "children": [{"symbol": "F27B 1/00", "text": "Shaft or like vertical or substantially vertical furnaces"}, {"symbol": "F27B 3/00", "text": "Hearth-type furnaces, e.g. of reverberatory type", "children": [{"symbol": "F27B 3/08", "text": "heated electrically, e.g. electric arc furnaces, with or without any other source of heat"}, {"symbol": "F27B 3/10", "text": "Details, accessories, or equipment, e.g. dust-collectors, peculiar to hearth-type furnaces", "children": [{"symbol": "F27B 3/20", "text": "Arrangements of heating devices"}]}]}, {"symbol": "F27B 5/00", "text": "Muffle furnaces; Retort furnaces; Other furnaces in which the charge is held completely isolated"}, {"symbol": "F27B 7/00", "text": "Rotary-drum furnaces, i.e. horizontal or slightly inclined", "children": [{"symbol": "F27B 7/20", "text": "Details, accessories, or equipment peculiar to rotary-drum furnaces"}]}, {"symbol": "F27B 9/00", "text": "Furnaces through which the charge is moved mechanically, e.g. of tunnel type", "children": [{"symbol": "F27B 9/30", "text": "Details, accessories, or equipment peculiar to furnaces of these types"}]}, {"symbol": "F27B 11/00", "text": "Bell-type furnaces"}, {"symbol": "F27B 13/00", "text": "Furnaces with both stationary charge and progression of heating, e.g. of ring type, of type in which segmental kiln moves over stationary charge"}, {"symbol": "F27B 14/00", "text": "Crucible or pot furnaces; Tank furnaces"}, {"symbol": "F27B 15/00", "text": "Fluidised-bed furnaces; Other furnaces using or treating finely-divided materials in dispersion"}, {"symbol": "F27B 17/00", "text": "Furnaces of a kind not covered by any of groups F27B 1/00 to F27B 15/00"}, {"symbol": "F27B 19/00", "text": "Combinations of furnaces of kinds not covered by any single one of main groups F27B 1/00 to F27B 17/00"}, {"symbol": "F27B 21/00", "text": "Open or uncovered sintering apparatus; Other heat-treatment apparatus of like construction"}]}, {"symbol": "F27D", "text": "DETAILS OR ACCESSORIES OF FURNACES, KILNS, OVENS, OR RETORTS, IN SO FAR AS THEY ARE OF KINDS OCCURRING IN MORE THAN ONE KIND OF FURNACE", "children": [{"symbol": "F27D 1/00", "text": "Casings; Linings; Walls; Roofs", "children": [{"symbol": "F27D 1/02", "text": "Crowns; Roofs"}, {"symbol": "F27D 1/04", "text": "characterised by the form of the bricks or blocks used"}, {"symbol": "F27D 1/10", "text": "Monolithic linings; Supports therefor"}, {"symbol": "F27D 1/12", "text": "incorporating cooling arrangements (constructions of tube assemblies in general F28)"}, {"symbol": "F27D 1/14", "text": "Supports for linings (F27D 1/10 takes precedence)"}, {"symbol": "F27D 1/16", "text": "Making or repairing linings"}, {"symbol": "F27D 1/18", "text": "Door frames; Doors, lids, removable covers"}]}, {"symbol": "F27D 3/00", "text": "Charging; Discharging; Manipulation of charge", "children": [{"symbol": "F27D 3/12", "text": "Travelling or movable supports or containers for the charge"}, {"symbol": "F27D 3/14", "text": "Charging or discharging liquid or molten material"}]}, {"symbol": "F27D 5/00", "text": "Supports, screens, or the like for the charge within the furnace"}, {"symbol": "F27D 7/00", "text": "Forming, maintaining, or circulating atmospheres in heating chambers"}, {"symbol": "F27D 9/00", "text": "Cooling of furnaces or of charges therein"}, {"symbol": "F27D 11/00", "text": "Arrangement of elements for electric heating in or on furnaces", "children": [{"symbol": "F27D 11/08", "text": "Heating by electric discharge, e.g. arc discharge"}]}, {"symbol": "F27D 13/00", "text": "Apparatus for preheating charges; Arrangements for preheating charges"}, {"symbol": "F27D 15/00", "text": "Handling or treating discharged material; Supports or receiving chambers therefor"}, {"symbol": "F27D 17/00", "text": "Arrangement for using waste heat"}, {"symbol": "F27D 19/00", "text": "Arrangement of controlling devices"}, {"symbol": "F27D 21/00", "text": "Arrangement of monitoring devices; Arrangements of safety devices"}, {"symbol": "F27D 23/00", "text": "Details or accessories not covered by any other group of this subclass"}]}]}, {"symbol": "F28", "text": "HEAT EXCHANGE IN GENERAL", "children": [{"symbol": "F28B", "text": "STEAM OR VAPOUR CONDENSERS", "children": [{"symbol": "F28B 1/00", "text": "Condensers in which the steam or vapour is separated from the cooling medium by walls, e.g. surface condenser"}, {"symbol": "F28B 3/00", "text": "Condensers in which the steam or vapour comes into direct contact with the cooling medium"}, {"symbol": "F28B 5/00", "text": "Condensers employing a combination of the methods covered by groups F28B 1/00 and F28B 3/00; Other condensers"}, {"symbol": "F28B 7/00", "text": "Combinations of two or more condensers, e.g. provision of reserve condenser"}, {"symbol": "F28B 9/00", "text": "Auxiliary systems, arrangements, or devices"}, {"symbol": "F28B 11/00", "text": "Controlling arrangements with features specially adapted for condensers"}]}, {"symbol": "F28C", "text": "HEAT-EXCHANGE APPARATUS, NOT PROVIDED FOR IN ANOTHER SUBCLASS, IN WHICH THE HEAT-EXCHANGE MEDIA COME INTO DIRECT CONTACT WITHOUT CHEMICAL INTERACTION", "children": [{"symbol": "F28C 1/00", "text": "Direct-contact trickle coolers, e.g. cooling towers"}, {"symbol": "F28C 3/00", "text": "Other direct-contact heat-exchange apparatus"}]}, {"symbol": "F28D", "text": "HEAT-EXCHANGE APPARATUS, NOT PROVIDED FOR IN ANOTHER SUBCLASS, IN WHICH THE HEAT-EXCHANGE MEDIA DO NOT COME INTO DIRECT CONTACT", "children": [{"symbol": "F28D 1/00", "text": "Heat-exchange apparatus having stationary conduit assemblies for one heat-exchange medium only, the media being in contact with different sides of the conduit wall, in which the other heat-exchange medium is a large body of fluid, e.g. domestic or motor car radiators", "children": [{"symbol": "F28D 1/02", "text": "with the heat-exchange conduits immersed in the body of fluid", "children": [{"symbol": "F28D 1/04", "text": "with tubular conduits"}]}]}, {"symbol": "F28D 3/00", "text": "Heat-exchange apparatus having stationary conduit assemblies for one heat-exchange medium only, the media being in contact with different sides of the conduit wall, in which the other heat-exchange medium flows in a continuous film, or trickles freely, over the conduits"}, {"symbol": "F28D 5/00", "text": "Heat-exchange apparatus having stationary conduit assemblies for one heat-exchange medium only, the media being in contact with different sides of the conduit wall, using the cooling effect of natural or forced evaporation"}, {"symbol": "F28D 7/00", "text": "Heat-exchange apparatus having stationary tubular conduit assemblies for both heat-exchange media, the media being in contact with different sides of a conduit wall", "children": [{"symbol": "F28D 7/10", "text": "the conduits being arranged one within the other, e.g. concentrically"}]}, {"symbol": "F28D 9/00", "text": "Heat-exchange apparatus having stationary plate-like or laminated conduit assemblies for both heat-exchange media, the media being in contact with different sides of a conduit wall"}, {"symbol": "F28D 11/00", "text": "Heat-exchange apparatus employing moving conduits"}, {"symbol": "F28D 13/00", "text": "Heat-exchange apparatus using a fluidised bed"}, {"symbol": "F28D 15/00", "text": "Heat-exchange apparatus with the intermediate heat-transfer medium in closed tubes passing into or through the conduit walls", "children": [{"symbol": "F28D 15/02", "text": "in which the medium condenses and evaporates, e.g. heat-pipes", "children": [{"symbol": "F28D 15/04", "text": "with tubes having a capillary structure"}, {"symbol": "F28D 15/06", "text": "Control arrangements therefor"}]}]}, {"symbol": "F28D 17/00", "text": "Regenerative heat-exchange apparatus in which a stationary intermediate heat-transfer medium or body is contacted successively by each heat-exchange medium, e.g. using granular particles"}, {"symbol": "F28D 19/00", "text": "Regenerative heat-exchange apparatus in which the intermediate heat-transfer medium or body is moved successively into contact with each heat-exchange medium"}, {"symbol": "F28D 20/00", "text": "Heat storage plants or apparatus in general", "children": [{"symbol": "F28D 20/02", "text": "using latent heat"}]}, {"symbol": "F28D 21/00", "text": "Heat-exchange apparatus not covered by any of the groups F28D 1/00 to F28D 20/00"}]}, {"symbol": "F28F", "text": "DETAILS OF HEAT-EXCHANGE OR HEAT-TRANSFER APPARATUS, OF GENERAL APPLICATION", "children": [{"symbol": "F28F 1/00", "text": "Tubular elements; Assemblies of tubular elements", "children": [{"symbol": "F28F 1/02", "text": "Tubular elements of cross-section which is non-circular (F28F 1/08, F28F 1/10 take precedence)", "children": [{"symbol": "F28F 1/06", "text": "crimped or corrugated in cross-section"}]}, {"symbol": "F28F 1/08", "text": "Tubular elements crimped or corrugated in longitudinal section"}, {"symbol": "F28F 1/10", "text": "Tubular elements or assemblies thereof with means for increasing heat-transfer area, e.g. with fins, with projections, with recesses (crimped or corrugated elements F28F 1/06, F28F 1/08)", "children": [{"symbol": "F28F 1/12", "text": "the means being only outside the tubular element", "children": [{"symbol": "F28F 1/24", "text": "and extending transversely (F28F 1/38 takes precedence)", "children": [{"symbol": "F28F 1/32", "text": "the means having portions engaging further tubular elements"}]}, {"symbol": "F28F 1/38", "text": "and being staggered to form tortuous fluid passages"}]}]}]}, {"symbol": "F28F 3/00", "text": "Plate-like or laminated elements; Assemblies of plate-like or laminated elements", "children": [{"symbol": "F28F 3/08", "text": "Elements constructed for building-up into stacks, e.g. capable of being taken apart for cleaning"}]}, {"symbol": "F28F 5/00", "text": "Elements specially adapted for movement"}, {"symbol": "F28F 7/00", "text": "Elements not covered by group F28F 1/00, F28F 3/00, or F28F 5/00"}, {"symbol": "F28F 9/00", "text": "Casings; Header boxes; Auxiliary supports for elements; Auxiliary members within casings", "children": [{"symbol": "F28F 9/007", "text": "Auxiliary supports for elements"}, {"symbol": "F28F 9/02", "text": "Header boxes; End plates", "children": [{"symbol": "F28F 9/04", "text": "Arrangements for sealing elements into header boxes or end plates (joining pipes to walls in general F16L 41/00)"}]}, {"symbol": "F28F 9/22", "text": "Arrangements for directing heat-exchange media into successive compartments, e.g. arrangements of guide plates"}, {"symbol": "F28F 9/26", "text": "Arrangements for connecting different sections of heat-exchange elements, e.g. of radiators (connecting different sections in water heaters F24H 9/14)"}]}, {"symbol": "F28F 11/00", "text": "Arrangements for sealing leaky tubes or conduits"}, {"symbol": "F28F 13/00", "text": "Arrangements for modifying heat transfer, e.g. increasing, decreasing"}, {"symbol": "F28F 17/00", "text": "Removing ice or water from heat-exchange apparatus"}, {"symbol": "F28F 19/00", "text": "Preventing the formation of deposits or corrosion, e.g. by using filters"}, {"symbol": "F28F 21/00", "text": "Constructions of heat-exchange apparatus characterised by the selection of particular materials"}, {"symbol": "F28F 23/00", "text": "Features relating to the use of intermediate heat-exchange materials, e.g. selection of compositions"}, {"symbol": "F28F 25/00", "text": "Component parts of trickle coolers"}, {"symbol": "F28F 27/00", "text": "Control arrangements specially adapted for heat-exchange or heat-transfer apparatus"}, {"symbol": "F28F 99/00", "text": "Subject matter not provided for in other groups of this subclass"}]}, {"symbol": "F28G", "text": "CLEANING OF INTERNAL OR EXTERNAL SURFACES OF HEAT-EXCHANGE OR HEAT-TRANSFER CONDUITS, e.g. WATER TUBES OF BOILERS", "children": [{"symbol": "F28G 1/00", "text": "Non-rotary, e.g. reciprocated, appliances"}, {"symbol": "F28G 3/00", "text": "Rotary appliances"}, {"symbol": "F28G 5/00", "text": "Cleaning by distortion"}, {"symbol": "F28G 7/00", "text": "Cleaning by vibration"}, {"symbol": "F28G 9/00", "text": "Cleaning by flushing or washing, e.g. with chemical solvents"}, {"symbol": "F28G 11/00", "text": "Cleaning by combustion processes, e.g. using squibs, using travelling burners"}, {"symbol": "F28G 13/00", "text": "Appliances or processes not covered by groups F28G 1/00 to F28G 11/00; Combinations of appliances or processes covered by groups F28G 1/00 to F28G 11/00"}, {"symbol": "F28G 15/00", "text": "Details"}]}]}, {"symbol": "F41", "text": "WEAPONS", "children": [{"symbol": "F41A", "text": "FUNCTIONAL FEATURES OR DETAILS COMMON TO BOTH SMALLARMS AND ORDNANCE, e.g. CANNONS; MOUNTINGS FOR SMALLARMS OR ORDNANCE", "children": [{"symbol": "F41A 1/00", "text": "Missile propulsion characterised by the use of explosive or combustible propellant charges"}, {"symbol": "F41A 3/00", "text": "Breech mechanism, e.g. locks"}, {"symbol": "F41A 5/00", "text": "Mechanisms or systems operated by propellant charge energy for automatically opening the lock"}, {"symbol": "F41A 7/00", "text": "Auxiliary mechanisms for bringing the breech-block or bolt or the barrel to the starting position before automatic firing"}, {"symbol": "F41A 9/00", "text": "Feeding or loading of ammunition"}, {"symbol": "F41A 11/00", "text": "Assembly or disassembly features; Modular concepts; Articulated or collapsible guns"}, {"symbol": "F41A 13/00", "text": "Cooling or heating systems"}, {"symbol": "F41A 15/00", "text": "Cartridge extractors, i.e. devices for pulling cartridges or cartridge cases at least partially out of the cartridge chamber; Cartridge ejectors, i.e. devices for throwing the extracted cartridges or cartridge cases free of the gun"}, {"symbol": "F41A 17/00", "text": "Safety arrangements, e.g. safeties"}, {"symbol": "F41A 19/00", "text": "Firing or trigger mechanisms; Cocking mechanisms"}, {"symbol": "F41A 21/00", "text": "Barrels; Gun tubes; Muzzle attachments; Barrel mounting means"}, {"symbol": "F41A 23/00", "text": "Gun mountings, e.g. on vehicles; Disposition of guns on vehicles"}, {"symbol": "F41A 25/00", "text": "Gun mountings permitting recoil or return to battery, e.g. gun cradles; Barrel buffers or brakes"}, {"symbol": "F41A 27/00", "text": "Gun mountings permitting traversing or elevating movement, e.g. gun carriages"}, {"symbol": "F41A 29/00", "text": "Cleaning or lubricating arrangements"}, {"symbol": "F41A 31/00", "text": "Testing arrangements"}, {"symbol": "F41A 33/00", "text": "Adaptations for training"}, {"symbol": "F41A 35/00", "text": "Accessories or details not otherwise provided for"}, {"symbol": "F41A 99/00", "text": "Subject matter not provided for in other groups of this subclass"}]}, {"symbol": "F41B", "text": "WEAPONS FOR PROJECTING MISSILES WITHOUT USE OF EXPLOSIVE OR COMBUSTIBLE PROPELLANT CHARGE; WEAPONS NOT OTHERWISE PROVIDED FOR", "children": [{"symbol": "F41B 1/00", "text": "Blow guns, i.e. tubes for impelling projectiles, e.g. peas or darts, by the force of the breath"}, {"symbol": "F41B 3/00", "text": "Sling weapons"}, {"symbol": "F41B 4/00", "text": "Friction-wheel operated launchers"}, {"symbol": "F41B 5/00", "text": "Bows; Crossbows"}, {"symbol": "F41B 6/00", "text": "Electromagnetic launchers"}, {"symbol": "F41B 7/00", "text": "Spring guns"}, {"symbol": "F41B 9/00", "text": "Liquid ejecting guns, e.g. water pistols"}, {"symbol": "F41B 11/00", "text": "Air guns, e.g. air pistols; Steam guns"}, {"symbol": "F41B 13/00", "text": "Thrusting-weapons"}, {"symbol": "F41B 15/00", "text": "Weapons not otherwise provided for"}]}, {"symbol": "F41C", "text": "SMALLARMS, e.g. PISTOLS, RIFLES", "children": [{"symbol": "F41C 3/00", "text": "Pistols, e.g. revolvers"}, {"symbol": "F41C 7/00", "text": "Shoulder-fired smallarms, e.g. rifles, carbines, shotguns"}, {"symbol": "F41C 9/00", "text": "Other smallarms, e.g. hidden smallarms or smallarms specially adapted for underwater use"}, {"symbol": "F41C 23/00", "text": "Butts; Butt plates; Stocks"}, {"symbol": "F41C 27/00", "text": "Accessories; Details or attachments not otherwise provided for"}, {"symbol": "F41C 33/00", "text": "Means for wearing or carrying smallarms"}]}, {"symbol": "F41F", "text": "APPARATUS FOR LAUNCHING PROJECTILES OR MISSILES FROM BARRELS, e.g. CANNONS", "children": [{"symbol": "F41F 1/00", "text": "Launching apparatus for projecting projectiles or missiles from barrels, e.g. cannons"}, {"symbol": "F41F 3/00", "text": "Rocket or torpedo launchers"}, {"symbol": "F41F 5/00", "text": "Launching-apparatus for gravity-propelled missiles or projectiles"}, {"symbol": "F41F 7/00", "text": "Launching-apparatus for projecting missiles or projectiles otherwise than from barrels"}]}, {"symbol": "F41G", "text": "WEAPON SIGHTS; AIMING", "children": [{"symbol": "F41G 1/00", "text": "Sighting devices"}, {"symbol": "F41G 3/00", "text": "Aiming means; Laying means"}, {"symbol": "F41G 5/00", "text": "Elevating or traversing control systems for guns"}, {"symbol": "F41G 7/00", "text": "Direction control systems for self-propelled missiles", "children": [{"symbol": "F41G 7/20", "text": "based on continuous observation of target position"}]}, {"symbol": "F41G 9/00", "text": "Systems for controlling missiles or projectiles, not provided for elsewhere"}, {"symbol": "F41G 11/00", "text": "Details of sighting or aiming apparatus; Accessories"}]}, {"symbol": "F41H", "text": "ARMOUR; ARMOURED TURRETS; ARMOURED OR ARMED VEHICLES; MEANS OF ATTACK OR DEFENCE, e.g. CAMOUFLAGE, IN GENERAL", "children": [{"symbol": "F41H 1/00", "text": "Personal protection-gear"}, {"symbol": "F41H 3/00", "text": "Camouflage, i.e. means or methods for concealment or disguise"}, {"symbol": "F41H 5/00", "text": "Armour; Armour plates", "children": [{"symbol": "F41H 5/007", "text": "Reactive armour; Dynamic armour"}]}, {"symbol": "F41H 7/00", "text": "Armoured or armed vehicles"}, {"symbol": "F41H 9/00", "text": "Equipment for attack or defence by spreading flame, gas, or smoke; Chemical warfare equipment"}, {"symbol": "F41H 11/00", "text": "Defence installations; Defence devices"}, {"symbol": "F41H 13/00", "text": "Means of attack or defence not otherwise provided for"}]}, {"symbol": "F41J", "text": "TARGETS; TARGET RANGES; BULLET CATCHERS", "children": [{"symbol": "F41J 1/00", "text": "Targets, e.g. stationary"}, {"symbol": "F41J 2/00", "text": "Reflecting targets, e.g. radar-reflector targets; Active targets transmitting electromagnetic waves"}, {"symbol": "F41J 3/00", "text": "Targets for arrows or darts, e.g. for sporting or amusement purposes"}, {"symbol": "F41J 5/00", "text": "Target indicating systems; Target-hit or score detecting systems"}, {"symbol": "F41J 7/00", "text": "Movable targets which are stationary when fired at"}, {"symbol": "F41J 9/00", "text": "Moving targets, i.e. moving when fired at"}]}]}, {"symbol": "F42", "text": "AMMUNITION; BLASTING", "children": [{"symbol": "F42B", "text": "EXPLOSIVE CHARGES, e.g. FOR BLASTING; FIREWORKS; AMMUNITION", "children": [{"symbol": "F42B 1/00", "text": "Explosive charges characterised by form or shape but not dependent on shape of container"}, {"symbol": "F42B 3/00", "text": "Blasting cartridges, i.e. case and explosive"}, {"symbol": "F42B 4/00", "text": "Fireworks, i.e. pyrotechnic devices for amusement, display, illumination, or signal purposes"}, {"symbol": "F42B 5/00", "text": "Cartridge ammunition, e.g. separately-loaded propellant charges"}, {"symbol": "F42B 6/00", "text": "Projectiles or missiles specially adapted for projection without use of explosive or combustible propellant charge, e.g. for blow guns, bows or crossbows, hand-held spring or air guns"}, {"symbol": "F42B 7/00", "text": "Shotgun ammunition"}, {"symbol": "F42B 8/00", "text": "Practice or training ammunition"}, {"symbol": "F42B 10/00", "text": "Means for influencing, e.g. improving, the aerodynamic properties of projectiles or missiles; Arrangements on projectiles or missiles for stabilising, steering, range-reducing, range-increasing or fall-retarding"}, {"symbol": "F42B 12/00", "text": "Projectiles, missiles or mines characterised by the warhead, the intended effect, or the material", "children": [{"symbol": "F42B 12/02", "text": "characterised by the warhead or the intended effect"}]}, {"symbol": "F42B 14/00", "text": "Projectiles or missiles characterised by arrangements for guiding or sealing them inside barrels, or for lubricating or cleaning barrels"}, {"symbol": "F42B 15/00", "text": "Self-propelled projectiles or missiles, e.g. rockets; Guided missiles"}, {"symbol": "F42B 17/00", "text": "Rocket torpedoes, i.e. missiles provided with separate propulsion means for movement through air and through water"}, {"symbol": "F42B 19/00", "text": "Marine torpedoes, e.g. launched by surface vessels or submarines"}, {"symbol": "F42B 21/00", "text": "Depth charges"}, {"symbol": "F42B 22/00", "text": "Marine mines, e.g. launched by surface vessels or submarines"}, {"symbol": "F42B 23/00", "text": "Land mines"}, {"symbol": "F42B 25/00", "text": "Fall bombs"}, {"symbol": "F42B 27/00", "text": "Hand grenades"}, {"symbol": "F42B 29/00", "text": "Noiseless, smokeless, or flashless missiles launched by their own explosive propellant"}, {"symbol": "F42B 30/00", "text": "Projectiles or missiles, not otherwise provided for, characterised by the ammunition class or type, e.g. by the launching apparatus or weapon used"}, {"symbol": "F42B 33/00", "text": "Manufacture of ammunition; Dismantling of ammunition; Apparatus therefor"}, {"symbol": "F42B 35/00", "text": "Testing or checking of ammunition"}, {"symbol": "F42B 39/00", "text": "Packaging or storage of ammunition or explosive charges; Safety features thereof; Cartridge belts or bags"}, {"symbol": "F42B 99/00", "text": "Subject matter not provided for in other groups of this subclass"}]}, {"symbol": "F42C", "text": "AMMUNITION FUZES", "children": [{"symbol": "F42C 1/00", "text": "Impact fuzes, i.e. fuzes actuated only by ammunition impact"}, {"symbol": "F42C 3/00", "text": "Fuzes actuated by exposure to a liquid, e.g. sea-water"}, {"symbol": "F42C 5/00", "text": "Fuzes actuated by exposure to a predetermined ambient fluid pressure"}, {"symbol": "F42C 7/00", "text": "Fuzes actuated by application of a predetermined mechanical force, e.g. tension, torsion, pressure"}, {"symbol": "F42C 9/00", "text": "Time fuzes; Combined time- and percussion- or pressure-actuated fuzes; Fuzes for timed self-destruction of ammunition"}, {"symbol": "F42C 11/00", "text": "Electric fuzes"}, {"symbol": "F42C 13/00", "text": "Proximity fuzes; Fuzes for remote detonation"}, {"symbol": "F42C 14/00", "text": "Fuzes characterised by the ammunition class or type"}, {"symbol": "F42C 15/00", "text": "Arming-means in fuzes; Safety means for preventing premature detonation of fuzes or charges"}, {"symbol": "F42C 17/00", "text": "Fuze-setting apparatus"}, {"symbol": "F42C 19/00", "text": "Details of fuzes"}, {"symbol": "F42C 21/00", "text": "Checking fuzes; Testing fuzes"}, {"symbol": "F42C 99/00", "text": "Subject matter not provided for in other groups of this subclass"}]}, {"symbol": "F42D", "text": "BLASTING", "children": [{"symbol": "F42D 1/00", "text": "Blasting methods or apparatus, e.g. for loading or tamping"}, {"symbol": "F42D 3/00", "text": "Particular applications of blasting techniques"}, {"symbol": "F42D 5/00", "text": "Safety arrangements"}, {"symbol": "F42D 7/00", "text": "Other blasting"}]}]}, {"symbol": "F99", "text": "SUBJECT MATTER NOT OTHERWISE PROVIDED FOR IN THIS SECTION", "children": [{"symbol": "F99Z", "text": "SUBJECT MATTER NOT OTHERWISE PROVIDED FOR IN THIS SECTION", "children": [{"symbol": "F99Z 99/00", "text": "Subject matter not otherwise provided for in this section"}]}]}]}